[
  {
    "title": "STARLUX: the small airline with big ambitions",
    "pubDate": "Wed, 25 Feb 2026 23:35:18 +0000",
    "contentSnippet": "STARLUX Airlines (JX/SJX) is a carrier based at Taoyuan International Airport in Taipei, the capital of Taiwan. It was founded in April 2017 by K.W. Chang, who remains as its CEO, and began regular flights on January 23rd, 2020, just shortly before restrictions on aviation were imposed due to the pandemic. Macau, Da Nang, and […]\nThe post STARLUX: the small airline with big ambitions appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/aviation-news/airline-news/starlux-the-small-airline-with-big-ambitions/",
    "source": "FlightRadar24"
  },
  {
    "title": "Viva Las Qantas: Flying Kangaroo sets its sights on Sin City",
    "contentSnippet": "The national carrier will launch a new seasonal non-stop service between Sydney and Las Vegas in December, operating three times per week on 787-9 Dreamliners until March 2027. It will allow Vegas-bound Australians to skip layovers in cities such as Los Angeles or San Francisco.",
    "pubDate": "Wed, 25 Feb 2026 22:59:45 +0000",
    "link": "https://australianaviation.com.au/2026/02/viva-las-qantas-flying-kangaroo-sets-its-sights-on-sin-city/",
    "source": "Australian Aviation"
  },
  {
    "title": "Vietnam’s $30 Billion Boeing Bet: What’s Driving the Bulk Deals",
    "contentSnippet": "Vietnam's $30B+ Boeing deals this month reflect surging aviation demand and strategic U.S. trade alignment amid rapid economic growth. We look at the factors behind the move.\nThe post Vietnam’s $30 Billion Boeing Bet: What’s Driving the Bulk Deals appeared first on AviationSource News.",
    "pubDate": "Wed, 25 Feb 2026 22:38:17 +0000",
    "link": "https://aviationsourcenews.com/vietnams-30-billion-boeing-bet-whats-driving-the-bulk-deals/",
    "source": "Aviation Source News"
  },
  {
    "title": "Aerolíneas Argentinas Achieves Historic Milestone: Record Surplus Without State Funding in 2025",
    "contentSnippet": "Argentina’s flag carrier, Aerolíneas Argentinas closed 2025 with an operating surplus of US$112.7 million without state aid, nearly double that achieved in 2024.\nThe post Aerolíneas Argentinas Achieves Historic Milestone: Record Surplus Without State Funding in 2025 appeared first on AviationSource News.",
    "pubDate": "Wed, 25 Feb 2026 22:16:07 +0000",
    "link": "https://aviationsourcenews.com/aerolineas-argentinas-achieves-historic-milestone-record-surplus-without-state-funding-in-2025/",
    "source": "Aviation Source News"
  },
  {
    "title": "Lockheed Martin Tests Missile-Evasion AI on X-62 VISTA",
    "contentSnippet": "The Have Remy Test Management Project saw USAF Test Pilot School students directly involved in an AI agent’s development, simulation and live trial with Lockheed Martin’s Skunk Works. The U.S. Air Force’s X-62 Variable Stability In-Flight Simulator Test Aircraft (VISTA) reached a new milestone when Lockheed Martin’s Skunk Works division and the Test Pilot School (TPS) […]",
    "pubDate": "Wed, 25 Feb 2026 22:11:51 +0000",
    "link": "https://theaviationist.com/2026/02/25/lockheed-martin-tests-missile-evasion-ai-on-x-62-vista/",
    "source": "The Aviationist"
  },
  {
    "title": "Turkey’s TB3 UCAV Flies from TCG Anadolu in NATO’s Steadfast Dart 26",
    "contentSnippet": "For the first time, NATO saw a naval UCAV conducting a live-fire exercise when the Baykar TB3 launched MAM-L guided munitions on a floating target. Turkey’s Bayraktar TB3 Unmanned Combat Aerial Vehicle (UCAV) attained two major milestones over the last week during NATO’s ongoing Steadfast Dart 2026 drill in the Baltic Sea. The TB3 demonstrated […]",
    "pubDate": "Wed, 25 Feb 2026 14:33:13 +0000",
    "link": "https://theaviationist.com/2026/02/25/turkeys-tb3-nato-steadfast-dart-26/",
    "source": "The Aviationist"
  },
  {
    "title": "The Ryanair fleet in February 2026",
    "pubDate": "Wed, 25 Feb 2026 06:00:41 +0000",
    "contentSnippet": "Ryanair (FR/RYR) is one of the most recognised and successful airlines in the world. Originally established in 1984 operating a single route from Waterford to London Gatwick, the now ultra-low-cost carrier is now the largest airline in Europe. Let’s take a look at the makeup of the Ryanair fleet as on February 2026. Ryanair operates […]\nThe post The Ryanair fleet in February 2026 appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/aviation-news/airline-news/ryanair-fleet/",
    "source": "FlightRadar24"
  },
  {
    "title": "Works begin on Sunshine Station for Melbourne Airport rail",
    "contentSnippet": "The federal and Victorian governments have released early designs for the Sunshine superhub, which will see a $4.1 billion investment to “untangle the complex rail junction” and create space for the much-delayed new airport rail link, which will join the Melbourne train network at the station.",
    "pubDate": "Wed, 25 Feb 2026 04:29:51 +0000",
    "link": "https://australianaviation.com.au/2026/02/works-begin-on-sunshine-station-for-melbourne-airport-rail/",
    "source": "Australian Aviation"
  },
  {
    "title": "Spirit Airlines Bankruptcy Update: Carrier Targets Early Summer Exit From Chapter 11",
    "contentSnippet": "Spirit Airlines’ bankruptcy plan would cut debt by billions and position the airline to exit Chapter 11 by early summer 2026. Finally, some good news for Spirit Airlines. The carrier says it has reached an agreement in principle with its secured creditors and DIP (debtor-in-possession) lenders, clearing a major hurdle in its Chapter 11 restructuring. […]\nThe post Spirit Airlines Bankruptcy Update: Carrier Targets Early Summer Exit From Chapter 11 appeared first on Avgeekery.",
    "pubDate": "Wed, 25 Feb 2026 01:24:37 +0000",
    "link": "https://avgeekery.com/spirit-airlines-bankruptcy-update-february-2026/",
    "source": "avgeekery"
  },
  {
    "title": "Airlines UK Annual Dinner 2026: Industry Champions Growth but Warns on Rising Costs",
    "contentSnippet": "The UK’s airline industry has hailed Government backing for expansion and sustainability while warning that rising costs risk undermining the nation’s global competitiveness. Speaking at the Airlines UK Annual Dinner 2026, Chair, Baroness Liz Sugg welcomed strong ministerial support for growth, airspace modernisation, airport expansion and the development of sustainable  [read more]\nThe post Airlines UK Annual Dinner 2026: Industry Champions Growth but Warns on Rising Costs appeared first on UK Aviation News.",
    "pubDate": "Wed, 25 Feb 2026 00:01:00 +0000",
    "link": "https://ukaviation.aero/airlines-uk-annual-dinner-2026-industry-champions-growth-but-warns-on-rising-costs/",
    "source": "UK Aviation News"
  },
  {
    "title": "Dubai Airshow Day 3: Orders for Airbus & Boeing",
    "contentSnippet": "Emirates has ordered eight Airbus A350s on the third day of the Dubai Airshow, while flydubai has signed a memorandum…\nThe post Dubai Airshow Day 3: Orders for Airbus & Boeing appeared first on SamChui.com.",
    "pubDate": "Wed, 19 Nov 2025 12:29:48 +0000",
    "link": "https://samchui.com/2025/11/19/dubai-airshow-day-3-orders-for-airbus-boeing/",
    "source": "Sam Chui"
  },
  {
    "title": "flydubai signs MoU for 75 Boeing 737 MAX Airplanes",
    "contentSnippet": "",
    "pubDate": "Wed, 19 Nov 2025 05:01:00 -0500",
    "link": "https://boeing.mediaroom.com/2025-11-19-flydubai-signs-MoU-for-75-Boeing-737-MAX-Airplanes",
    "source": "Boeing"
  },
  {
    "title": "The last Mad Dog: the MD-95 becomes the 717",
    "pubDate": "Wed, 18 Feb 2026 23:30:14 +0000",
    "contentSnippet": "The McDonnell Douglas MD-80 is one of the most important commercial aircraft in history, and it continues to operate in some countries around the world, mainly in the Americas, Africa, and the Middle East. We recently published a post on our blog about the history and current activity of the MD-80 in the United States, […]\nThe post The last Mad Dog: the MD-95 becomes the 717 appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/aircraft-stories/the-last-mad-dog-the-md-95-becomes-the-717/",
    "source": "FlightRadar24"
  },
  {
    "title": "Vietnam Airlines Finalizes Order for 50 Boeing 737 MAX Airplanes",
    "contentSnippet": "",
    "pubDate": "Wed, 18 Feb 2026 20:40:00 -0500",
    "link": "https://boeing.mediaroom.com/2026-02-18-Vietnam-Airlines-Finalizes-Order-for-50-Boeing-737-MAX-Airplanes",
    "source": "Boeing"
  },
  {
    "title": "TAP TP1240: Near-CFIT Incident in Prague on January 17th",
    "pubDate": "Wed, 18 Feb 2026 16:31:08 +0000",
    "contentSnippet": "On January 17, 2026, TAP Air Portugal flight TP1240, an Airbus A320neo operating from Lisbon (LIS) to Prague (PRG), descended well below the Minimum Safe Altitude (MSA) while on approach into the Czech capital. The Czech Civil Aviation Authority (UZPLN) disclosed the incident publicly on February 12, classifying it as a serious incident and formally […]\nThe post TAP TP1240: Near-CFIT Incident in Prague on January 17th appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/flight-tracking-news/major-incident/tap-flight-1240-prague-incident/",
    "source": "FlightRadar24"
  },
  {
    "title": "New Chief Inspector of Air Accidents appointed at AAIB",
    "contentSnippet": "The Air Accidents Investigation Branch (AAIB), Britains air accident investigators, has appointed Robert Balls as the new Chief of Air Accidents. He takes over the role with immediate effect replacing Crispin Orr, who had been in the role for nine years. Rob joined the AAIB as an inspector specialising in  [read more]\nThe post New Chief Inspector of Air Accidents appointed at AAIB appeared first on UK Aviation News.",
    "pubDate": "Wed, 11 Feb 2026 19:55:03 +0000",
    "link": "https://ukaviation.aero/new-chief-inspector-of-air-accidents-appointed-at-aaib/",
    "source": "UK Aviation News"
  },
  {
    "title": "Boeing and Alaska Airlines Announce Largest Airplane Order in Airline's History",
    "contentSnippet": "",
    "pubDate": "Wed, 07 Jan 2026 09:02:00 -0500",
    "link": "https://boeing.mediaroom.com/2026-01-07-Boeing-and-Alaska-Airlines-Announce-Largest-Airplane-Order-in-Airlines-History",
    "source": "Boeing"
  },
  {
    "title": "UPS MD-11 Crashes Near Louisville Airport",
    "contentSnippet": "On November 4, 2025, a UPS McDonnell Douglas MD-11 cargo aircraft crashed shortly after takeoff from Muhammad Ali…\nThe post UPS MD-11 Crashes Near Louisville Airport appeared first on SamChui.com.",
    "pubDate": "Wed, 05 Nov 2025 00:22:58 +0000",
    "link": "https://samchui.com/2025/11/05/ups-md-11-crashes-near-louisville-airport/",
    "source": "Sam Chui"
  },
  {
    "title": "Bullet Holes Found on American Airlines 737 After Medellín–Miami Flight",
    "contentSnippet": "An American Airlines 737 MAX 8 was taken out of service on Monday after punctures were discovered on the wing following a flight from Medellín to Miami. Passengers on the American Airlines flight from Colombia to Miami on Monday morning noticed nothing unusual. The Boeing 737 MAX 8 flew at 36,000 feet over the Caribbean, […]\nThe post Bullet Holes Found on American Airlines 737 After Medellín–Miami Flight appeared first on Avgeekery.",
    "pubDate": "Tue, 24 Feb 2026 22:20:47 +0000",
    "link": "https://avgeekery.com/bullet-holes-found-on-american-airlines-737-miami/",
    "source": "avgeekery"
  },
  {
    "title": "GA-ASI to Integrate JASSM, LRASM and JSM Missiles on MQ-9B",
    "contentSnippet": "GA-ASI plans to fly an MQ-9B with at least one between JASSM, LRASM and JSM in 2026, responding to demand for greater long-range fire capabilities in the Western Pacific.  General Atomics Aeronautical Systems (GA-ASI) has announced on Feb. 23, 2026, that it is working on introducing air-launched standoff surface-strike capability on its MQ-9B Remotely Piloted […]",
    "pubDate": "Tue, 24 Feb 2026 20:23:31 +0000",
    "link": "https://theaviationist.com/2026/02/24/jassm-lrasm-jsm-mq-9b/",
    "source": "The Aviationist"
  },
  {
    "title": "F-35 Tested with AI-Enhanced Combat Identification Capability",
    "contentSnippet": "The F-35 has been tested with a new artificial intelligence-enhanced Combat Identification capability to help pilots quickly identify unknown emitters detected by its sensors. Lockheed Martin has announced that it has tested a new artificial intelligence (AI)-enhanced Combat Identification (Combat ID) capability on the F-35 Lightning II. The test marks the first time AI has […]",
    "pubDate": "Tue, 24 Feb 2026 15:46:21 +0000",
    "link": "https://theaviationist.com/2026/02/24/f-35-ai-combat-id/",
    "source": "The Aviationist"
  },
  {
    "title": "Dublin based ACIA Delivers Third ATR 72-600 to PNG Air",
    "contentSnippet": "ACIA Aero Leasing has delivered a third ATR 72-600 passenger aircraft to PNG Air, further strengthening the Papua New Guinean carrier’s domestic fleet. The regional aircraft leasing specialist confirmed that the latest turboprop has been placed on lease with PNG Air, marking another milestone in the growing relationship between the two companies. The delivery  [read more]\nThe post Dublin based ACIA Delivers Third ATR 72-600 to PNG Air appeared first on UK Aviation News.",
    "pubDate": "Tue, 24 Feb 2026 15:34:43 +0000",
    "link": "https://ukaviation.aero/dublin-based-acia-delivers-third-atr-72-600-to-png-air/",
    "source": "UK Aviation News"
  },
  {
    "title": "B-21 Raider’s Production to Accelerate, First Delivery in 2027",
    "contentSnippet": "The U.S. Air Force and Northrop Grumman are working to accelerate the production and the delivery of the B-21 Raider, with the first bomber arriving at Ellsworth next year. The Department of the Air Force and Northrop Grumman have announced an agreement to expand the production of the new B-21 Raider stealth bomber and accelerate […]",
    "pubDate": "Tue, 24 Feb 2026 14:24:21 +0000",
    "link": "https://theaviationist.com/2026/02/24/b-21-raiders-accelerate-production/",
    "source": "The Aviationist"
  },
  {
    "title": "Here’s Our First Look At The YFQ-44A Fury Fighter Drone Carrying An AIM-120 Missile",
    "contentSnippet": "The YFQ-44A has carried out its first captive carry evaluations with an inert AIM-120 AMRAAM missile as the U.S. Air Force entered the weapons integration testing phase of the Collaborative Combat Aircraft program. On Feb. 23, 2026, the U.S. Air Force released the first photo of an Anduril’s YFQ-44A Fury “fighter drone” carrying an AIM-120 […]",
    "pubDate": "Tue, 24 Feb 2026 08:57:49 +0000",
    "link": "https://theaviationist.com/2026/02/24/yfq-44a-fury-aim-120-missile/",
    "source": "The Aviationist"
  },
  {
    "title": "Transport Canada Advances Gulfstream Certification After Trump’s Tariff Threat",
    "contentSnippet": "For several years, Transport Canada’s Gulfstream certification process was mainly a technical matter. It was discussed in data sheets, compliance documents, and official communications between regulators. But recently, it became a political issue. On 29 January, President Donald Trump publicly accused Canada of “wrongfully, illegally, and steadfastly” refusing to certify four Gulfstream models: the G500, […]\nThe post Transport Canada Advances Gulfstream Certification After Trump’s Tariff Threat appeared first on Avgeekery.",
    "pubDate": "Tue, 24 Feb 2026 01:35:58 +0000",
    "link": "https://avgeekery.com/transport-canada-advances-gulfstream-certification/",
    "source": "avgeekery"
  },
  {
    "title": "Dubai Airshow 2025 Day 2: Big Orders for Airbus",
    "contentSnippet": "After a quiet Day 1, Airbus opened Day 2 with major orders from Etihad Airways, flydubai, Air Europa and Ethiopian…\nThe post Dubai Airshow 2025 Day 2: Big Orders for Airbus appeared first on SamChui.com.",
    "pubDate": "Tue, 18 Nov 2025 12:08:53 +0000",
    "link": "https://samchui.com/2025/11/18/dubai-airshow-2025-day-2-big-orders-for-airbus/",
    "source": "Sam Chui"
  },
  {
    "title": "Propped up: New Zealand’s turboprop connections",
    "pubDate": "Tue, 17 Feb 2026 23:30:12 +0000",
    "contentSnippet": "The domestic aviation market in New Zealand is mainly served by turboprop aircraft, enabling enhanced connectivity between different cities across the country and the transport of cargo to cities where bigger aircraft cannot land. Air New Zealand is the leading airline, having strengthened its domestic operations following the acquisition of several airlines in the country […]\nThe post Propped up: New Zealand’s turboprop connections appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/aircraft-stories/propped-up-new-zealand-turboprop-connections/",
    "source": "FlightRadar24"
  },
  {
    "title": "Interplanetary Goat! Brussels Airlines Just Added A New Tintin Aircraft To Their Fleet",
    "pubDate": "Tue, 17 Feb 2026 14:15:22 +0000",
    "contentSnippet": "Brussels Airlines (SN-BEL) is no stranger to creative aircraft liveries. Their latest achievement, a stunning celebration to Tintin’s lunar adventure, rolled out of Airborne Colours’ painting facility in Teesside, England on February 11th. The Airbus A320-200 (OO-SNJ) is the second Tintin-themed aircraft in Brussels arsenal. It joins a colorful fleet that historically has honored Belgian […]\nThe post Interplanetary Goat! Brussels Airlines Just Added A New Tintin Aircraft To Their Fleet appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/flight-tracking-news/just-for-fun/brussels-airlines-new-tintin-aircraft/",
    "source": "FlightRadar24"
  },
  {
    "title": "An Honest Update From Me – Life, Aviation & What’s Next?",
    "contentSnippet": "2025 has been a year of profound change for me. I lost my mother, the person who first…\nThe post An Honest Update From Me – Life, Aviation & What’s Next? appeared first on SamChui.com.",
    "pubDate": "Tue, 13 Jan 2026 12:20:13 +0000",
    "link": "https://samchui.com/2026/01/13/an-honest-update-from-me-life-aviation-whats-next-2/",
    "source": "Sam Chui"
  },
  {
    "title": "Aviation Capital Group Orders 50 Boeing 737 MAX Jets",
    "contentSnippet": "",
    "pubDate": "Tue, 13 Jan 2026 03:19:00 -0500",
    "link": "https://boeing.mediaroom.com/2026-01-13-Aviation-Capital-Group-Orders-50-Boeing-737-MAX-Jets",
    "source": "Boeing"
  },
  {
    "title": "Air India Orders 30 Boeing 737 MAX Jets to Expand Single-Aisle Fleet",
    "contentSnippet": "",
    "pubDate": "Thu, 29 Jan 2026 11:58:00 -0500",
    "link": "https://boeing.mediaroom.com/2026-01-29-Air-India-Orders-30-Boeing-737-MAX-Jets-to-Expand-Single-Aisle-Fleet",
    "source": "Boeing"
  },
  {
    "title": "WATCH: Air France 787 Dreamliner Captured as You’ve Never Seen It Before",
    "contentSnippet": "This Air France 787 takes center stage in a breathtakingly beautiful aviation film that highlights the beauty of modern widebody flight. Few things lend themselves to beautiful cinematography quite like aviation. Metal, light, motion, and altitude all come together when filming an airplane against the open sky. When captured well, it can look almost unreal. […]\nThe post WATCH: Air France 787 Dreamliner Captured as You’ve Never Seen It Before appeared first on Avgeekery.",
    "pubDate": "Thu, 26 Feb 2026 23:51:00 +0000",
    "link": "https://avgeekery.com/air-france-787-dreamliner-film/",
    "source": "avgeekery"
  },
  {
    "title": "Sleeping in Airports: A Survival Guide for Long Layovers",
    "contentSnippet": "A travelers guide to picking sleeping areas in airports during long layovers, with smart spot-picking, safety habits, and pod options. \nThe post Sleeping in Airports: A Survival Guide for Long Layovers appeared first on AviationSource News.",
    "pubDate": "Thu, 26 Feb 2026 23:45:25 +0000",
    "link": "https://aviationsourcenews.com/sleeping-in-airports-a-survival-guide-for-long-layovers/",
    "source": "Aviation Source News"
  },
  {
    "title": "Additional F-15s, F-22s and F-35s are Arriving to Reinforce U.S. Buildup in Middle East",
    "contentSnippet": "Additional fighter and CSAR assets are being deployed to multiple bases across the Middle East as preparations for a potential attack on Iran appear to intensify. The last two days saw another influx of U.S. assets in Europe on their way to the Middle East, where they will join the buildup. In fact, between Feb. […]",
    "pubDate": "Thu, 26 Feb 2026 22:59:43 +0000",
    "link": "https://theaviationist.com/2026/02/26/additional-fighters-reinforce-us-buildup/",
    "source": "The Aviationist"
  },
  {
    "title": "Qantas Group Delivers Strong 1H26 Result Amid Major Fleet Renewal",
    "contentSnippet": "Qantas Group has seen a 5% increase in underlying profit for the 1H26 period, with CEO Vanessa Hudson declaring it an \"exciting new era\" for the Flying Kangaroo.\nThe post Qantas Group Delivers Strong 1H26 Result Amid Major Fleet Renewal appeared first on AviationSource News.",
    "pubDate": "Thu, 26 Feb 2026 22:52:57 +0000",
    "link": "https://aviationsourcenews.com/qantas-group-delivers-strong-1h26-result-amid-major-fleet-renewal/",
    "source": "Aviation Source News"
  },
  {
    "title": "American Airlines to Boost Miami MIA Hub with $1B Concourse D Expansion",
    "contentSnippet": "American Airlines and Miami‑Dade County will invest roughly $1–1.1 billion to expand Concourse D at Miami International Airport, adding a 17‑gate Concourse D60. \nThe post American Airlines to Boost Miami MIA Hub with $1B Concourse D Expansion appeared first on AviationSource News.",
    "pubDate": "Thu, 26 Feb 2026 22:28:32 +0000",
    "link": "https://aviationsourcenews.com/american-airlines-to-boost-miami-mia-hub-with-1b-concourse-d-expansion/",
    "source": "Aviation Source News"
  },
  {
    "title": "Lockheed Martin Australia marks milestone C-130J program delivery",
    "contentSnippet": "The aircraft wing flap ship-set is manufactured by Quickstep, a subsidiary company of ASDAM, a leading national manufacturer and provider of defence equipment. The C-130J aircraft is manufactured at Quickstep’s facility in Bankstown Airport and is set to be the 300th ship-set delivered to Lockheed Martin.",
    "pubDate": "Thu, 26 Feb 2026 22:27:32 +0000",
    "link": "https://australianaviation.com.au/2026/02/lockheed-martin-australia-marks-milestone-c-130j-program-delivery/",
    "source": "Australian Aviation"
  },
  {
    "title": "Viva Las Vegas! Qantas Launches World-First Nonstop Flights from Sydney",
    "contentSnippet": "This December, Qantas will become the first airline in the world to operate a non-stop route between Australia and Las Vegas.\nThe post Viva Las Vegas! Qantas Launches World-First Nonstop Flights from Sydney appeared first on AviationSource News.",
    "pubDate": "Thu, 26 Feb 2026 22:01:11 +0000",
    "link": "https://aviationsourcenews.com/viva-las-vegas-qantas-launches-world-first-nonstop-flights-from-sydney/",
    "source": "Aviation Source News"
  },
  {
    "title": "Pokémon Turns 30: ANA Launches Red, Green, and Blue Themed Jets in 2026",
    "contentSnippet": "All Nippon Airways (ANA) will roll out three special livery jets in themed colours this year, to celebrate the 30th anniversary of the beloved Pokémon franchise.\nThe post Pokémon Turns 30: ANA Launches Red, Green, and Blue Themed Jets in 2026 appeared first on AviationSource News.",
    "pubDate": "Thu, 26 Feb 2026 21:42:05 +0000",
    "link": "https://aviationsourcenews.com/pokemon-turns-30-ana-launches-red-green-and-blue-themed-jets-in-2026/",
    "source": "Aviation Source News"
  },
  {
    "title": "Former U.S. Air Force Pilot Arrested for Allegedly Training Chinese Military Pilots",
    "contentSnippet": "Gerald “Runner” Brown, a retired USAF fighter pilot, is accused of violating the Arms Export Control Act by providing combat aviation training to PLAAF pilots without a State Department license.  A former U.S. Air Force pilot, Gerald Eddie Brown, Jr., callsign “Runner,” was arrested on Feb. 25, 2026. According to the details released by the […]",
    "pubDate": "Thu, 26 Feb 2026 21:17:05 +0000",
    "link": "https://theaviationist.com/2026/02/26/former-usaf-pilot-training-chinese-pilots/",
    "source": "The Aviationist"
  },
  {
    "title": "KLM Unveils Summer Schedule With Over 160 destinations",
    "contentSnippet": "This summer season, from March 29 through October 25, 2026, KLM will offer a schedule with 164 destinations worldwide, including 96 in Europe and 68 intercontinental destinations. \nThe post KLM Unveils Summer Schedule With Over 160 destinations appeared first on AviationSource News.",
    "pubDate": "Thu, 26 Feb 2026 21:15:42 +0000",
    "link": "https://aviationsourcenews.com/klm-unveils-summer-schedule-with-over-160-destinations/",
    "source": "Aviation Source News"
  },
  {
    "title": "Norse Atlantic Eyes First Full-Year Profit in 2026 After 27% Q4 Revenue Surge",
    "contentSnippet": "A shift to a new operational model has reaped rewards for Norse Atlantic, with the carrier projecting its first full-year profit in 2026 after reporting a 27% revenue surge in Q4 2025.\nThe post Norse Atlantic Eyes First Full-Year Profit in 2026 After 27% Q4 Revenue Surge appeared first on AviationSource News.",
    "pubDate": "Thu, 26 Feb 2026 20:59:43 +0000",
    "link": "https://aviationsourcenews.com/norse-atlantic-eyes-first-full-year-profit-in-2026-after-27-q4-revenue-surge/",
    "source": "Aviation Source News"
  },
  {
    "title": "B-52’s New F130 Engine Complete Altitude and Operability Testing",
    "contentSnippet": "Rolls-Royce and the U.S. Air Force validated the F130’s ability to meet performance requirements for the B-52 missions, getting closer to flight testing. Engine maker Rolls-Royce announced on Feb. 24, 2026, the successful completion of altitude and operability testing for the F130 engine at the U.S. Air Force Arnold Engineering Development Complex (AEDC) in Tullahoma, […]",
    "pubDate": "Thu, 26 Feb 2026 14:56:39 +0000",
    "link": "https://theaviationist.com/2026/02/26/b-52-f130-engine-altitude-operability-testing/",
    "source": "The Aviationist"
  },
  {
    "title": "‘Greedy’ Qantas slammed for bumper profits amid layoffs",
    "contentSnippet": "The ASU, which is currently butting heads with the Flying Kangaroo over job cuts at the airline’s Mascot HQ, said it is “disappointed that Qantas has announced further redundancies at the same time they are unveiling a massive $1.46 billion profit”.",
    "pubDate": "Thu, 26 Feb 2026 03:48:51 +0000",
    "link": "https://australianaviation.com.au/2026/02/greedy-qantas-slammed-for-bumper-profits-amid-layoffs/",
    "source": "Australian Aviation"
  },
  {
    "title": "Link Airways announces new Launceston to Canberra service",
    "contentSnippet": "The new service is set to operate four times a week from 6 May on Link’s Saab 340B aircraft, adding 14,000 seats per year. It will be the first time Link Airways flies directly out of Launceston, connecting over 90,000 people from Tasmania’s second largest city to the nation's capital.",
    "pubDate": "Thu, 26 Feb 2026 03:25:59 +0000",
    "link": "https://australianaviation.com.au/2026/02/link-airways-announces-new-launceston-to-canberra-service/",
    "source": "Australian Aviation"
  },
  {
    "title": "Oh, big stretch: Virgin plans pets-in-cabins expansion",
    "contentSnippet": "The airline, which launched the service in October, has said it intends to continue offering the option, with plans to grow it to select flights to and from Adelaide and Launceston. It follows an announcement last month that the trial would be extended to the end of June.",
    "pubDate": "Thu, 26 Feb 2026 03:17:02 +0000",
    "link": "https://australianaviation.com.au/2026/02/oh-big-stretch-virgin-plans-pets-in-cabins-expansion/",
    "source": "Australian Aviation"
  },
  {
    "title": "Miami International Airport Unveils $1 Billion Concourse D Expansion Led by American Airlines",
    "contentSnippet": "American Airlines and Miami-Dade County officials have revealed plans for a sweeping $1 billion expansion of Concourse D at Miami International Airport (MIA). The plans for the project, which will update one of the airport’s older gate areas and strengthen American’s position as the main airline at MIA, were unveiled on Wednesday, 25 February, by […]\nThe post Miami International Airport Unveils $1 Billion Concourse D Expansion Led by American Airlines appeared first on Avgeekery.",
    "pubDate": "Thu, 26 Feb 2026 02:58:41 +0000",
    "link": "https://avgeekery.com/miami-international-airport-d60-american-airlines/",
    "source": "avgeekery"
  },
  {
    "title": "Qantas half-year profit nears $1.5bn, loyalty overhaul on the way",
    "contentSnippet": "The Flying Kangaroo increased pre-tax profits by $71 million over the same time last year, with statutory profit after tax up $2 million to $925 million for the first half of the 2025–26 financial year. It comes after the airline took delivery of nine new aircraft in the half, including its first A321XLRs.",
    "pubDate": "Thu, 26 Feb 2026 01:02:37 +0000",
    "link": "https://australianaviation.com.au/2026/02/qantas-half-year-profit-nears-1-5bn-loyalty-overhaul-on-the-way/",
    "source": "Australian Aviation"
  },
  {
    "title": "U.S. Air Force C-146 Wolfhound Damaged During Exercise in the Philippines",
    "contentSnippet": "A C-146A Wolfhound operated by AFSOC reportedly struck a concrete barrier while taking off from a road during an exercise, causing injuries to the five occupants and significant damage to the aircraft. The news comes via The Associated Press (AP), who reached out to U.S. Department of Defense sources for comment on the incident but […]",
    "pubDate": "Thu, 26 Feb 2026 00:03:52 +0000",
    "link": "https://theaviationist.com/2026/02/26/usaf-c-146-wolfhound-damaged-philippines/",
    "source": "The Aviationist"
  },
  {
    "title": "44 Years Later, the Boeing 757 is Still a Powerhouse in the Skies",
    "contentSnippet": "The Boeing 757 is still flying after 44 years of service. It is clearly an older design and faces competition from other manufacturers with newer aircraft. However, the 757 has some design features that still make it a capable performer with definite advantages over more modern passenger jets. The Boeing 757 is Still Flying After […]\nThe post 44 Years Later, the Boeing 757 is Still a Powerhouse in the Skies appeared first on Avgeekery.",
    "pubDate": "Thu, 19 Feb 2026 15:13:07 +0000",
    "link": "https://avgeekery.com/boeing-757-is-still-a-powerhouse-in-the-skies/",
    "source": "avgeekery"
  },
  {
    "title": "Finnish Air Force F-18 confirmed as first aircraft for RIAT 2026",
    "contentSnippet": "The first aircraft for this summer’s Royal International Air Tattoo has been revealed, with a Finnish Air Force F-18 set to take part in the flying display at RAF Fairford. With less than six months to go until the Gloucestershire air base is transformed into a world-renowned aviation showcase, organisers have confirmed the  [read more]\nThe post Finnish Air Force F-18 confirmed as first aircraft for RIAT 2026 appeared first on UK Aviation News.",
    "pubDate": "Thu, 19 Feb 2026 12:00:00 +0000",
    "link": "https://ukaviation.aero/finnish-air-force-f-18-confirmed-as-first-aircraft-for-riat-2026/",
    "source": "UK Aviation News"
  },
  {
    "title": "GeminiJets Airplane Models – November 25 New Release + Discounts",
    "contentSnippet": "I have been collecting GeminiJets airplane models since they launched 20 years ago! Video Special Offer This is a sponsored…\nThe post GeminiJets Airplane Models – November 25 New Release + Discounts appeared first on SamChui.com.",
    "pubDate": "Thu, 15 Jan 2026 06:33:32 +0000",
    "link": "https://samchui.com/2026/01/15/geminijets-airplane-models-november-25-new-release-discounts/",
    "source": "Sam Chui"
  },
  {
    "title": "Air Canada becomes latest A350 customer as it upgrades long-haul fleet",
    "contentSnippet": "Canadian flag carrier, Air Canada has disclosed a form order for eight Airbus A350-1000 wide body airlines making it the latest customer for the popular long range aircraft. Air Canada’s current long haul fleet is primarily made up of rBoeing 777 and 787 aircraft but the new order marks a  [read more]\nThe post Air Canada becomes latest A350 customer as it upgrades long-haul fleet appeared first on UK Aviation News.",
    "pubDate": "Thu, 12 Feb 2026 16:18:00 +0000",
    "link": "https://ukaviation.aero/air-canada-becomes-latest-a350-customer-as-it-upgrades-long-haul-fleet/",
    "source": "UK Aviation News"
  },
  {
    "title": "Airbus kicks off 2026 with 19 aircraft deliveries",
    "contentSnippet": "European OEM Airbus has made a strong start to 2026 delivering 19 aircraft to 15 customers in Janurary and gained orders for 49 aircraft. As usual, single-aisle aircraft dominated the deliveries with 15 A320neo family aircraft delivered, including 10 A321neos and five A320neos going to customers including Turkish Airlines, Wizz  [read more]\nThe post Airbus kicks off 2026 with 19 aircraft deliveries appeared first on UK Aviation News.",
    "pubDate": "Thu, 12 Feb 2026 16:03:43 +0000",
    "link": "https://ukaviation.aero/airbus-kicks-off-2026-with-19-aircraft-deliveries/",
    "source": "UK Aviation News"
  },
  {
    "title": "Photo Report: The New Philippine Airlines A350-1000",
    "contentSnippet": "On 17th January, 2026, Asia’s oldest airline, Philippine Airlines (PAL), celebrates its 85th Anniversary. The President of the Philippines, H.E.…\nThe post Photo Report: The New Philippine Airlines A350-1000 appeared first on SamChui.com.",
    "pubDate": "Sun, 18 Jan 2026 12:45:59 +0000",
    "link": "https://samchui.com/2026/01/18/photo-report-philippine-airlines-a350-1000/",
    "source": "Sam Chui"
  },
  {
    "title": "GeminiJets Airplane Models – December 25 New Release + Discounts",
    "contentSnippet": "I have been collecting GeminiJets airplane models since they launched 20 years ago! Video Special Offer This is a sponsored…\nThe post GeminiJets Airplane Models – December 25 New Release + Discounts appeared first on SamChui.com.",
    "pubDate": "Sat, 31 Jan 2026 15:30:33 +0000",
    "link": "https://samchui.com/2026/01/31/geminijets-airplane-models-december-25-new-release-discounts/",
    "source": "Sam Chui"
  },
  {
    "title": "Israel and U.S. Launch Attack on Iran",
    "contentSnippet": "Israel has launched a daylight preemptive attack against multiple Iranian targets, with the U.S. now joining the operation. Israel and the U.S. have launched on Feb. 28 a new wave of strikes against Iran, in what Israel has called a “preemptive attack.” Details are still fragmentary, but it appears multiple targets across Iran, including the capital […]",
    "pubDate": "Sat, 28 Feb 2026 09:49:38 +0000",
    "link": "https://theaviationist.com/2026/02/28/israel-us-attack-iran/",
    "source": "The Aviationist"
  },
  {
    "title": "USAir Flight 499: Snow, Tailwind, and a Runway That Ran Out",
    "contentSnippet": "Forty years after USAir Flight 499 overran a snowy runway in Erie, Pennsylvania, we examine how tailwind, speed, and snow combined to narrow the margins. On the morning of 21 February 1986, USAir Flight 499 was approaching Erie International Airport (ERI) in Pennsylvania’s northwestern corner in instrument conditions that left little room for error. Snow […]\nThe post USAir Flight 499: Snow, Tailwind, and a Runway That Ran Out appeared first on Avgeekery.",
    "pubDate": "Sat, 21 Feb 2026 20:28:30 +0000",
    "link": "https://avgeekery.com/usair-flight-499-snow-tailwind-runway-that-ran-out/",
    "source": "avgeekery"
  },
  {
    "title": "Evolito to Develop Electric Wheel Taxi System with Airbus and UK Government Support",
    "contentSnippet": "Oxfordshire based Evolito Limited has been selected to develop a cutting-edge electric wheel taxi system as part of a UK-backed aerospace consortium, in a move aimed at reducing emissions and operating costs during aircraft ground operations. The initiative, known as Project SONATA (System Optimisation of Non-Propulsive Energy in Aircraft Taxi Technologies  [read more]\nThe post Evolito to Develop Electric Wheel Taxi System with Airbus and UK Government Support appeared first on UK Aviation News.",
    "pubDate": "Sat, 21 Feb 2026 15:57:33 +0000",
    "link": "https://ukaviation.aero/evolito-to-develop-electric-wheel-taxi-system-with-airbus-and-uk-government-support/",
    "source": "UK Aviation News"
  },
  {
    "title": "Tweed New Haven Airport: A Century of Growth, Setbacks, and Modern Expansion",
    "contentSnippet": "Tweed New Haven Airport has weathered controversy, airline departures, and decades of uncertainty. Today, HVN is experiencing a dramatic resurgence driven by low-cost carriers and major expansion plans. The seed for New Haven’s own airport was planted almost literally in 1929 when a locally built Viking, piloted by Jack Tweed, disgorged a parachutist who landed […]\nThe post Tweed New Haven Airport: A Century of Growth, Setbacks, and Modern Expansion appeared first on Avgeekery.",
    "pubDate": "Sat, 21 Feb 2026 13:24:00 +0000",
    "link": "https://avgeekery.com/tweed-new-haven-airport-history/",
    "source": "avgeekery"
  },
  {
    "title": "B-2 Spirit Flies with Adaptable Communications Suite 4.0",
    "contentSnippet": "The Adaptable Communications Suite will allow the B-2A Spirit to operate efficiently within the Combined Joint All-Domain Command and Control environment. Sierra Nevada Corporation (SNC) has announced that a B-2A Spirit stealth bomber of the U.S. Air Force has flown for the first time with the Adaptable Communications Suite (ACS) 4.0. The milestone is part […]",
    "pubDate": "Mon, 23 Feb 2026 22:00:49 +0000",
    "link": "https://theaviationist.com/2026/02/23/b-2-spirit-adaptable-communications-suite-4-0/",
    "source": "The Aviationist"
  },
  {
    "title": "Flightradar24 expands global coverage with Aireon space-based ADS-B data",
    "pubDate": "Mon, 23 Feb 2026 16:09:35 +0000",
    "contentSnippet": "Flightradar24 is excited to expand its global flight tracking capabilities with the addition of Aireon space-based ADS-B data to the Flightradar24 platform, a major milestone in our commitment to truly global flight tracking coverage. The integration of Aireon data marks an important step toward ensuring visibility in areas not already covered by Flightradar24’s world-leading terrestrial […]\nThe post Flightradar24 expands global coverage with Aireon space-based ADS-B data appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/inside-flightradar24/flightradar24-expands-global-coverage-with-aireon-space-based-ads-b-data/",
    "source": "FlightRadar24"
  },
  {
    "title": "Dubai Airshow 2025 Day 1: Big Orders for Boeing",
    "contentSnippet": "Boeing has opened the Dubai Airshow 2025 on a strong note with Emirates placing an order for 65 Boeing 777X…\nThe post Dubai Airshow 2025 Day 1: Big Orders for Boeing appeared first on SamChui.com.",
    "pubDate": "Mon, 17 Nov 2025 13:40:06 +0000",
    "link": "https://samchui.com/2025/11/17/dubai-airshow-2025-day-1-big-order-for-boeing-from-emirates/",
    "source": "Sam Chui"
  },
  {
    "title": "Antonov An-22: The World’s Biggest Turboprop That Sounded Like A Buzz Saw",
    "contentSnippet": "It didn’t just fly. It thundered. The Antonov An-22 was a 176,000-pound Cold War workhorse whose unmistakable sound echoed for 60 years. Cargo planes have an unmistakable sound. Seasoned avgeeks can identify a plane just by the sound it makes as it’s flying overhead. The original C-5 was unique with its TF-39s screaming. The C-133 […]\nThe post Antonov An-22: The World’s Biggest Turboprop That Sounded Like A Buzz Saw appeared first on Avgeekery.",
    "pubDate": "Fri, 27 Feb 2026 20:00:11 +0000",
    "link": "https://avgeekery.com/antonov-an-22-worlds-biggest-turboprop/",
    "source": "avgeekery"
  },
  {
    "title": "Ukrainian Drone Factory Opens in the United Kingdom",
    "contentSnippet": "A new factory was unveiled in the UK dedicated to the production of Unmanned Aerial Systems for the Ukrainian Armed Forces. As the fourth anniversary of the Russian invasion of Ukraine took place, a new factory was unveiled in the UK dedicated to the production of Unmanned Aerial Systems (UAS) for the Ukrainian Armed Forces. […]",
    "pubDate": "Fri, 27 Feb 2026 19:37:59 +0000",
    "link": "https://theaviationist.com/2026/02/27/ukrainian-drone-factory-opens-uk/",
    "source": "The Aviationist"
  },
  {
    "title": "IAG posts record results as British Airways plans Boeing 787 expansion at Gatwick",
    "contentSnippet": "International Airlines Group (IAG), the parent company of British Airways and Aer Lingus, has reported record financial results for the year ended 31 December 2025, highlighting sustained demand for air travel and setting out ambitious fleet and network plans – including the deployment of new Boeing 787s at London Gatwick.  [read more]\nThe post IAG posts record results as British Airways plans Boeing 787 expansion at Gatwick appeared first on UK Aviation News.",
    "pubDate": "Fri, 27 Feb 2026 19:25:31 +0000",
    "link": "https://ukaviation.aero/iag-posts-record-results-as-british-airways-plans-boeing-787-expansion-at-gatwick/",
    "source": "UK Aviation News"
  },
  {
    "title": "U.S. Air Force Training Pilots for Next Generation Air Force One",
    "contentSnippet": "The U.S. Air Force leaned into a dual-track training program for the new VC-25B, leveraging civilian 747-8s and a newly acquired $400 million training fleet. The U.S. Air Force is one step closer to fielding its next presidential transport. Aircrews are now undergoing specialized training for the Boeing 747-8, the base airframe slated to replace […]",
    "pubDate": "Fri, 27 Feb 2026 18:51:48 +0000",
    "link": "https://theaviationist.com/2026/02/27/usaf-training-pilots-vc-25b/",
    "source": "The Aviationist"
  },
  {
    "title": "Leonardo Will Build UK’s New Medium Helicopter After Contract Award on Brink of Deadline",
    "contentSnippet": "After an official announcement at Leonardo’s Yeovil plant on Feb. 26 was scrubbed at the last minute, it is now reported that the UK Treasury has finally given the delay-plagued program its approval.  At least 23 AW149 helicopters will be built at Leonardo’s Yeovil helicopter factory, which the company has repeatedly said would be at […]",
    "pubDate": "Fri, 27 Feb 2026 18:05:09 +0000",
    "link": "https://theaviationist.com/2026/02/27/nmh-contract-awarded/",
    "source": "The Aviationist"
  },
  {
    "title": "AvTalk Episode 359: Reading them the ROTOR Act",
    "pubDate": "Fri, 27 Feb 2026 12:00:57 +0000",
    "contentSnippet": "On this week’s episode of AvTalk, after passing unanimously in the Senate, the US House of Representatives votes down the aviation safety-focused ROTOR Act, which was championed by the NTSB, pilots’ unions, and families of the victims of last year’s mid-air collision in Washington DC. The House will now turn to an alternate bill, the […]\nThe post AvTalk Episode 359: Reading them the ROTOR Act appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/avtalk-podcast/avtalk-359/",
    "source": "FlightRadar24"
  },
  {
    "title": "Qantas’ first international A321XLR route unveiled",
    "contentSnippet": "The next-generation jets, which boast a longer range than the 737-800s they are replacing, are already serving Sydney, Melbourne, Brisbane and Perth, and will commence on Brisbane-Perth services in May.",
    "pubDate": "Fri, 27 Feb 2026 05:26:23 +0000",
    "link": "https://australianaviation.com.au/2026/02/first-qantas-international-a321xlr-route-unveiled/",
    "source": "Australian Aviation"
  },
  {
    "title": "Air New Zealand hit with $59m first-half loss",
    "contentSnippet": "The airline has been roiled by continued headaches with global engine maintenance delays; a “slower than expected” domestic recovery; and a weak NZ dollar, and says it expects second-half earnings to be “broadly in line with, or modestly below, the first half”.",
    "pubDate": "Fri, 27 Feb 2026 01:39:54 +0000",
    "link": "https://australianaviation.com.au/2026/02/air-new-zealand-hit-with-59m-first-half-loss/",
    "source": "Australian Aviation"
  },
  {
    "title": "Virgin Australia posts $279m profit in first half since ASX return",
    "contentSnippet": "Australia’s second-largest airline group saw underlying EBIT grow to $490 million, up 11.7 per cent on the first half of 2024–25, though statutory net profit after tax was down 27.9 per cent to $341 million due to the exhaustion of deferred tax credits accrued through losses from COVID-19.",
    "pubDate": "Fri, 27 Feb 2026 00:14:36 +0000",
    "link": "https://australianaviation.com.au/2026/02/virgin-australia-posts-279m-profit-in-first-half-since-asx-return/",
    "source": "Australian Aviation"
  },
  {
    "title": "How Aviation Law Shapes the Future of Global Air Travel",
    "contentSnippet": "A look at how treaties, safety standards, and liability rules evolve, and why aviation law experts matter for airlines, airports, drones, and flyers.\nThe post How Aviation Law Shapes the Future of Global Air Travel appeared first on AviationSource News.",
    "pubDate": "Fri, 27 Feb 2026 00:00:24 +0000",
    "link": "https://aviationsourcenews.com/how-aviation-law-shapes-the-future-of-global-air-travel/",
    "source": "Aviation Source News"
  },
  {
    "title": "AvTalk Episode 358: Not how you want the day to go",
    "pubDate": "Fri, 20 Feb 2026 12:00:48 +0000",
    "contentSnippet": "Plenty to discuss on this week’s episode of AvTalk: More clarity on what exactly led to the closure of airspace above El Paso last week A United Airlines flight from Lagos experiences an extraordinary series of events (UA613 leg 1 | UA613 leg 2) ANA operates a 14 hour flight from Tokyo to Tokyo An […]\nThe post AvTalk Episode 358: Not how you want the day to go appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/avtalk-podcast/avtalk-358/",
    "source": "FlightRadar24"
  },
  {
    "title": "GeminiJets Airplane Models – October 25 New Release + Discounts",
    "contentSnippet": "I have been collecting GeminiJets since they launched 20 years ago! During difficult times, I have found that model collecting…\nThe post GeminiJets Airplane Models – October 25 New Release + Discounts appeared first on SamChui.com.",
    "pubDate": "Fri, 14 Nov 2025 07:48:06 +0000",
    "link": "https://samchui.com/2025/11/14/geminijets-airplane-models-october-25-new-release-discounts/",
    "source": "Sam Chui"
  },
  {
    "title": "Turkish Airlines unveils special liveried 500th aircraft as fleet passes major milestone",
    "contentSnippet": "Turkish Airlines has marked a significant milestone in its long history with the unveiling of its 500th aircraft, a landmark moment for the carrier that began operations in 1933 with just five aircraft. The new addition to the fleet, an Airbus A350 named TK Family, joined the airline at the end of  [read more]\nThe post Turkish Airlines unveils special liveried 500th aircraft as fleet passes major milestone appeared first on UK Aviation News.",
    "pubDate": "Fri, 13 Feb 2026 19:54:10 +0000",
    "link": "https://ukaviation.aero/turkish-airlines-unveils-special-livery-500th-aircraft-as-fleet-passes-major-milestone/",
    "source": "UK Aviation News"
  },
  {
    "title": "Loganair Expands Jersey Hub with Four New Direct Routes, Including Paris Debut",
    "contentSnippet": "Regional carrier expands island network with new UK, Irish and French services for summer 2026 Loganair has unveiled plans to strengthen connectivity from Jersey with the launch of four new direct routes to Norwich, East Midlands Airport, Dublin and Paris Charles de Gaulle Airport. The services, which go on sale today, represent a significant expansion of the airline’s  [read more]\nThe post Loganair Expands Jersey Hub with Four New Direct Routes, Including Paris Debut appeared first on UK Aviation News.",
    "pubDate": "Fri, 13 Feb 2026 19:37:42 +0000",
    "link": "https://ukaviation.aero/loganair-expands-jersey-hub-with-four-new-direct-routes-including-paris-debut/",
    "source": "UK Aviation News"
  },
  {
    "title": "AvTalk Episode 357: Frickin’ drones with frickin’ laser beams",
    "pubDate": "Fri, 13 Feb 2026 12:30:35 +0000",
    "contentSnippet": "On this week’s episode of AvTalk, Ian is joined by Ned Russell in the studio as Jason and Jeremy Dwyer-Lindgren report from their outpost in the Caribbean. We try to understand what happened in El Paso on Wednesday morning and offer some thoughts on the FAA administrator’s actions to close airspace around the city. Cuba […]\nThe post AvTalk Episode 357: Frickin’ drones with frickin’ laser beams appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/avtalk-podcast/avtalk-357/",
    "source": "FlightRadar24"
  },
  {
    "title": "Air Astana, Somon Air, and Uzbekistan Airways Order New Boeing Jets",
    "contentSnippet": "Boeing has announced new aircraft orders from three Central Asian airlines, Air Astana, Somon Air, and Uzbekistan Airways. …\nThe post Air Astana, Somon Air, and Uzbekistan Airways Order New Boeing Jets appeared first on SamChui.com.",
    "pubDate": "Fri, 07 Nov 2025 04:16:39 +0000",
    "link": "https://samchui.com/2025/11/07/air-astana-somon-air-and-uzbekistan-airways-order-new-boeing-jets/",
    "source": "Sam Chui"
  }
]