[
  {
    "title": "Unveiled: Philippine Airlines A350-1000 Cabin by LIFT Aero Design",
    "contentSnippet": "Philippine Airlines (PAL) has unveiled its first Airbus A350-1000, featuring a stunning cabin interior crafted by Tokyo-based LIFT Aero Design.\nThe post Unveiled: Philippine Airlines A350-1000 Cabin by LIFT Aero Design appeared first on AviationSource News.",
    "pubDate": "Wed, 28 Jan 2026 23:52:21 +0000",
    "link": "https://aviationsourcenews.com/unveiled-philippine-airlines-a350-1000-cabin-by-lift-aero-design/",
    "source": "Aviation Source News"
  },
  {
    "title": "Delta Airbus Widebody Order Expands A330 and A350 Fleets",
    "contentSnippet": "Following its very recent 787 Dreamliner deal, the Delta Airbus widebody order for 31 A330-900 and A350-900 aircraft will support its international growth efforts. Delta Air Lines is continuing to build toward its long-haul future, announcing on Wednesday, 28 January, that it will purchase 31 additional Airbus widebody aircraft as part of its ongoing fleet […]\nThe post Delta Airbus Widebody Order Expands A330 and A350 Fleets appeared first on Avgeekery.",
    "pubDate": "Wed, 28 Jan 2026 23:12:27 +0000",
    "link": "https://avgeekery.com/delta-airbus-widebody-order-a330-a350/",
    "source": "avgeekery"
  },
  {
    "title": "Air Canada Bases A321XLR in Toronto to Extend Copenhagen & Manchester Services",
    "contentSnippet": "Air Canada's Toronto-Manchester and Toronto-Copenhagen services become year-round as of October 2026, supported by a new Airbus A321XLR base in Toronto.\nThe post Air Canada Bases A321XLR in Toronto to Extend Copenhagen & Manchester Services appeared first on AviationSource News.",
    "pubDate": "Wed, 28 Jan 2026 22:30:10 +0000",
    "link": "https://aviationsourcenews.com/air-canada-bases-a321xlr-in-toronto-to-extend-copenhagen-manchester-services/",
    "source": "Aviation Source News"
  },
  {
    "title": "DHL Aviation Welcomes Two Dedicated Boeing 737-400 Freighters to Lagos",
    "contentSnippet": "DHL Aviation has introduced two dedicated Boeing 737-400 freighters in Lagos, to support DHL Express operations across West Africa.\nThe post DHL Aviation Welcomes Two Dedicated Boeing 737-400 Freighters to Lagos appeared first on AviationSource News.",
    "pubDate": "Wed, 28 Jan 2026 22:00:12 +0000",
    "link": "https://aviationsourcenews.com/dhl-aviation-welcomes-two-dedicated-boeing-737-400-freighters-to-lagos/",
    "source": "Aviation Source News"
  },
  {
    "title": "F-35 Fighters Conduct Training Operations From Amsterdam’s Schiphol Airport",
    "contentSnippet": "Four Dutch F-35 Lightning II fighters and a tanker operated from the Netherlands’ main international airport, one of Europe’s busiest, during the NATO-led exercise Avatar. Schiphol Airport, located just 9 kilometres southwest of Amsterdam, is one of the busiest airports in Europe. Over the past couple of days, alongside its usual flow of civilian airliners, […]",
    "pubDate": "Wed, 28 Jan 2026 21:41:27 +0000",
    "link": "https://theaviationist.com/2026/01/28/f-35-schiphol/",
    "source": "The Aviationist"
  },
  {
    "title": "U.S. Navy and Northrop Grumman Conduct New AARGM-ER Live-Fire Test",
    "contentSnippet": "The new live-fire event demonstrated the ability of the AGM-88G AARGM-ER to navigate a challenging flight profile in a GPS-denied environment. The U.S. Navy’s Naval Air Systems Command (NAVAIR) and Northrop Grumman announced on Jan. 27, 2026, a new live-fire test of the AGM-88G Advanced Anti-Radiation Guided Missile Extended Range (AARGM-ER). The announcement comes a […]",
    "pubDate": "Wed, 28 Jan 2026 21:06:12 +0000",
    "link": "https://theaviationist.com/2026/01/28/new-aargm-er-live-fire-test/",
    "source": "The Aviationist"
  },
  {
    "title": "Commercial aviation in Venezuela today",
    "pubDate": "Wed, 28 Jan 2026 20:00:21 +0000",
    "contentSnippet": "Venezuelan commercial aviation is like traveling back in time, as aircraft from the 1990s and 2000s predominate, and in certain cases from previous decades. Simón Bolívar International Airport (CCS/SVMI), commonly referred to as Caracas International Airport, is Venezuela’s main airport, located in Maiquetía, a city on the Venezuelan coast. Caracas, the country’s capital, is surrounded […]\nThe post Commercial aviation in Venezuela today appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/aviation-news/commercial-aviation-in-venezuela-today/",
    "source": "FlightRadar24"
  },
  {
    "title": "The wheels are falling off British Airways, literally!",
    "contentSnippet": "A British Airways (BA/BAW) flight from Las Vegas to London Heathrow suffered a bizarre event yesterday when one of the main wheels separated from the aircraft after departing Las Vegas and whilst the gear was retracting. In a video, widely shared on social media, the Airbus A350 is seen departing  [read more]\nThe post The wheels are falling off British Airways, literally! appeared first on UK Aviation News.",
    "pubDate": "Wed, 28 Jan 2026 18:17:58 +0000",
    "link": "https://ukaviation.aero/the-wheels-are-falling-off-british-airways-literally/",
    "source": "UK Aviation News"
  },
  {
    "title": "Eurowings and Wizz Air Bolster Gatwick Presence in Strategic Shift",
    "contentSnippet": "London Gatwick (LGW/EGKK) has seen a significant boost to its European and medium-haul network this week as airlines finalise their summer 2026 schedules. The announcements, led by the Lufthansa Group and Wizz Air, underscore a growing trend of carriers pivoting towards Gatwick to secure growth that remains elusive at a  [read more]\nThe post Eurowings and Wizz Air Bolster Gatwick Presence in Strategic Shift appeared first on UK Aviation News.",
    "pubDate": "Wed, 28 Jan 2026 18:01:39 +0000",
    "link": "https://ukaviation.aero/eurowings-and-wizz-air-bolster-gatwick-presence-in-strategic-shift/",
    "source": "UK Aviation News"
  },
  {
    "title": "Delta Airlines orders 31 additional Airbus widebody airliners",
    "contentSnippet": "US carrier Delta Airlines has placed an order with Airbus for 31 additional widebody airlines as it looks to grow its fleet. The order consists of 16 A330-900s and 15 A360-900s which will serve Delta’s expanding long-haul markets. Delta’s fleet of all Airbus aircraft ranges from the single aisle A220  [read more]\nThe post Delta Airlines orders 31 additional Airbus widebody airliners appeared first on UK Aviation News.",
    "pubDate": "Wed, 28 Jan 2026 14:05:54 +0000",
    "link": "https://ukaviation.aero/delta-airlines-orders-31-additional-airbus-widebody-airliners/",
    "source": "UK Aviation News"
  },
  {
    "title": "Boeing Records $565 Million Loss on KC-46 Tanker Program",
    "contentSnippet": "Boeing reported a new $565M loss on the KC-46 program, while looking to a reprice because of supply chain costs, production support, and ongoing RVS 2.0 upgrades. Boeing has once again reported a significant financial charge on its KC-46A Pegasus tanker program, following the long-running challenges associated with what has become one of the U.S. […]",
    "pubDate": "Wed, 28 Jan 2026 13:09:50 +0000",
    "link": "https://theaviationist.com/2026/01/28/kc-46-pegasus-boeing-565-million-loss/",
    "source": "The Aviationist"
  },
  {
    "title": "Learjet 45 Crash in India: Deputy Chief Minister On Board, No Survivors",
    "pubDate": "Wed, 28 Jan 2026 10:21:51 +0000",
    "contentSnippet": "A Learjet 45, registered as VT-SSK, was involved in a fatal crash at Baramati Airport in India during the morning of January 28, 2026. Maharashtra Deputy Chief Minister Ajit Pawar was on board. This is what we know about the accident. Playback of flight Click here to view playback of the flight. Flight route analysis […]\nThe post Learjet 45 Crash in India: Deputy Chief Minister On Board, No Survivors appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/flight-tracking-news/major-incident/learjet-45-crash-in-india-deputy-chief-minister-on-board/",
    "source": "FlightRadar24"
  },
  {
    "title": "Washington mid-air collision was ‘100% preventable’, NTSB says",
    "contentSnippet": "Speaking on the investigation into the 29 January 2025 disaster, which killed all 67 people on an American Airlines CRJ700 and a US Army Sikorsky UH-60 Black Hawk, Jennifer Homendy, chairwoman of the NTSB, said “system flaws” aligned to cause the crash.",
    "pubDate": "Wed, 28 Jan 2026 05:34:03 +0000",
    "link": "https://australianaviation.com.au/2026/01/washington-mid-air-collision-was-100-preventable-ntsb-says/",
    "source": "Australian Aviation"
  },
  {
    "title": "British Airways A350 loses wheel departing Las Vegas",
    "pubDate": "Wed, 28 Jan 2026 05:32:35 +0000",
    "contentSnippet": "On 26 January, the right, rear main landing gear wheel fell off a British Airways A350-1000 operating from Las Vegas to London as flight BA274. The wheel fell off the aircraft as the landing gear was being retracted. The flight continued for a safe and uneventful landing in London and no one was injured on […]\nThe post British Airways A350 loses wheel departing Las Vegas appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/flight-tracking-news/aircraft-incident/british-airways-a350-loses-wheel-departing-las-vegas/",
    "source": "FlightRadar24"
  },
  {
    "title": "UPS retires its MD-11 fleet",
    "pubDate": "Wed, 28 Jan 2026 05:08:03 +0000",
    "contentSnippet": "UPS has announced that it has retired its MD-11 fleet. The aircraft type is currently grounded pending inspections following the deadly November crash in Louisville. In its fourth quarter earnings report the company said, “UPS accelerated its fleet modernization plans, completing the retirement of its MD-11 fleet during the fourth quarter of 2025.” The gap […]\nThe post UPS retires its MD-11 fleet appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/aviation-news/airline-news/ups-retires-its-md-11-fleet/",
    "source": "FlightRadar24"
  },
  {
    "title": "Freedom Plane Takes America’s Founding Documents on a Historic Flight for the Nation’s 250th Birthday",
    "contentSnippet": "The Freedom Plane will soon embark on a landmark mission, transporting America’s most iconic founding documents nationwide as the country celebrates its semiquincentennial. Announced on 20 January 2026, the Freedom Plane National Tour will see a specially equipped Boeing 737 transport an exhibit called Documents That Forged a Nation beyond Washington, DC, for the first […]\nThe post Freedom Plane Takes America’s Founding Documents on a Historic Flight for the Nation’s 250th Birthday appeared first on Avgeekery.",
    "pubDate": "Wed, 21 Jan 2026 16:15:45 +0000",
    "link": "https://avgeekery.com/freedom-plane-tour-americas-250th/",
    "source": "avgeekery"
  },
  {
    "title": "Need for Speed: The Concorde Story",
    "pubDate": "Wed, 21 Jan 2026 08:44:04 +0000",
    "contentSnippet": "Mention “Concorde” to any aviation enthusiast and chances are that they’ll get a certain look in their eyes. That is quite understandable, as the Concorde wasn’t just any other aircraft. Capable of flying at twice the speed of sound, it whisked the wealthy across the Atlantic in under three and a half hours. And for […]\nThe post Need for Speed: The Concorde Story appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/aircraft-stories/need-for-speed-the-concorde-story/",
    "source": "FlightRadar24"
  },
  {
    "title": "Dubai Airshow Day 3: Orders for Airbus & Boeing",
    "contentSnippet": "Emirates has ordered eight Airbus A350s on the third day of the Dubai Airshow, while flydubai has signed a memorandum of understanding (MoU) for up to 150 Boeing 737 MAX jets. Moreover, Airbus also received orders from Buraq Air and Silk Way West Airlines for A320neo and A350F freighters, respectively. flydubai Signs MoU for up to 150 Boeing 737 MAX Jets Just 24 hours after announcing an MoU with Airbus for 150 A321neos, flydubai has now signed another MoU with Boeing for up to […]\nThe post Dubai Airshow Day 3: Orders for Airbus & Boeing appeared first on SamChui.com.",
    "pubDate": "Wed, 19 Nov 2025 12:29:48 +0000",
    "link": "https://samchui.com/2025/11/19/dubai-airshow-day-3-orders-for-airbus-boeing/",
    "source": "Sam Chui"
  },
  {
    "title": "flydubai signs MoU for 75 Boeing 737 MAX Airplanes",
    "contentSnippet": "",
    "pubDate": "Wed, 19 Nov 2025 05:01:00 -0500",
    "link": "https://boeing.mediaroom.com/2025-11-19-flydubai-signs-MoU-for-75-Boeing-737-MAX-Airplanes",
    "source": "Boeing"
  },
  {
    "title": "Boeing and Alaska Airlines Announce Largest Airplane Order in Airline's History",
    "contentSnippet": "",
    "pubDate": "Wed, 07 Jan 2026 09:02:00 -0500",
    "link": "https://boeing.mediaroom.com/2026-01-07-Boeing-and-Alaska-Airlines-Announce-Largest-Airplane-Order-in-Airlines-History",
    "source": "Boeing"
  },
  {
    "title": "UPS MD-11 Crashes Near Louisville Airport",
    "contentSnippet": "On November 4, 2025, a UPS McDonnell Douglas MD-11 cargo aircraft crashed shortly after takeoff from Muhammad Ali International Airport in Louisville, Kentucky.  The MD-11 with registered N259UP, was operating UPS Flight 2976 to Honolulu, Hawaii, when the accident occurred. Three crew members were on board at the time of the crash.  Local authorities confirmed that emergency services responded to the scene, with reports of injuries and significant structural damage in the surrounding area. Update: November 5, 23:30 UTC Investigators […]\nThe post UPS MD-11 Crashes Near Louisville Airport appeared first on SamChui.com.",
    "pubDate": "Wed, 05 Nov 2025 00:22:58 +0000",
    "link": "https://samchui.com/2025/11/05/ups-md-11-crashes-near-louisville-airport/",
    "source": "Sam Chui"
  },
  {
    "title": "NASA WB-57F Canberra Lands Gear Up at Houston’s Ellington Field",
    "contentSnippet": "NASA has confirmed that crew members are safe after one of its three WB-57 Canberra high-altitude research aircraft made an emergency gear-up landing in Texas. N927NA, the most recent addition to NASA’s fleet of high-altitude research aircraft that trace their lineage back to the English Electric Canberra, was seen in video footage making a gear-up […]",
    "pubDate": "Tue, 27 Jan 2026 20:37:02 +0000",
    "link": "https://theaviationist.com/2026/01/27/nasa-wb57-canberra-gear-up-houston/",
    "source": "The Aviationist"
  },
  {
    "title": "UPS brings forward retirement of its MD11 fleet in light of Louisville crash",
    "contentSnippet": "Global parcel and logistics giant UPS has confirmed it will retire all of its entire 27 strong fleet of McDonnell Douglas (Boeing) MD11s replacing them with the incoming Boeing 767 Freighters, 15 of which they expect to have delivered this year. All MD11s have been grounded since the 8th November  [read more]\nThe post UPS brings forward retirement of its MD11 fleet in light of Louisville crash appeared first on UK Aviation News.",
    "pubDate": "Tue, 27 Jan 2026 18:29:08 +0000",
    "link": "https://ukaviation.aero/ups-brings-forward-retirement-of-its-md11-fleet-in-light-of-louisville-crash/",
    "source": "UK Aviation News"
  },
  {
    "title": "UPS Retires MD-11 Fleet, Permanently Ending Trijet Operations",
    "contentSnippet": "UPS retires MD-11 freighters following the November crash, leaving FedEx and Western Global as the world’s only remaining operators. In a move that signals a major shift for global cargo aviation, United Parcel Service (UPS) has confirmed it has permanently retired its fleet of McDonnell Douglas MD-11 freighters, bringing an abrupt end to the aircraft’s […]\nThe post UPS Retires MD-11 Fleet, Permanently Ending Trijet Operations appeared first on Avgeekery.",
    "pubDate": "Tue, 27 Jan 2026 16:24:27 +0000",
    "link": "https://avgeekery.com/ups-retires-md-11-fleet/",
    "source": "avgeekery"
  },
  {
    "title": "Storm Chandra causes flight disruption across UK with 78 flights cancelled",
    "contentSnippet": "The latest named storm to hit the UK, Storm Chandra, was causing significant disruption at UK airports this morning with strong winds and flooding affecting many areas. According to data from viation analytics firm Cirium, as of 15L15hrs 78 flights had been cancelled from UK airports, including 4 that were due  [read more]\nThe post Storm Chandra causes flight disruption across UK with 78 flights cancelled appeared first on UK Aviation News.",
    "pubDate": "Tue, 27 Jan 2026 15:09:15 +0000",
    "link": "https://ukaviation.aero/storm-chandra-causes-flight-disruption-across-uk-with-over-40-flights-cancelled/",
    "source": "UK Aviation News"
  },
  {
    "title": "U.S. Navy Selects New Helmet for Fixed Wing Crews",
    "contentSnippet": "The U.S. Navy has selected the Gentex Pursuit helmet as the Next Generation Fixed Wing Helmet (NGFWH) to equip flight crews of E-2D, F/A-18, E/A-18G, T-45, T-6 and UJTS. Gentex Corporation has announced that the U.S. Navy’s Naval Aircrew Systems program office (PMA-202) selected its Pursuit helmet as the Next Generation Fixed Wing Helmet (NGFWH). […]",
    "pubDate": "Tue, 27 Jan 2026 12:16:52 +0000",
    "link": "https://theaviationist.com/2026/01/27/us-navy-gentex-new-helmet/",
    "source": "The Aviationist"
  },
  {
    "title": "Qatari 747 Air Force One Conversion Could Be Complete by Summer",
    "contentSnippet": "The story behind the Qatari 747 Air Force One conversion and the race to have the aircraft ready by summer. A Boeing 747 donated by the Qatari government could soon be flying as Air Force One, potentially entering service as early as this coming summer, according to Air Force officials. The US Air Force has […]\nThe post Qatari 747 Air Force One Conversion Could Be Complete by Summer appeared first on Avgeekery.",
    "pubDate": "Tue, 27 Jan 2026 02:10:45 +0000",
    "link": "https://avgeekery.com/qatari-747-air-force-one-conversion/",
    "source": "avgeekery"
  },
  {
    "title": "WATCH: Neil and Buzz Relive Their Apollo 11 Moon Landing Together",
    "contentSnippet": "More than half a century after Apollo 11 changed the course of human history, Neil Armstrong and Buzz Aldrin once sat together and reflected on the mission that carried them to the Moon and back. The first mission to land people on another world blasted off from Cape Canaveral on 16 July 1969, hurtling three […]\nThe post WATCH: Neil and Buzz Relive Their Apollo 11 Moon Landing Together appeared first on Avgeekery.",
    "pubDate": "Tue, 20 Jan 2026 02:49:00 +0000",
    "link": "https://avgeekery.com/neil-and-buzz-relive-apollo-11-moon-landing-together/",
    "source": "avgeekery"
  },
  {
    "title": "Dubai Airshow 2025 Day 2: Big Orders for Airbus",
    "contentSnippet": "After a quiet Day 1, Airbus opened Day 2 with major orders from Etihad Airways, flydubai, Air Europa and Ethiopian Airlines. Moreover, Boeing also received order from Gulf Air, following a successful Day 1. Etihad Airways Orders Airbus A330neo, A350-1000 and A350F Etihad Airways has placed a firm order for six A330-900s, becoming the newest customer for the A330neo. It is also expanding its A350 fleet with seven additional A350-1000s (now totaling 27) and three more A350F freighters, bringing its A350F commitment to 10. […]\nThe post Dubai Airshow 2025 Day 2: Big Orders for Airbus appeared first on SamChui.com.",
    "pubDate": "Tue, 18 Nov 2025 12:08:53 +0000",
    "link": "https://samchui.com/2025/11/18/dubai-airshow-2025-day-2-big-orders-for-airbus/",
    "source": "Sam Chui"
  },
  {
    "title": "Boeing: Middle East Airlines Enter New Era of Growth as Region's Fleet Will More Than Double by 2044",
    "contentSnippet": "",
    "pubDate": "Tue, 18 Nov 2025 03:13:00 -0500",
    "link": "https://boeing.mediaroom.com/2025-11-18-Boeing-Middle-East-Airlines-Enter-New-Era-of-Growth-as-Regions-Fleet-Will-More-Than-Double-by-2044",
    "source": "Boeing"
  },
  {
    "title": "An Honest Update From Me – Life, Aviation & What’s Next?",
    "contentSnippet": "2025 has been a year of profound change for me. I lost my mother, the person who first introduced me to travel and aviation, and who helped make some of my biggest dreams come true. Then I got married to a beautiful and kind lady. It was a once-in-a-lifetime wedding on the 747…I can’t ask anymore…I am so grateful. I turned 45 last November, and my hair is gradually turning grey…I’ve been running my YouTube channel like a religion for […]\nThe post An Honest Update From Me – Life, Aviation & What’s Next? appeared first on SamChui.com.",
    "pubDate": "Tue, 13 Jan 2026 12:20:13 +0000",
    "link": "https://samchui.com/2026/01/13/an-honest-update-from-me-life-aviation-whats-next-2/",
    "source": "Sam Chui"
  },
  {
    "title": "Aviation Capital Group Orders 50 Boeing 737 MAX Jets",
    "contentSnippet": "",
    "pubDate": "Tue, 13 Jan 2026 03:19:00 -0500",
    "link": "https://boeing.mediaroom.com/2026-01-13-Aviation-Capital-Group-Orders-50-Boeing-737-MAX-Jets",
    "source": "Boeing"
  },
  {
    "title": "Final Flight: Iconic BelugaST Lands in Broughton for Last Time",
    "contentSnippet": "The iconic BelugaST 'Tango Foxtrot' has completed its final flight, returning to Airbus Broughton where it will be transformed into a STEM education facility.\nThe post Final Flight: Iconic BelugaST Lands in Broughton for Last Time appeared first on AviationSource News.",
    "pubDate": "Thu, 29 Jan 2026 21:43:31 +0000",
    "link": "https://aviationsourcenews.com/final-flight-iconic-belugast-lands-in-broughton-for-last-time/",
    "source": "Aviation Source News"
  },
  {
    "title": "American Airlines to Resume Venezuela Flights: First U.S. Carrier to Return",
    "contentSnippet": "After suspension of flights in 2019, American Airlines will become the first U.S. carrier to resume services to Venezuela, with daily nonstop flights planned.\nThe post American Airlines to Resume Venezuela Flights: First U.S. Carrier to Return appeared first on AviationSource News.",
    "pubDate": "Thu, 29 Jan 2026 21:15:25 +0000",
    "link": "https://aviationsourcenews.com/american-airlines-to-resume-venezuela-flights-first-u-s-carrier-to-return/",
    "source": "Aviation Source News"
  },
  {
    "title": "Iconic Airbus Beluga Super Transporter Retires to Become STEM Hub at Broughton",
    "contentSnippet": "The fifth of five Airbus A300-600ST ‘Beluga’ transports has flown into retirement at Airbus’ Broughton facility in North Wales, where it will be used to promote STEM to schools and community groups.   As the Airbus fleet of Beluga super transporter aircraft readies for withdrawal by 2027 in favour of the larger, more efficient A330-743L BelugaXL, […]",
    "pubDate": "Thu, 29 Jan 2026 21:04:34 +0000",
    "link": "https://theaviationist.com/2026/01/29/iconic-airbus-beluga-retires-broughton/",
    "source": "The Aviationist"
  },
  {
    "title": "Air India Converts 15 Airbus A321neo Orders to A321XLR Variant",
    "contentSnippet": "Air India has announced the conversion of 15 of its current orders for Airbus A321neo aircraft to the advanced Airbus A321XLR (Extra Long Range) variant. \nThe post Air India Converts 15 Airbus A321neo Orders to A321XLR Variant appeared first on AviationSource News.",
    "pubDate": "Thu, 29 Jan 2026 20:49:07 +0000",
    "link": "https://aviationsourcenews.com/air-india-converts-15-airbus-a321neo-orders-to-a321xlr-variant/",
    "source": "Aviation Source News"
  },
  {
    "title": "Air India Accelerates Fleet Modernization with 30 More Boeing 737 MAX Orders",
    "contentSnippet": "Air India continues its transformation, placing a further narrowbody order with Boeing for 20 737 MAX 8 models and 10 737 MAX 10 aircraft.  \nThe post Air India Accelerates Fleet Modernization with 30 More Boeing 737 MAX Orders appeared first on AviationSource News.",
    "pubDate": "Thu, 29 Jan 2026 20:31:18 +0000",
    "link": "https://aviationsourcenews.com/air-india-accelerates-fleet-modernization-with-30-more-boeing-737-max-orders/",
    "source": "Aviation Source News"
  },
  {
    "title": "Planespotter paradise: the history of aviation in St Maarten",
    "pubDate": "Thu, 29 Jan 2026 20:00:18 +0000",
    "contentSnippet": "Princess Juliana International Airport (SXM/TNCM), one of the world’s best-known airports along with the famous Maho Beach, was the latest addition to our YouTube channel with a 24-hour live stream showing all the action at the main airport on the island of Saint Martin, including landings and takeoffs. Its history The beginnings of aviation on […]\nThe post Planespotter paradise: the history of aviation in St Maarten appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/aviation-news/planespotter-paradise-the-history-of-aviation-in-st-maarten/",
    "source": "FlightRadar24"
  },
  {
    "title": "A Love Letter to Supersonic Flight: The Air France Concorde 50th Anniversary Film Is Worth Your Time",
    "contentSnippet": "A beautifully-made cinematic French-language anniversary film celebrates the Air France Concorde and the era of supersonic commercial flight. Fifty years ago, commercial aviation crossed a line that has yet to be crossed again. Here at Avgeekery, we marked the occasion with a tribute to one of the most elegant and ambitious human feats ever achieved.   […]\nThe post A Love Letter to Supersonic Flight: The Air France Concorde 50th Anniversary Film Is Worth Your Time appeared first on Avgeekery.",
    "pubDate": "Thu, 29 Jan 2026 15:35:51 +0000",
    "link": "https://avgeekery.com/air-france-concorde-50th-anniversary-film/",
    "source": "avgeekery"
  },
  {
    "title": "Aer Lingus confirms it is ceasing long-haul operations at Manchester Airport",
    "contentSnippet": "Irish flag carrier Aer Lingus (EI/EIN) has confirmed it is ceasing long-haul operations from Manchester Airport (MAN/EGCC)from the 31st of March 2026, with the New York service ending earlier in late February. The transatlantic flights to New York, Orlando and Barbados are operated by Aer Lingus UK (EH/EUK), a wholly  [read more]\nThe post Aer Lingus confirms it is ceasing long-haul operations at Manchester Airport appeared first on UK Aviation News.",
    "pubDate": "Thu, 29 Jan 2026 14:58:25 +0000",
    "link": "https://ukaviation.aero/aer-lingus-confirms-it-is-ceasing-long-haul-operations-at-manchester-airport/",
    "source": "UK Aviation News"
  },
  {
    "title": "Eurofighter Typhoon Fleet Reaches One Million Flight Hours",
    "contentSnippet": "The Eurofighter Typhoon global fleet, counting 610 aircraft in service across nine nations, has reached the one million flight hours milestone. The Eurofighter consortium has announced on Jan. 29, 2026, that the Typhoon fleet has reached one million flight hours. The milestone is accompanied by the EJ200 engine reaching 2 million flight hours, as two […]",
    "pubDate": "Thu, 29 Jan 2026 14:53:43 +0000",
    "link": "https://theaviationist.com/2026/01/29/eurofighter-typhoon-one-million-flight-hours/",
    "source": "The Aviationist"
  },
  {
    "title": "Next U.S. Navy Aircraft Carrier Sets Sail for Sea Trials",
    "contentSnippet": "The next Gerald R. Ford class supercarrier, to be known as the USS John F. Kennedy (CVN 79), set sail under its own power from Newport News for the first time on Jan. 28, 2026 to begin manufacturer sea trials. Ahead of scheduled delivery to the U.S. Navy in March 2027, which will come with […]",
    "pubDate": "Thu, 29 Jan 2026 14:29:47 +0000",
    "link": "https://theaviationist.com/2026/01/29/uss-john-f-kennedy-sea-trials/",
    "source": "The Aviationist"
  },
  {
    "title": "U.S. Navy CNO Warns F/A-XX Must Launch Now to Face Future Air Defense Threats",
    "contentSnippet": "Chief of Naval Operations Adm. Daryl Caudle warns F/A-XX must launch now as Iran and other adversaries field advanced air defenses, ending the era of flying with impunity. The U.S. Navy’s next-generation carrier-based fighter, known as F/A-XX, appears to be still stuck in a limbo, almost a year after Boeing was selected to start building […]",
    "pubDate": "Thu, 29 Jan 2026 12:55:22 +0000",
    "link": "https://theaviationist.com/2026/01/29/us-navy-cno-fa-xx-must-launch-now/",
    "source": "The Aviationist"
  },
  {
    "title": "Germany Advances Reusable Hypersonic Vehicle Program with Polaris",
    "contentSnippet": "Polaris will build a two-stage, horizontal take-off and fully reusable hypersonic research vehicle, featuring a linear aerospike rocket engine.  German company Polaris Spaceplanes announced on Jan. 27, 2026, that it has received a contract from the Federal Office of Bundeswehr Equipment, Information Technology, and In-Service Support (BAAINBw) to build and flight-test a reusable hypersonic vehicle. […]",
    "pubDate": "Thu, 29 Jan 2026 12:41:43 +0000",
    "link": "https://theaviationist.com/2026/01/29/germany-reusable-hypersonic-vehicle-polaris/",
    "source": "The Aviationist"
  },
  {
    "title": "Air India Orders 30 Boeing 737 MAX Jets to Expand Single-Aisle Fleet",
    "contentSnippet": "",
    "pubDate": "Thu, 29 Jan 2026 11:58:00 -0500",
    "link": "https://boeing.mediaroom.com/2026-01-29-Air-India-Orders-30-Boeing-737-MAX-Jets-to-Expand-Single-Aisle-Fleet",
    "source": "Boeing"
  },
  {
    "title": "Discover Airlines to Outfit A330s with ‘Ocean Blue’ Long-Haul Cabin",
    "contentSnippet": "Leisure carrier Discover Airlines has unveiled its 'Ocean Blue' long-haul cabin layout, which will see 16 A330-300s converted from Spring 2027.\nThe post Discover Airlines to Outfit A330s with ‘Ocean Blue’ Long-Haul Cabin appeared first on AviationSource News.",
    "pubDate": "Thu, 29 Jan 2026 10:25:08 +0000",
    "link": "https://aviationsourcenews.com/discover-airlines-to-outfit-a330s-with-ocean-blue-long-haul-cabin/",
    "source": "Aviation Source News"
  },
  {
    "title": "The Airbus Beluga ST: A Whale of a Story",
    "pubDate": "Thu, 29 Jan 2026 10:00:03 +0000",
    "contentSnippet": "In a world where few can agree on anything, most can at least agree that the Airbus A300-600ST is something else. Affectionately known as the Beluga after the white whale it resembles, it stands as one of aviation’s most distinctive and successful specialized aircraft. After nearly three decades of being the backbone of Airbus’s logistics […]\nThe post The Airbus Beluga ST: A Whale of a Story appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/aircraft-stories/the-airbus-beluga-st-a-whale-of-a-story/",
    "source": "FlightRadar24"
  },
  {
    "title": "Aer Lingus Confirms Manchester Long-Haul Base to Close by March 2026",
    "contentSnippet": "Aer Lingus has now confirmed that it will fully cease its long-haul operations from Manchester Airport (MAN) as of March 31, 2026.\nThe post Aer Lingus Confirms Manchester Long-Haul Base to Close by March 2026 appeared first on AviationSource News.",
    "pubDate": "Thu, 29 Jan 2026 09:50:13 +0000",
    "link": "https://aviationsourcenews.com/aer-lingus-confirms-manchester-long-haul-base-to-close-by-march-2026/",
    "source": "Aviation Source News"
  },
  {
    "title": "Airports again call for departure tax funds to ‘modernise’ border",
    "contentSnippet": "The Australian Airports Association (AAA), in a pre-budget submission, said that allocating an extra five per cent of revenue per year from the $70 Passenger Movement Charge (PMC), which raises more than $1.35 billion annually, could boost border and airport processing infrastructure.",
    "pubDate": "Thu, 29 Jan 2026 06:14:04 +0000",
    "link": "https://australianaviation.com.au/2026/01/airports-again-call-for-departure-tax-funds-to-modernise-border/",
    "source": "Australian Aviation"
  },
  {
    "title": "NJE plans E-Jet growth as it adds a pair of new FIFO services in WA",
    "contentSnippet": "The airline, which was spun off following the Rex collapse in 2024, has commenced services to the Nifty copper mine in the Pilbara this month for Cyprium Metals following the launch of its route to Marble Bar for AIM late last year.",
    "pubDate": "Thu, 29 Jan 2026 05:36:07 +0000",
    "link": "https://australianaviation.com.au/2026/01/nje-plans-e-jet-growth-as-it-adds-a-pair-of-new-fifo-services-in-wa/",
    "source": "Australian Aviation"
  },
  {
    "title": "Government looks to bolster counter-drone capabilities",
    "contentSnippet": "A new industry advisory panel has been established to support Defence and other Australian government agencies with counter small uncrewed aerial systems services.",
    "pubDate": "Thu, 29 Jan 2026 03:40:11 +0000",
    "link": "https://australianaviation.com.au/2026/01/government-looks-to-bolster-counter-drone-capabilities/",
    "source": "Australian Aviation"
  },
  {
    "title": "Sydney Airport has plenty of room, says slot manager",
    "contentSnippet": "Figures released by Airport Coordination Limited Asia Pacific, which took over Sydney slot management last year, showed that while slot utilisation averages over 95 per cent from 7am to 10am and 6pm to 7pm on weekdays, it drops to around 67 per cent on average outside those times.",
    "pubDate": "Thu, 29 Jan 2026 01:28:17 +0000",
    "link": "https://australianaviation.com.au/2026/01/sydney-airport-has-plenty-of-room-says-slot-manager/",
    "source": "Australian Aviation"
  },
  {
    "title": "TransNusa boosts Perth–Bali flights again",
    "contentSnippet": "From July, the Indonesian carrier will increase A320 services on the Perth–Denpasar route from 17 to 21 per week. It comes just under a year after the initial launch of TransNusa in Australia in March 2025, on a route that has already seen an expansion to more than two daily services.",
    "pubDate": "Thu, 29 Jan 2026 00:02:34 +0000",
    "link": "https://australianaviation.com.au/2026/01/transnusa-boosts-perth-bali-flights-again/",
    "source": "Australian Aviation"
  },
  {
    "title": "Farnborough International Airshow adds Defence SME zone as tickets go on sale",
    "contentSnippet": "Farnborough International Airshow (FIA) 2026 is set to go ahead in July and with exhibition halls and chalets selling out 12 months in advance the show is set to welcome more international participation than ever. Making its debut this year is the Defence SME Zone which is part of FIA’s  [read more]\nThe post Farnborough International Airshow adds Defence SME zone as tickets go on sale appeared first on UK Aviation News.",
    "pubDate": "Thu, 22 Jan 2026 15:20:26 +0000",
    "link": "https://ukaviation.aero/farnborough-international-airshow-adds-defence-sme-zone-as-tickets-go-on-sale/",
    "source": "UK Aviation News"
  },
  {
    "title": "GeminiJets Airplane Models – November 25 New Release + Discounts",
    "contentSnippet": "I have been collecting GeminiJets airplane models since they launched 20 years ago! Video Special Offer This is a sponsored post to showcase the latest GeminiJets airplane model releases. Hope you find something you like. To purchase GeminiJets, go to DiecastJets.com and use code SAMCHUI at checkout for up to 25% off and free shipping in the US. November 2025 1:400 New Release November 2025 1:200 New Release Video This is a sponsored post to showcase the latest GeminiJets airplane model releases. Hope you find something you like. Special Offer […]\nThe post GeminiJets Airplane Models – November 25 New Release + Discounts appeared first on SamChui.com.",
    "pubDate": "Thu, 15 Jan 2026 06:33:32 +0000",
    "link": "https://samchui.com/2026/01/15/geminijets-airplane-models-november-25-new-release-discounts/",
    "source": "Sam Chui"
  },
  {
    "title": "Photo Report: The New Philippine Airlines A350-1000",
    "contentSnippet": "On 17th January, 2026, Asia's oldest airline, Philippine Airlines (PAL), celebrates its 85th Anniversary. The President of the Philippines, H.E. Ferdinand Marcos Jr., unveiled PAL’s first Airbus A350-1000 during the event. I was invited, along with other aviation media and colleagues, to attend the event at Lufthansa Technik Manila. Here are some photos from the event. Philippine Airlines A350-1000 Tour Philippine Airlines A350-1000 features 3 classes with a total capacity of 382 seats. A350-1000 Flight to Hong Kong The next day, I […]\nThe post Photo Report: The New Philippine Airlines A350-1000 appeared first on SamChui.com.",
    "pubDate": "Sun, 18 Jan 2026 12:45:59 +0000",
    "link": "https://samchui.com/2026/01/18/photo-report-philippine-airlines-a350-1000/",
    "source": "Sam Chui"
  },
  {
    "title": "Why Did Eastern Airlines Fail?",
    "contentSnippet": "Eastern’s Demise Was Painful to Watch, No Matter Who You Were It was the airline that was destroyed by infighting and a soft economy. The airline was headed by World War I ace Eddie Rickenbacker. For a time, Eastern Airlines was known for high-quality service with innovative technology. The airline was the first to fly […]\nThe post Why Did Eastern Airlines Fail? appeared first on Avgeekery.",
    "pubDate": "Sun, 18 Jan 2026 04:16:29 +0000",
    "link": "https://avgeekery.com/why-did-eastern-airlines-fail/",
    "source": "avgeekery"
  },
  {
    "title": "Trump Threatens ‘Decertification’ of Bombardier Global Aircraft and Canadian Tariffs",
    "contentSnippet": "President Trump said he will 'de‑certify' Bombardier Global Express and other Canadian-built aircraft and impose up to 50% tariffs unless Canada certifies U.S. made Gulfstream jets.\nThe post Trump Threatens ‘Decertification’ of Bombardier Global Aircraft and Canadian Tariffs appeared first on AviationSource News.",
    "pubDate": "Sat, 31 Jan 2026 04:23:59 +0000",
    "link": "https://aviationsourcenews.com/trump-threatens-decertification-of-bombardier-global-aircraft-and-canadian-tariffs/",
    "source": "Aviation Source News"
  },
  {
    "title": "RN Wildcat Demonstrates Live Use of Drones for Real Time Targeting",
    "contentSnippet": "A Wildcat helicopter conducted simulated Martlet missile strikes on moving targets at the National Drone Hub, Predannack, using live data provided by Puma and Providence UAVs.  The trials, involving a Wildcat from 815 Naval Air Squadron (NAS), uncrewed aerial vehicles (UAVs) from 700X NAS at nearby RNAS Culdrose, and support from 847 NAS and industry […]",
    "pubDate": "Sat, 31 Jan 2026 02:15:42 +0000",
    "link": "https://theaviationist.com/2026/01/31/rn-wildcat-demo-drone-targeting/",
    "source": "The Aviationist"
  },
  {
    "title": "USAF Announces Exercises in Middle East as USS Lincoln CSG Joins Build Up",
    "contentSnippet": "U.S. Air Forces Central is launching a multi-day readiness exercise to demonstrate the ability to deploy, disperse, and sustain combat airpower in the CENTCOM AOR. The U.S. Air Forces Central (AFCENT), also known as Ninth Air Force, announced on Jan. 25, 2026, that it will be conducting a “multi-day readiness exercise to demonstrate the ability […]",
    "pubDate": "Mon, 26 Jan 2026 22:16:30 +0000",
    "link": "https://theaviationist.com/2026/01/26/usaf-announces-exercises-middle-east/",
    "source": "The Aviationist"
  },
  {
    "title": "Airbus Helicopters posts strong order growth and market gains in 2025",
    "contentSnippet": "Airbus Helicopters recorded a robust performance in 2025, securing 544 gross orders (536 net) from 205 customers across 50 countries, underlining continued growth across its civil, parapublic and military portfolios. The manufacturer delivered 392 helicopters during the year and captured a 51% share of the global civil and parapublic market, while its military market share rose  [read more]\nThe post Airbus Helicopters posts strong order growth and market gains in 2025 appeared first on UK Aviation News.",
    "pubDate": "Mon, 26 Jan 2026 20:02:51 +0000",
    "link": "https://ukaviation.aero/airbus-helicopters-posts-strong-order-growth-and-market-gains-in-2025/",
    "source": "UK Aviation News"
  },
  {
    "title": "Newbow Aerospace opens new GSE factory in West Midlands",
    "contentSnippet": "Ground Support Equipment (GSE) manufacturer, Newbow Aerospace has opened a new fabrication facility in the West Midlands. The 4,000sq ft fabrication unit doubles the current production capacity and will allow Newbow to scale up production of GSE trailers and carts to meet the new airline contracts it won last year.  [read more]\nThe post Newbow Aerospace opens new GSE factory in West Midlands appeared first on UK Aviation News.",
    "pubDate": "Mon, 26 Jan 2026 15:43:57 +0000",
    "link": "https://ukaviation.aero/newbow-aerospace-opens-new-gse-factory-in-west-midlands/",
    "source": "UK Aviation News"
  },
  {
    "title": "Dubai Airshow 2025 Day 1: Big Orders for Boeing",
    "contentSnippet": "Boeing has opened the Dubai Airshow 2025 on a strong note with Emirates placing an order for 65 Boeing 777X aircraft. This was followed by commitments from Ethiopian Airlines and Air Senegal for additional MAX jets. Embraer has also received orders from Helvetic Airways and Air Côte d’Ivoire on the first day of the bi-annual Airshow. Here is a recap of orders and announcements from the first day of the Dubai Airshow. Emirates Orders 65 Boeing 777X Boeing has kicked off the […]\nThe post Dubai Airshow 2025 Day 1: Big Orders for Boeing appeared first on SamChui.com.",
    "pubDate": "Mon, 17 Nov 2025 13:40:06 +0000",
    "link": "https://samchui.com/2025/11/17/dubai-airshow-2025-day-1-big-order-for-boeing-from-emirates/",
    "source": "Sam Chui"
  },
  {
    "title": "F-35As Deployed to Puerto Rico Now Moving Across the Atlantic",
    "contentSnippet": "USAF F-35As deployed to Puerto Rico for the attack on Venezuela might now be part of what Trump called a ‘massive armada’ moving towards Iran. In recent days, a series of U.S. military movements have drawn heightened attention across the Middle East. These developments have coincided with ongoing regional tensions following domestic unrest in Iran […]",
    "pubDate": "Fri, 30 Jan 2026 22:00:57 +0000",
    "link": "https://theaviationist.com/2026/01/30/f-35as-puerto-rico-moving-across-the-atlantic/",
    "source": "The Aviationist"
  },
  {
    "title": "You’ve Heard of Snakes on a Plane. Now, Get Ready for… Turtles in a Bra?",
    "contentSnippet": "Who had turtles in a bra on their 2025 bingo card? The Transportation Security Administration has seen just about everything. But every year, a handful of discoveries rise above the usual pocketknives and oversized shampoo bottles and earn a place in TSA lore. This week, the agency released its list of the top ten most […]\nThe post You’ve Heard of Snakes on a Plane. Now, Get Ready for… Turtles in a Bra? appeared first on Avgeekery.",
    "pubDate": "Fri, 30 Jan 2026 19:28:39 +0000",
    "link": "https://avgeekery.com/get-ready-for-turtles-in-a-bra/",
    "source": "avgeekery"
  },
  {
    "title": "NRO Officially Declassifies JUMPSEAT First Gen Signals Intelligence Satellites",
    "contentSnippet": "Launched between 1971 and 1987 primarily to collect intelligence data on foreign weapon testing, the last satellites in the JUMPSEAT family were withdrawn from service in 2006.  A memorandum dated Dec. 4, 2025 from the office of Christopher J. Scolese, Director of the U.S. National Reconaissance Office (NRO), formally declassified the existence of and some […]",
    "pubDate": "Fri, 30 Jan 2026 15:30:57 +0000",
    "link": "https://theaviationist.com/2026/01/30/nro-jumpseat-sigint-satellites-declassified/",
    "source": "The Aviationist"
  },
  {
    "title": "Iran Might Have Received Mi-28 Havoc Attack Helicopters",
    "contentSnippet": "Recently emerged images show a Mi-28NE helicopter in a hangar geolocated in Iran, following reports of multiple Russian Il-76MD cargo aircraft flying into the country. Photos emerged on Jan. 28, 2026, show what has been described as a single Mi-28NE Havoc in an Iranian facility. Open-Source Intelligence (OSINT) profiles later geo-located the pictures of the […]",
    "pubDate": "Fri, 30 Jan 2026 12:25:23 +0000",
    "link": "https://theaviationist.com/2026/01/30/iran-mi-28-helicopters/",
    "source": "The Aviationist"
  },
  {
    "title": "AvTalk Episode 355: Systemic failures",
    "pubDate": "Fri, 30 Jan 2026 12:15:55 +0000",
    "contentSnippet": "On this week’s episode of AvTalk: The NTSB holds its board meeting to determine the probable cause of the mid-air collision above the Potomac River last January UPS announces it has retired its MD-11 fleet A Bombardier business jet crashes attempting to depart Bangor, Maine Airlines are modifying their routes and schedules to avoid tensions […]\nThe post AvTalk Episode 355: Systemic failures appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/avtalk-podcast/avtalk-355/",
    "source": "FlightRadar24"
  },
  {
    "title": "New terminal pushes Newcastle to new record",
    "contentSnippet": "Over the months of October to December 2025, a total of 340,778 passengers travelled through the updated terminal, including 111,007 in December alone. The airport now says it is expecting 1.334 million passengers by the end of the 2025-26 financial year.",
    "pubDate": "Fri, 30 Jan 2026 06:00:31 +0000",
    "link": "https://australianaviation.com.au/2026/01/new-terminal-pushes-newcastle-to-new-record/",
    "source": "Australian Aviation"
  },
  {
    "title": "NJE adds 12th Dash 8 Q400 to WA charter fleet",
    "contentSnippet": "The turboprop, registered VH-8QD, will operate alongside NJE’s eight-strong Embraer E190 fleet in the west, and comes as the carrier plans to add at least two more E-Jets to its fleet this year.",
    "pubDate": "Fri, 30 Jan 2026 04:21:47 +0000",
    "link": "https://australianaviation.com.au/2026/01/nje-adds-12th-dash-8-q400-to-wa-charter-fleet/",
    "source": "Australian Aviation"
  },
  {
    "title": "Launceston Airport breaks ground on new firefighting facility",
    "contentSnippet": "The 470-square-metre firefighting hub will strengthen the emergency response capabilities at Launceston, and is expected to be finished in time for the peak summer fire season later this year.",
    "pubDate": "Fri, 30 Jan 2026 03:38:04 +0000",
    "link": "https://australianaviation.com.au/2026/01/launceston-airport-breaks-ground-on-new-firefighting-facility/",
    "source": "Australian Aviation"
  },
  {
    "title": "Qantas to increase Sapporo flights for 2026 season",
    "contentSnippet": "Citing “strong performance and exceptional demand”, the Flying Kangaroo will increase from the current three A330-200 flights per week to up to five in 2026/27, representing over a 50 per cent capacity increase from the current season.",
    "pubDate": "Fri, 30 Jan 2026 00:51:27 +0000",
    "link": "https://australianaviation.com.au/2026/01/qantas-to-increase-sapporo-flights-for-2026-season/",
    "source": "Australian Aviation"
  },
  {
    "title": "Wall Street Journal Names the Best US Airline of 2025. And the Winner Is…",
    "contentSnippet": "The Wall Street Journal reveals the best US airline of 2025 and a surprising shakeup in the rankings. Nobody can deny that 2025 was a turbulent year for air travel in the United States. And while no single airline operated perfectly (or anywhere close to it), one airline managed to rise above the industry’s familiar […]\nThe post Wall Street Journal Names the Best US Airline of 2025. And the Winner Is… appeared first on Avgeekery.",
    "pubDate": "Fri, 23 Jan 2026 22:14:56 +0000",
    "link": "https://avgeekery.com/best-us-airline-of-2025/",
    "source": "avgeekery"
  },
  {
    "title": "IBA forecasts 1,800 aircraft deliveries in 2026 as airline outlook stabilises",
    "contentSnippet": "Global aircraft deliveries are expected to reach around 1,800 units in 2026, according to new forecasts from aviation consultancy IBA, as easing inflation, lower fuel prices and improving manufacturer production rates support a more stable outlook for airlines. The prediction was outlined by IBA’s Chief Economist and Chief Data Officer,  [read more]\nThe post IBA forecasts 1,800 aircraft deliveries in 2026 as airline outlook stabilises appeared first on UK Aviation News.",
    "pubDate": "Fri, 23 Jan 2026 17:27:09 +0000",
    "link": "https://ukaviation.aero/iba-forecasts-1800-aircraft-deliveries-in-2026-as-airline-outlook-stabilises/",
    "source": "UK Aviation News"
  },
  {
    "title": "AvTalk Episode 354: Want to buy a 747SP?",
    "pubDate": "Fri, 23 Jan 2026 12:15:48 +0000",
    "contentSnippet": "On this week’s episode of AvTalk, the US issues a set of NOTAMs warning of military activity in a large swath of the North Pacific. The NTSB issues an update on the UPS MD-11 crash, focusing on additional materials analysis performed on a bearing from the engine pylon mount. An ATR 42 operating for the […]\nThe post AvTalk Episode 354: Want to buy a 747SP? appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/avtalk-podcast/avtalk-354/",
    "source": "FlightRadar24"
  },
  {
    "title": "AvTalk Episode 353: Boeing has a banner year",
    "pubDate": "Fri, 16 Jan 2026 12:15:27 +0000",
    "contentSnippet": "On this week’s episode of AvTalk, Boeing and Airbus report their final tallies for orders and deliveries in 2025 and it was Boeing’s best year since 2018. Allegiant is buying Sun Country in a shake up of the ultra low-cost market in the US. Delta comes full circle and orders up to 60 787s. And […]\nThe post AvTalk Episode 353: Boeing has a banner year appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/avtalk-podcast/avtalk-353/",
    "source": "FlightRadar24"
  },
  {
    "title": "GeminiJets Airplane Models – October 25 New Release + Discounts",
    "contentSnippet": "I have been collecting GeminiJets since they launched 20 years ago! During difficult times, I have found that model collecting can help alleviate some of the stress. Video Special Offer This is a sponsored post to showcase the latest GeminiJets airplane model releases. Hope you find something you like. To purchase GeminiJets, go to DiecastJets.com and use code SAMCHUI at checkout for up to 25% off and free shipping in the US. October 2025 1:400 New Release October 2025 1:200 New Release Video This is a sponsored post […]\nThe post GeminiJets Airplane Models – October 25 New Release + Discounts appeared first on SamChui.com.",
    "pubDate": "Fri, 14 Nov 2025 07:48:06 +0000",
    "link": "https://samchui.com/2025/11/14/geminijets-airplane-models-october-25-new-release-discounts/",
    "source": "Sam Chui"
  },
  {
    "title": "Air Astana, Somon Air, and Uzbekistan Airways Order New Boeing Jets",
    "contentSnippet": "Boeing has announced new aircraft orders from three Central Asian airlines, Air Astana, Somon Air, and Uzbekistan Airways.  All three announcements were made during the C5+1 Summit, commemorating the 10th anniversary of the diplomatic platform linking the United States with the five Central Asian nations. Uzbekistan Airways Expands 787 Dreamliner Fleet Uzbekistan Airways has firmed an order for eight Boeing 787 Dreamliners, increasing its total order book for the type to 22 aircraft. The signing ceremony took place at the […]\nThe post Air Astana, Somon Air, and Uzbekistan Airways Order New Boeing Jets appeared first on SamChui.com.",
    "pubDate": "Fri, 07 Nov 2025 04:16:39 +0000",
    "link": "https://samchui.com/2025/11/07/air-astana-somon-air-and-uzbekistan-airways-order-new-boeing-jets/",
    "source": "Sam Chui"
  }
]