[
  {
    "title": "Lufthansa to launch special 100th anniversary livery fleet",
    "pubDate": "Wed, 26 Nov 2025 20:20:38 +0000",
    "contentSnippet": "In late September, Lufthansa unveiled a special 100th anniversary livery on one of its new 787s. The livery features a deep blue background with a white crane across the fuselage that blends into the wings. On the left side of the fuselage is painted a large “100,” and on the right side, “1926-2026,” to mark […]\nThe post Lufthansa to launch special 100th anniversary livery fleet appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/aviation-news/airline-news/lufthansa-to-launch-special-100th-anniversary-livery-fleet/",
    "source": "FlightRadar24"
  },
  {
    "title": "BALPA says budget is ‘Bad News’ for the UK’s airline industry",
    "contentSnippet": "The union which represents British airline pilots, BALPA has condemned todays budget by Labour Chancellor Rachel Reeves as ‘Bad News for the aviation industry. In her budget, Ms Reeves went against advice form the industry and raised Air Passenger Duty inline with RPI, a move which will hit families going  [read more]\nThe post BALPA says budget is ‘Bad News’ for the UK’s airline industry appeared first on UK Aviation News.",
    "pubDate": "Wed, 26 Nov 2025 17:31:45 +0000",
    "link": "https://ukaviation.news/balpa-says-budget-is-bad-news-for-the-uks-airline-industry/",
    "source": "UK Aviation News"
  },
  {
    "title": "British Airways Announces New Routes for 2026",
    "contentSnippet": "British Airways has unveiled a series of new routes for 2026, expanding both its short-haul and long-haul network as demand for leisure and business travel continues to grow. The additions include new services to the Adriatic coast, the Channel Islands and a fresh gateway in the United States, offering UK  [read more]\nThe post British Airways Announces New Routes for 2026 appeared first on UK Aviation News.",
    "pubDate": "Wed, 26 Nov 2025 16:31:48 +0000",
    "link": "https://ukaviation.news/british-airways-announces-new-routes-for-2026/",
    "source": "UK Aviation News"
  },
  {
    "title": "US DOT Secretary Sean Duffy Says He Wants Americans to Stop Treating Airplanes like an Airborne Walmart at 2AM",
    "contentSnippet": "With the government shutdown finally behind us and the Thanksgiving travel rush hitting full throttle, airports across the country are bracing for what could be some of the busiest days in TSA history. Into this holiday storm steps US Transportation Secretary Sean Duffy, who has a seasonal request for the nation: dress a little better, […]\nThe post US DOT Secretary Sean Duffy Says He Wants Americans to Stop Treating Airplanes like an Airborne Walmart at 2AM appeared first on Avgeekery.",
    "pubDate": "Wed, 26 Nov 2025 15:49:09 +0000",
    "link": "https://avgeekery.com/sean-duffy-wants-air-travel-to-calm-down-no-pajamas/",
    "source": "avgeekery"
  },
  {
    "title": "Misawa BTF’s B-1Bs Continue Exercises While B-52s Conclude BTF Europe 26-1",
    "contentSnippet": "B-1B Lancer bombers deployed to Japan’s Misawa AB continue exercises with regional partners, while the B-52 Stratofortresses deployed to Spain’s Morón AB returned to Barksdale AFB. The U.S. Air Force announced on Nov. 24, 2025 the conclusion of its two-week BTF (Bomber Task Force) Europe deployment to Spain’s Morón Air Base, designated BTF Europe 26-1, […]",
    "pubDate": "Wed, 26 Nov 2025 13:19:13 +0000",
    "link": "https://theaviationist.com/2025/11/26/usaf-bomber-task-forces-japan-spain/",
    "source": "The Aviationist"
  },
  {
    "title": "Ukrainian Pilot Touts Mirage 2000’s Effectiveness in Combat",
    "contentSnippet": "Operating out of forward bases and armed only with Magic 2 missiles, the Mirage is claimed to have a 98% effectiveness against drones and cruise missiles in Ukraine. The Ukrainian Air Force released a video of a rarely seen French-supplied Mirage 2000, with a pilot and technicians speaking about the jet’s effectiveness on the battlefield. […]",
    "pubDate": "Wed, 26 Nov 2025 12:35:30 +0000",
    "link": "https://theaviationist.com/2025/11/26/ukrainian-pilot-mirage-2000-effectiveness/",
    "source": "The Aviationist"
  },
  {
    "title": "How Rotate Turns Flightradar24 Flight Data into Cargo Intelligence",
    "pubDate": "Wed, 26 Nov 2025 09:05:34 +0000",
    "contentSnippet": "Founded in 2022, Utrecht based Rotate describes itself as “the go-to team in the air-cargo industry”. Rotate helps their clients make sense of the fast-moving world of air cargo, capturing the status and cargo metrics of more than 500,000 flights a week. Their client portfolio spans everything from airlines in need of quality benchmark data […]\nThe post How Rotate Turns Flightradar24 Flight Data into Cargo Intelligence appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/b2b/how-rotate-turns-flightradar24-flight-data-into-cargo-intelligence/",
    "source": "FlightRadar24"
  },
  {
    "title": "Dubai Airshow Day 3: Orders for Airbus & Boeing",
    "contentSnippet": "Emirates has ordered eight Airbus A350s on the third day of the Dubai Airshow, while flydubai has signed a memorandum of understanding (MoU) for up to 150 Boeing 737 MAX jets. Moreover, Airbus also received orders from Buraq Air and Silk Way West Airlines for A320neo and A350F freighters, respectively. flydubai Signs MoU for up to 150 Boeing 737 MAX Jets Just 24 hours after announcing an MoU with Airbus for 150 A321neos, flydubai has now signed another MoU with Boeing for up to […]\nThe post Dubai Airshow Day 3: Orders for Airbus & Boeing appeared first on SamChui.com.",
    "pubDate": "Wed, 19 Nov 2025 12:29:48 +0000",
    "link": "https://samchui.com/2025/11/19/dubai-airshow-day-3-orders-for-airbus-boeing/",
    "source": "Sam Chui"
  },
  {
    "title": "flydubai signs MoU for 75 Boeing 737 MAX Airplanes",
    "contentSnippet": "",
    "pubDate": "Wed, 19 Nov 2025 05:01:00 -0500",
    "link": "https://boeing.mediaroom.com/2025-11-19-flydubai-signs-MoU-for-75-Boeing-737-MAX-Airplanes",
    "source": "Boeing"
  },
  {
    "title": "UPS MD-11 Crashes Near Louisville Airport",
    "contentSnippet": "On November 4, 2025, a UPS McDonnell Douglas MD-11 cargo aircraft crashed shortly after takeoff from Muhammad Ali International Airport in Louisville, Kentucky.  The MD-11 with registered N259UP, was operating UPS Flight 2976 to Honolulu, Hawaii, when the accident occurred. Three crew members were on board at the time of the crash.  Local authorities confirmed that emergency services responded to the scene, with reports of injuries and significant structural damage in the surrounding area. Update: November 5, 23:30 UTC Investigators […]\nThe post UPS MD-11 Crashes Near Louisville Airport appeared first on SamChui.com.",
    "pubDate": "Wed, 05 Nov 2025 00:22:58 +0000",
    "link": "https://samchui.com/2025/11/05/ups-md-11-crashes-near-louisville-airport/",
    "source": "Sam Chui"
  },
  {
    "title": "Ukrainian Strike on Beriev Plant Destroys Russian Laser and AEW Testbeds",
    "contentSnippet": "Two ultra-rare Russian aircraft have been destroyed in an attack on aircraft manufacturer Beriev’s plant near the Black Sea city of Taganrog. Alongside damage to Beriev’s facility itself, which is a repair facility for Russia’s Beriev A-50 ‘Mainstay’ airborne early warning (AEW) aircraft fleet, satellite imagery depicts the destruction of two Ilyushin Il-76 type aircraft. […]",
    "pubDate": "Tue, 25 Nov 2025 21:59:10 +0000",
    "link": "https://theaviationist.com/2025/11/25/ukrainian-strike-beriev-plant-destroys-testbeds/",
    "source": "The Aviationist"
  },
  {
    "title": "easyJet Announces 16 New UK Routes for Summer 2026",
    "contentSnippet": "easyJet has unveiled a major expansion of its UK network, confirming the launch of 16 new routes from eight airports across the country for the Summer 2026 season. The new services will connect UK travellers to an even wider choice of sunshine destinations, cultural city breaks and island getaways across Europe, North  [read more]\nThe post easyJet Announces 16 New UK Routes for Summer 2026 appeared first on UK Aviation News.",
    "pubDate": "Tue, 25 Nov 2025 19:54:58 +0000",
    "link": "https://ukaviation.news/easyjet-announces-16-new-uk-routes-for-summer-2026/",
    "source": "UK Aviation News"
  },
  {
    "title": "F-35s Paved the Way for Strike Package During Operation Midnight Hammer",
    "contentSnippet": "The U.S. Air Force disclosed for the first time that the F-35s were tasked with the Suppression of Enemy Air Defenses, and were the first in and last out of Iran during the strike mission. In a press release published on Nov. 25, 2025, the U.S. Air Force has disclosed new details about the role […]",
    "pubDate": "Tue, 25 Nov 2025 19:08:56 +0000",
    "link": "https://theaviationist.com/2025/11/25/f-35-sead-op-midnight-hammer/",
    "source": "The Aviationist"
  },
  {
    "title": "Heathrow Airport’s third runway plan chosen as Government’s preferred option",
    "contentSnippet": "The UK Government has announced that it has selected Heathrow Airport’s own proposal for a third runway as its preferred option. The two plans put forward were very different with Heathrow’s plan including a 2.2 mile long runway which would require the M25 to be moved and a tunnel being  [read more]\nThe post Heathrow Airport’s third runway plan chosen as Government’s preferred option appeared first on UK Aviation News.",
    "pubDate": "Tue, 25 Nov 2025 18:03:31 +0000",
    "link": "https://ukaviation.news/heathrow-airports-third-runway-plan-chosen-as-governments-preferred-option/",
    "source": "UK Aviation News"
  },
  {
    "title": "Flying in Paradise: the growth of aviation in French Polynesia",
    "pubDate": "Tue, 25 Nov 2025 16:30:26 +0000",
    "contentSnippet": "French Polynesia, officially known in French as Polynésie Française or Porinetia Farani in Reo Tahiti (Tahitian), is located in Oceania. The archipelago is made up of 118 islands and atolls, many of them having air connectivity within the French overseas collectivity. Faa’a International Airport (PPT/NTAA) is the main airport in French Polynesia, situated in Papeete, […]\nThe post Flying in Paradise: the growth of aviation in French Polynesia appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/aviation-news/airline-news/airline-routes/flying-in-paradise-the-growth-of-aviation-in-french-polynesia/",
    "source": "FlightRadar24"
  },
  {
    "title": "D.B. Cooper: The Boeing 727 Legend Born on a Stormy Thanksgiving Eve",
    "contentSnippet": "On a gloomy Thanksgiving Eve in 1971, a man in a black suit, thin raincoat, and clip-on tie paid $20 in cash for a one-way ticket. He walked onto a Boeing 727, took his seat near the back of the cabin, ordered a bourbon and a 7Up, and by the end of the night had […]\nThe post D.B. Cooper: The Boeing 727 Legend Born on a Stormy Thanksgiving Eve appeared first on Avgeekery.",
    "pubDate": "Tue, 25 Nov 2025 01:12:53 +0000",
    "link": "https://avgeekery.com/d-b-cooper-boeing-727-legend-thanksgiving-eve/",
    "source": "avgeekery"
  },
  {
    "title": "Report: 747’s engine advanced to full throttle in fatal Hong Kong runway excursion",
    "pubDate": "Tue, 18 Nov 2025 18:07:01 +0000",
    "contentSnippet": "The Hong Kong Air Accident Investigation Authority (AAIA) has released its preliminary report on the airACT 747 freighter that veered off the runway on 20 October, striking a security vehicle and pushing it into the sea, killing both occupants. The 747 also went through the airport perimeter fence into the sea. The aircraft’s crew of […]\nThe post Report: 747’s engine advanced to full throttle in fatal Hong Kong runway excursion appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/aviation-news/aviation-safety/hong-kong-airact-747-preliminary-report/",
    "source": "FlightRadar24"
  },
  {
    "title": "Dubai Airshow 2025 Day 2: Big Orders for Airbus",
    "contentSnippet": "After a quiet Day 1, Airbus opened Day 2 with major orders from Etihad Airways, flydubai, Air Europa and Ethiopian Airlines. Moreover, Boeing also received order from Gulf Air, following a successful Day 1. Etihad Airways Orders Airbus A330neo, A350-1000 and A350F Etihad Airways has placed a firm order for six A330-900s, becoming the newest customer for the A330neo. It is also expanding its A350 fleet with seven additional A350-1000s (now totaling 27) and three more A350F freighters, bringing its A350F commitment to 10. […]\nThe post Dubai Airshow 2025 Day 2: Big Orders for Airbus appeared first on SamChui.com.",
    "pubDate": "Tue, 18 Nov 2025 12:08:53 +0000",
    "link": "https://samchui.com/2025/11/18/dubai-airshow-2025-day-2-big-orders-for-airbus/",
    "source": "Sam Chui"
  },
  {
    "title": "Boeing: Middle East Airlines Enter New Era of Growth as Region's Fleet Will More Than Double by 2044",
    "contentSnippet": "",
    "pubDate": "Tue, 18 Nov 2025 03:13:00 -0500",
    "link": "https://boeing.mediaroom.com/2025-11-18-Boeing-Middle-East-Airlines-Enter-New-Era-of-Growth-as-Regions-Fleet-Will-More-Than-Double-by-2044",
    "source": "Boeing"
  },
  {
    "title": "American Airlines B737-800 Diverts to Belize After Engine Shutdown",
    "contentSnippet": "American Airlines flight AA327, a B737-800 enroute to San Salvador from Miami, diverted to Belize City after shutting down an engine in flight on 26 November.\nThe post American Airlines B737-800 Diverts to Belize After Engine Shutdown appeared first on AviationSource News.",
    "pubDate": "Thu, 27 Nov 2025 23:51:40 +0000",
    "link": "https://aviationsourcenews.com/american-airlines-b737-800-diverts-to-belize-after-engine-shutdown/",
    "source": "Aviation Source News"
  },
  {
    "title": "Vietjet Takes Delivery of First Boeing 737 MAX 8",
    "contentSnippet": "Vietjet has seen the long-awaited arrival of its first Boeing 737 MAX 8, as part of a landmark 200-aircraft order signed with Boeing in 2018.\nThe post Vietjet Takes Delivery of First Boeing 737 MAX 8 appeared first on AviationSource News.",
    "pubDate": "Thu, 27 Nov 2025 22:43:20 +0000",
    "link": "https://aviationsourcenews.com/vietjet-takes-delivery-of-first-boeing-737-max-8/",
    "source": "Aviation Source News"
  },
  {
    "title": "New Pacific Airlines Ceases Flight Operations",
    "contentSnippet": "In an immediate closure, Alaska-based high-end charter operator New Pacific Airlines has ceased flight operations amid financial struggles.\nThe post New Pacific Airlines Ceases Flight Operations appeared first on AviationSource News.",
    "pubDate": "Thu, 27 Nov 2025 22:24:21 +0000",
    "link": "https://aviationsourcenews.com/new-pacific-airlines-ceases-flight-operations/",
    "source": "Aviation Source News"
  },
  {
    "title": "AvTalk Episode 347: Fatigue cracks, thrust levers, and sand ballast",
    "pubDate": "Thu, 27 Nov 2025 21:45:48 +0000",
    "contentSnippet": "On this week’s episode of AvTalk, Ian is joined by aviation journalist Jeremy Dwyer-Lindgren to discuss a trio of recently released preliminary accident reports. UPS flight 2976 — MD-11F crash on take off in Louisville Emergency Airworthiness Directive regarding MD-11s Emergency Airworthiness Directive regarding DC-10s United Airlines flight 1093 — impact with object at 36,000 […]\nThe post AvTalk Episode 347: Fatigue cracks, thrust levers, and sand ballast appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/avtalk-podcast/avtalk-347/",
    "source": "FlightRadar24"
  },
  {
    "title": "UK MoD Confirms F-35B Rolling Landings Still in Future Plans",
    "contentSnippet": "Following reports about the cancellation of a landing aid for the SRVL technique on HMS Queen Elizabeth, a Govt minister has clarified that, though timelines have shifted, rolling landings are still planned. In early November, the UK’s Ministry of Defence (MoD) released its 2024/2025 Annual Report and Accounts. Among the 256 pages, one table lists […]",
    "pubDate": "Thu, 27 Nov 2025 20:17:46 +0000",
    "link": "https://theaviationist.com/2025/11/27/uk-confirms-f35b-srvl-future/",
    "source": "The Aviationist"
  },
  {
    "title": "Visit Malta – sun, history and island-hopping in the central Mediterranean",
    "contentSnippet": "Malta’s mix of honey-coloured streets, prehistoric temples, tiny fishing villages and crystalline bays makes it an irresistible short-haul choice from the UK. It’s compact (you can cross the main island end-to-end in under an hour) yet packed with things to do: UNESCO-listed Valletta, the baroque quiet of Mdina, the Blue  [read more]\nThe post Visit Malta – sun, history and island-hopping in the central Mediterranean appeared first on UK Aviation News.",
    "pubDate": "Thu, 27 Nov 2025 09:00:00 +0000",
    "link": "https://ukaviation.news/visit-malta-sun-history-and-island-hopping-in-the-central-mediterranean/",
    "source": "UK Aviation News"
  },
  {
    "title": "New Pacific Airlines Shuts Down: A Sudden End to a Complicated 2-Year Journey",
    "contentSnippet": "New Pacific Airlines shuts down after years of rebrands, regulatory delays, and an unfocused business model. It is a grim Thanksgiving for the employees of New Pacific Airlines, who learned on Wednesday, 26 November, that the Anchorage-based carrier has ceased operations. The news arrived in an all-staff email from President and CEO Thomas Hsieh. It […]\nThe post New Pacific Airlines Shuts Down: A Sudden End to a Complicated 2-Year Journey appeared first on Avgeekery.",
    "pubDate": "Thu, 27 Nov 2025 08:09:14 +0000",
    "link": "https://avgeekery.com/new-pacific-airlines-shuts-down/",
    "source": "avgeekery"
  },
  {
    "title": "From TWA to Southwest: The Real Airlines in Planes, Trains and Automobiles",
    "contentSnippet": "This Heatwarming Thanksgiving Classic Movie Is Also An Avgeek Time Capsule Every Thanksgiving, millions of Americans settle down after a turkey dinner for a holiday tradition. They laugh as Neal Page (Steve Martin) and Del Griffith (John Candy) suffer through the worst Hollywood-ized version of Thanksgiving travel. John Hughes’ 1987 classic, Planes Trains and Automobiles […]\nThe post From TWA to Southwest: The Real Airlines in Planes, Trains and Automobiles appeared first on Avgeekery.",
    "pubDate": "Thu, 27 Nov 2025 05:53:17 +0000",
    "link": "https://avgeekery.com/planes-trains-and-automobiles-avgeek/",
    "source": "avgeekery"
  },
  {
    "title": "SAF a better bet than hydrogen or electric aircraft, says Hudson",
    "contentSnippet": "Speaking on a sustainability and decarbonisation panel at a Commonwealth Bank event on Wednesday, Vanessa Hudson said Qantas is focusing on sustainable aviation fuel as part of its push to reduce carbon emissions rather than on newer technologies.",
    "pubDate": "Thu, 27 Nov 2025 05:33:45 +0000",
    "link": "https://australianaviation.com.au/2025/11/saf-a-better-bet-than-hydrogen-or-electric-aircraft-says-hudson/",
    "source": "Australian Aviation"
  },
  {
    "title": "Australia to hit record capacity as international growth continues",
    "contentSnippet": "According to aviation analytics firm Cirium, Australia will see 12.2 million scheduled seats in December 2025, with 45 per cent of this coming from international capacity.",
    "pubDate": "Thu, 27 Nov 2025 03:13:58 +0000",
    "link": "https://australianaviation.com.au/2025/11/australia-to-hit-record-capacity-as-international-growth-continues/",
    "source": "Australian Aviation"
  },
  {
    "title": "Alliance may revisit QantasLink wet-lease agreement",
    "contentSnippet": "In his speech at the company’s AGM, Alliance Aviation Services chair James Jackson said the charter, FIFO and wet-lease operator has been looking “to review and seek to renegotiate a major ACMI [aircraft, crew, maintenance and insurance] contract” due to unexpected high costs.",
    "pubDate": "Thu, 27 Nov 2025 02:30:50 +0000",
    "link": "https://australianaviation.com.au/2025/11/alliance-may-revisit-qantaslink-wet-lease-agreement/",
    "source": "Australian Aviation"
  },
  {
    "title": "Podcast: Smashing the aviation data silos",
    "contentSnippet": "On this podcast, Jake Nelson talks to Clint Cardozo and Carly Waddleton from OneReg on the perils of data silos in aviation, and how to streamline the regulatory compliance process.",
    "pubDate": "Thu, 27 Nov 2025 02:08:08 +0000",
    "link": "https://australianaviation.com.au/2025/11/podcast-smashing-the-aviation-data-silos/",
    "source": "Australian Aviation"
  },
  {
    "title": "NZ government loosens regulations on aerospace development",
    "contentSnippet": "The NZ government says the new rules, to come into effect on 22 December, will make it easier for innovative aerospace solutions to be developed and tested without needing approval from the Civil Aviation Authority for each new iteration unless there are “substantial changes” to the operation.",
    "pubDate": "Thu, 27 Nov 2025 01:03:10 +0000",
    "link": "https://australianaviation.com.au/2025/11/nz-government-loosens-regulations-on-aerospace-development/",
    "source": "Australian Aviation"
  },
  {
    "title": "Boeing and Somon Air Announce Commitment for Up to 14 Airplanes",
    "contentSnippet": "",
    "pubDate": "Thu, 06 Nov 2025 16:41:00 -0500",
    "link": "https://boeing.mediaroom.com/2025-11-06-Boeing-and-Somon-Air-Announce-Commitment-for-Up-to-14-Airplanes",
    "source": "Boeing"
  },
  {
    "title": "Cathay Pacific A350 Suffers Tailstrike During Go Around in Hong Kong",
    "contentSnippet": "A Cathay Pacific A350-1000 arriving in Hong Kong from Ho Chi Minh City suffered a tailstrike while carrying out a go-around procedure on 26 November.\nThe post Cathay Pacific A350 Suffers Tailstrike During Go Around in Hong Kong appeared first on AviationSource News.",
    "pubDate": "Sun, 30 Nov 2025 23:52:30 +0000",
    "link": "https://aviationsourcenews.com/cathay-pacific-a350-suffers-tailstrike-during-go-around-in-hong-kong/",
    "source": "Aviation Source News"
  },
  {
    "title": "A320s fly again after software update sparked weekend of chaos",
    "contentSnippet": "The update, pushed out by Airbus on Saturday after a recent incident involving a JetBlue A320, was required on 34 of Jetstar’s 85 A320/21 family aircraft, and caused significant delays and disruptions while the low-cost carrier rushed to implement it.",
    "pubDate": "Sun, 30 Nov 2025 23:24:08 +0000",
    "link": "https://australianaviation.com.au/2025/12/a320s-fly-again-after-software-update-sparked-weekend-of-chaos/",
    "source": "Australian Aviation"
  },
  {
    "title": "Jetstar Launches Direct Perth to Manila Flights in Major WA Expansion",
    "contentSnippet": "Jetstar has kicked off its first-ever direct flights between Perth and Manila, marking a significant boost to the airline’s operations in Western Australia.\nThe post Jetstar Launches Direct Perth to Manila Flights in Major WA Expansion appeared first on AviationSource News.",
    "pubDate": "Sun, 30 Nov 2025 22:56:11 +0000",
    "link": "https://aviationsourcenews.com/jetstar-launches-direct-perth-to-manila-flights-in-major-wa-expansion/",
    "source": "Aviation Source News"
  },
  {
    "title": "Ryanair Axes its Prime Membership Program After Eight Months",
    "contentSnippet": "Ryanair has abruptly shuttered its Prime membership program after just eight months, after uptake stalled at just 22% of its planned target.\nThe post Ryanair Axes its Prime Membership Program After Eight Months appeared first on AviationSource News.",
    "pubDate": "Sun, 30 Nov 2025 22:40:46 +0000",
    "link": "https://aviationsourcenews.com/ryanair-axes-its-prime-membership-program-after-eight-months/",
    "source": "Aviation Source News"
  },
  {
    "title": "Wizz Air Celebrates the Arrival of Its 250th Aircraft",
    "contentSnippet": "Wizz Air has marked a milestone in its plan to operate a 500-strong fleet with the arrival of its 250th aircraft in custom livery.\nThe post Wizz Air Celebrates the Arrival of Its 250th Aircraft appeared first on AviationSource News.",
    "pubDate": "Sun, 30 Nov 2025 22:19:49 +0000",
    "link": "https://aviationsourcenews.com/wizz-air-celebrates-the-arrival-of-its-250th-aircraft/",
    "source": "Aviation Source News"
  },
  {
    "title": "Most Airbus A320s Return to Service After Software Update",
    "contentSnippet": "The majority of roughly 6,000 Airbus A320 aircraft affected by an emergency airworthiness directive grounding have now returned to service, with most operators reporting minimal disruptions.\nThe post Most Airbus A320s Return to Service After Software Update appeared first on AviationSource News.",
    "pubDate": "Sun, 30 Nov 2025 21:52:59 +0000",
    "link": "https://aviationsourcenews.com/most-airbus-a320s-return-to-service-after-software-update/",
    "source": "Aviation Source News"
  },
  {
    "title": "Boeing Awarded $2.47 Billion Contract for 15 More KC-46A Pegasus Tankers",
    "contentSnippet": "The U.S. Air Force currently operates 96 KC-46A refuelers, which Boeing is also upgrading with new hardware and software. Boeing announced on Nov. 26, 2025, the award of a new contract, worth $2.47 billion, to build 15 additional KC-46A Pegasus refueling tankers for the U.S. Air Force, covering Production Lot 12. With the 98 KC-46As […]",
    "pubDate": "Sun, 30 Nov 2025 20:40:08 +0000",
    "link": "https://theaviationist.com/2025/11/30/kc-46-lot-12-contract/",
    "source": "The Aviationist"
  },
  {
    "title": "Meteor BVR Missile Tested for the First Time by Brazilian Gripen E",
    "contentSnippet": "Two Meteor live-fire tests were conducted as part of the BVR-X Technical Exercise in the Natal region. The Brazilian Air Force (Força Aérea Brasileira – FAB) announced a major milestone on Nov. 29, 2025, conducting its first Meteor BVRAAM (Beyond Visual Range Air-to-Air Missile) live fire from an F-39E (Brazilian designation for the Saab JAS39 […]",
    "pubDate": "Sun, 30 Nov 2025 20:01:14 +0000",
    "link": "https://theaviationist.com/2025/11/30/brazil-gripen-meteor-live-fire/",
    "source": "The Aviationist"
  },
  {
    "title": "Turkey’s Kizilelma UCAV Shoots Down Target Drone with Gökdoğan Air-to-Air Missile",
    "contentSnippet": "With the live AAM test, the Kizilelma is now the first UCAV to launch a radar-guided air-to-air missile. Turkey’s Kizilelma UCAV ha conducted a live-fire test of the Gökdoğan BVR AAM (Beyond Visual Range Air-to-Air Missile), making it the first UCAV to demonstrate that capability, announced drone maker Baykar on Nov. 30, 2025.  The test […]",
    "pubDate": "Sun, 30 Nov 2025 18:36:38 +0000",
    "link": "https://theaviationist.com/2025/11/30/turkeys-kizilelma-gokdogan-live-fire/",
    "source": "The Aviationist"
  },
  {
    "title": "Mission Complete: HMS Prince of Wales Returns Home from Indo-Pacific Deployment",
    "contentSnippet": "After a mammoth voyage travelling as far as Australia and Japan, HMS Prince of Wales and its carrier strike group have safely returned home to the UK. Their arrival home after eight months completes the Carrier Strike Group 25 (CSG 25) deployment, which was codenamed Operation Highmast. Across the 223 days since HMS Prince of […]",
    "pubDate": "Sun, 30 Nov 2025 13:53:26 +0000",
    "link": "https://theaviationist.com/2025/11/30/csg-25-mission-complete/",
    "source": "The Aviationist"
  },
  {
    "title": "United Flight 1093: Preliminary NTSB Report Reveals the Likely Cause of the Midair Impact",
    "contentSnippet": "New NTSB Report Reveals What Likely Happened to United Flight 1093 Over Utah United Flight 1093 was cruising high above Utah’s Colorado Plateau region, near Moab, when the morning calm was shattered by a surprise and violent impact. At 0643 MDT on 16 October 2025, the Boeing 737 MAX 8 (reg. N17327) was cruising at […]\nThe post United Flight 1093: Preliminary NTSB Report Reveals the Likely Cause of the Midair Impact appeared first on Avgeekery.",
    "pubDate": "Sun, 23 Nov 2025 21:45:58 +0000",
    "link": "https://avgeekery.com/united-flight-1093-ntsb-report-windshield/",
    "source": "avgeekery"
  },
  {
    "title": "Portland ANGB’s 142nd Wing Receives Eighth F-15EX Eagle II As Boeing Strike Ends",
    "contentSnippet": "The Air Force’s 15th F-15EX could be the first delivered to after the three-month strike at the St. Louis plant impacted production of the Eagle II and the F/A-18 Super Hornet Block III. Boeing announced on Nov. 26, 2025, the delivery of a new F-15EX Eagle II fighter to the 142nd Wing of the Portland […]",
    "pubDate": "Sat, 29 Nov 2025 17:20:47 +0000",
    "link": "https://theaviationist.com/2025/11/29/142nd-wing-eighth-f-15ex-eagle-ii/",
    "source": "The Aviationist"
  },
  {
    "title": "Why the Connecticut Air and Space Center Is One of New England’s Best Aviation Museums",
    "contentSnippet": "Located in Stratford at the Sikorsky Memorial Airport, the Connecticut Air and Space Center was founded by George Gunther in 1998, after the Stratford Army Engine Plant closed.   It currently occupies the research and design hangar where Chance Vought conducted its flight testing between 1944 and 1948.  As one of only a few museums […]\nThe post Why the Connecticut Air and Space Center Is One of New England’s Best Aviation Museums appeared first on Avgeekery.",
    "pubDate": "Sat, 29 Nov 2025 16:04:43 +0000",
    "link": "https://avgeekery.com/connecticut-air-and-space-center/",
    "source": "avgeekery"
  },
  {
    "title": "Wing transport capacity doubled at Airbus Broughton",
    "contentSnippet": "Wing transport capacity at Airbus’ wing manufacturing site at Broughton, North Wales; has been doubled following the opening of a new central hub for Oversized Beluga Transport Jigs. The facility is the first of its kind in the Airbus network and is the result of a €7.8m investment in the  [read more]\nThe post Wing transport capacity doubled at Airbus Broughton appeared first on UK Aviation News.",
    "pubDate": "Sat, 29 Nov 2025 15:49:07 +0000",
    "link": "https://ukaviation.news/wing-transport-capacity-doubled-at-airbus-broughton/",
    "source": "UK Aviation News"
  },
  {
    "title": "U.S. Air Force’s T-38 Inducted at Navy’s FRCSE for Overhaul and Repair Program",
    "contentSnippet": "As part of the Talon Repair, Inspection and Maintenance program, T-38s will be inducted at Fleet Readiness Center Southeast to extend their operational life. The Naval Air Systems Command (NAVAIR) announced that the first T-38 Talon of the U.S. Air Force arrived at the Navy’s Fleet Readiness Center Southeast (FRCSE) on Nov. 24, 2025, for overhaul […]",
    "pubDate": "Sat, 29 Nov 2025 12:47:27 +0000",
    "link": "https://theaviationist.com/2025/11/29/usaf-t-38-inducted-navy-frcse/",
    "source": "The Aviationist"
  },
  {
    "title": "Airbus Issues Grounding Order For A320 Aircraft; Immediate Software Update Required",
    "contentSnippet": "Airbus orders precautionary action for A320 family aircraft to undergo an immediate software +/- hardware update. This is due to safety concerns around susceptibility to solar radiation. The European Union Air Safety Agency has followed with an emergency airworthiness directive. It will ground all affected A320s in Europe from Sunday. Airlines worldwide are affected and […]\nThe post Airbus Issues Grounding Order For A320 Aircraft; Immediate Software Update Required appeared first on AviationSource News.",
    "pubDate": "Sat, 29 Nov 2025 00:48:56 +0000",
    "link": "https://aviationsourcenews.com/airbus-issues-grounding-order-for-a320-aircraft-immediate-software-update-required/",
    "source": "Aviation Source News"
  },
  {
    "title": "A Top Gun Attraction is Coming to Vegas, and Maybe Orlando",
    "contentSnippet": "A new Top Gun attraction is coming to the famous Vegas Strip, and maybe another in Orlando, FL. Paramount Global and Advent Allen Entertainment have partnered to create Top Gun Las Vegas for fans of the beloved films, promising thrilling rides, jet simulators, immersive experiences, and entertainment. And food and drinks, of course. The venue […]\nThe post A Top Gun Attraction is Coming to Vegas, and Maybe Orlando appeared first on Avgeekery.",
    "pubDate": "Mon, 24 Nov 2025 22:20:12 +0000",
    "link": "https://avgeekery.com/top-gun-attraction-coming-to-vegas-and-maybe-orlando/",
    "source": "avgeekery"
  },
  {
    "title": "SmartLynx Airlines ceases operations",
    "pubDate": "Mon, 24 Nov 2025 21:44:29 +0000",
    "contentSnippet": "SmartLynx Airlines (6Y-ART), has announced it will halt all commercial operations as of November 24, 2025. The announcement follows a review of the company’s financial outlook and its ability to sustain long-term activity. The carrier described the choice as a “difficult but necessary step after exploring potential paths forward”. The news comes roughly a month […]\nThe post SmartLynx Airlines ceases operations appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/aviation-news/airline-news/smartlynx-airlines-ceases-operations/",
    "source": "FlightRadar24"
  },
  {
    "title": "Lufthansa’s 100th Anniversary Livery Might Be the Best Looking Livery Yet",
    "contentSnippet": "Lufthansa’s 100th Anniversary Livery Joins a Growing List of Stunning Centennial Paint Jobs Are we quietly entering a golden age of airline liveries? With American Airlines debuting its retro-styled Boeing 787 and Delta Air Lines preparing for its own centennial in 2025, airlines worldwide are highlighting their histories. Now Lufthansa steps into the spotlight with […]\nThe post Lufthansa’s 100th Anniversary Livery Might Be the Best Looking Livery Yet appeared first on Avgeekery.",
    "pubDate": "Mon, 24 Nov 2025 20:09:42 +0000",
    "link": "https://avgeekery.com/lufthansas-100th-anniversary-livery-best-looking/",
    "source": "avgeekery"
  },
  {
    "title": "GeminiJets Airplane Models – August 25 New Release + Discounts",
    "contentSnippet": "I have been collecting GeminiJets since they launched 20 years ago! During difficult times, I have found that model collecting can help alleviate some of the stress. Video Special Offer This is a sponsored post to showcase the latest GeminiJets airplane model releases. Hope you find something you like. To purchase GeminiJets, go to DiecastJets.com and use code SAMCHUI at checkout for up to 25% off and free shipping in the US. August 2025 1:400 New Release August 2025 1:200 New Release Video This is a sponsored post […]\nThe post GeminiJets Airplane Models – August 25 New Release + Discounts appeared first on SamChui.com.",
    "pubDate": "Mon, 22 Sep 2025 13:45:40 +0000",
    "link": "https://samchui.com/2025/09/22/geminijets-airplane-models-august-25-new-release-discounts/",
    "source": "Sam Chui"
  },
  {
    "title": "ACT Boeing 747 Freighter Crashes on Landing in Hong Kong",
    "contentSnippet": "On October 20, 2025, a Boeing 747-400 freighter operated by ACT Airlines on behalf of Emirates crashed into the sea after veering off the runway during landing at Hong Kong International Airport (HKG). The Boeing 747-400F, registered TC-ACF, was operating flight EK9788 from Dubai Al Maktoum International Airport (DWC) to Hong Kong, with four crew members onboard. The aircraft departed Dubai on the evening of October 19 and was due to arrive in Hong Kong early the next morning. At […]\nThe post ACT Boeing 747 Freighter Crashes on Landing in Hong Kong appeared first on SamChui.com.",
    "pubDate": "Mon, 20 Oct 2025 08:26:58 +0000",
    "link": "https://samchui.com/2025/10/20/act-cargo-boeing-747-freighter-crashes-on-landing-in-hong-kong/",
    "source": "Sam Chui"
  },
  {
    "title": "Dubai Airshow 2025 Day 1: Big Orders for Boeing",
    "contentSnippet": "Boeing has opened the Dubai Airshow 2025 on a strong note with Emirates placing an order for 65 Boeing 777X aircraft. This was followed by commitments from Ethiopian Airlines and Air Senegal for additional MAX jets. Embraer has also received orders from Helvetic Airways and Air Côte d’Ivoire on the first day of the bi-annual Airshow. Here is a recap of orders and announcements from the first day of the Dubai Airshow. Emirates Orders 65 Boeing 777X Boeing has kicked off the […]\nThe post Dubai Airshow 2025 Day 1: Big Orders for Boeing appeared first on SamChui.com.",
    "pubDate": "Mon, 17 Nov 2025 13:40:06 +0000",
    "link": "https://samchui.com/2025/11/17/dubai-airshow-2025-day-1-big-order-for-boeing-from-emirates/",
    "source": "Sam Chui"
  },
  {
    "title": "Air Senegal Commits to First Boeing 737 MAX Order",
    "contentSnippet": "",
    "pubDate": "Mon, 17 Nov 2025 08:02:00 -0500",
    "link": "https://boeing.mediaroom.com/2025-11-17-Air-Senegal-Commits-to-First-Boeing-737-MAX-Order",
    "source": "Boeing"
  },
  {
    "title": "Ethiopian Airlines Commits to Order 11 Boeing 737 MAX Airplanes",
    "contentSnippet": "",
    "pubDate": "Mon, 17 Nov 2025 06:00:00 -0500",
    "link": "https://boeing.mediaroom.com/2025-11-17-Ethiopian-Airlines-Commits-to-Order-11-Boeing-737-MAX-Airplanes",
    "source": "Boeing"
  },
  {
    "title": "November routes roundup: Etihad launches flights to Tokyo with A380s",
    "pubDate": "Mon, 01 Dec 2025 03:45:21 +0000",
    "contentSnippet": "Airbus A380-800s to the Japanese capital. Etihad Airways has announced the commencement of flights between Abu Dhabi and Tokyo Narita using Airbus A380 aircraft as of June 16th, 2026, replacing the Airbus A350-1000s which currently operate this service. Its Airbus A380s are configured with 2 seats in The Residence®, 9 seats in First, 70 seats in […]\nThe post November routes roundup: Etihad launches flights to Tokyo with A380s appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/aviation-news/airline-news/airline-routes/november-routes-roundup-etihad-launches-flights-to-tokyo-with-a380s/",
    "source": "FlightRadar24"
  },
  {
    "title": "Delta Connection CRJ-900 Slides Off Runway in Des Moines Amid Major Snowstorm",
    "contentSnippet": "A Delta Connection CRJ-900 regional jet slid off the runway at Des Moines International Airport (DSM) on Saturday night, November 29, during a major snowstorm.\nThe post Delta Connection CRJ-900 Slides Off Runway in Des Moines Amid Major Snowstorm appeared first on AviationSource News.",
    "pubDate": "Mon, 01 Dec 2025 00:40:10 +0000",
    "link": "https://aviationsourcenews.com/delta-connection-crj-900-slides-off-runway-in-des-moines-amid-major-snowstorm/",
    "source": "Aviation Source News"
  },
  {
    "title": "Swedish Gripens Shadow Missile-Carrying Tu-22M3 Backfire Bombers over Baltic Sea",
    "contentSnippet": "The Swedish Air Force identified multiple Tu-22M3 bombers operating with Sukhoi fighter escorts over the Baltic Sea on Thursday, Nov. 27, 2025. At least one bomber carried a single Kh-22/32 anti-ship missile. In a sortie coordinated with the NATO Baltic Air Policing effort, the Swedish Air Force launched its Saab Gripen fighters to identify and […]",
    "pubDate": "Fri, 28 Nov 2025 22:43:19 +0000",
    "link": "https://theaviationist.com/2025/11/28/swedish-gripens-tu22-backfire-baltic/",
    "source": "The Aviationist"
  },
  {
    "title": "Belgian aviation: from Sabena to Brussels Airlines",
    "pubDate": "Fri, 28 Nov 2025 22:00:18 +0000",
    "contentSnippet": "More than 102 years ago, more precisely on May 23rd, 1923, the Societé anonyme belge d’Exploitation de la Navigation aérienne, known by its acronym Sabena, was founded by the Belgian government. Its first commercial flight took place on June 1st, 1923, connecting Brussels and London via Ostend. The airline later expanded its operations in Europe, […]\nThe post Belgian aviation: from Sabena to Brussels Airlines appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/aviation-news/airline-news/airline-stories/belgian-aviation-from-sabena-to-brussels-airlines/",
    "source": "FlightRadar24"
  },
  {
    "title": "JetBlue Flight Plunge Triggers Airbus A320 Emergency Airworthiness Directive and Massive Global Grounding",
    "contentSnippet": "EASA has issued an Airbus A320 emergency airworthiness directive after a JetBlue A320 suffered an uncommanded altitude drop and diverted to Tampa last month. The European Union Aviation Safety Agency (EASA) has issued an emergency airworthiness directive that affects a significant portion of the global Airbus A320 fleet. The directive requires an immediate software modification […]\nThe post JetBlue Flight Plunge Triggers Airbus A320 Emergency Airworthiness Directive and Massive Global Grounding appeared first on Avgeekery.",
    "pubDate": "Fri, 28 Nov 2025 21:41:36 +0000",
    "link": "https://avgeekery.com/airbus-a320-emergency-airworthiness-directive/",
    "source": "avgeekery"
  },
  {
    "title": "Airbus issues A320 safety alert over Solar Radiation risk",
    "contentSnippet": "European OEM Airbus has issued an alert to operators of Airbus A320 family warning them to a potential risk of critical flight control data corruption from intense solar radiation. Airbus worked with aviation authorities, including European Aviation Safety Agency (EASA), after identifying a significant number of A320 family aircraft which  [read more]\nThe post Airbus issues A320 safety alert over Solar Radiation risk appeared first on UK Aviation News.",
    "pubDate": "Fri, 28 Nov 2025 20:55:09 +0000",
    "link": "https://ukaviation.news/airbus-issues-a320-safety-alert-over-solar-radiation-risk/",
    "source": "UK Aviation News"
  },
  {
    "title": "Poland Signs $500 Million Contract for AIM-120D-3 AMRAAM Missiles",
    "contentSnippet": "Following a Foreign Military Sale approval for 400 AIM-120D-3 missiles in April, Poland has now signed a contract for the weapons that will arm its F-35s. Poland’s Deputy Prime Minister and Minister of Defense Władysław Kosiniak-Kamysz has signed the contract for the acquisition of the AIM-120D-3 AMRAAM (Advanced Medium Range Air-to-Air Missile) that will arm […]",
    "pubDate": "Fri, 28 Nov 2025 16:04:58 +0000",
    "link": "https://theaviationist.com/2025/11/28/aim-120d-3-poland-contract/",
    "source": "The Aviationist"
  },
  {
    "title": "Virgin Atlantic’s New Routes from the UK for 2026",
    "contentSnippet": "Virgin Atlantic is gearing up for an exciting year in 2026, with two major new long-haul routes launching from London Heathrow. These additions expand the airline’s global network and offer UK travellers fresh opportunities to explore Asia’s most vibrant destinations. London Heathrow to Seoul – Launching 29 March 2026 Virgin  [read more]\nThe post Virgin Atlantic’s New Routes from the UK for 2026 appeared first on UK Aviation News.",
    "pubDate": "Fri, 28 Nov 2025 14:00:00 +0000",
    "link": "https://ukaviation.news/virgin-atlantics-new-routes-from-the-uk-for-2026/",
    "source": "UK Aviation News"
  },
  {
    "title": "Moody AFB’s 23rd Wing Completes Exercise Mosaic Tiger 26-1",
    "contentSnippet": "Mosaic Tiger was used as a distributed operations stress test to simulate how the unit would operate in a future high-end conflict. Exercise Mosaic Tiger 26-1, held Nov. 12–21, 2025 across multiple locations in Florida and Georgia, offered one of the clearest looks yet at how the U.S. Air Force expects its units to operate […]",
    "pubDate": "Fri, 28 Nov 2025 12:40:48 +0000",
    "link": "https://theaviationist.com/2025/11/28/exercise-mosaic-tiger-26-1/",
    "source": "The Aviationist"
  },
  {
    "title": "Egypt Receives More Rafales from Dassault",
    "contentSnippet": "Photos show that deliveries of Rafales to the Egyptian Air Force resumed, with the country planning a total fleet of 54 aircraft. Images appeared online on Nov. 26 show three of the Egyptian Air Force’s (EAF) Rafale fighters taxiing at Dassault Aviation’s facility in Mérignac, near Bordeaux. One post by ‘Philipe Amiel’ on X said […]",
    "pubDate": "Fri, 28 Nov 2025 11:55:39 +0000",
    "link": "https://theaviationist.com/2025/11/28/egypt-more-rafales/",
    "source": "The Aviationist"
  },
  {
    "title": "Jet2’s big push in 2026: expansion of new routes across the UK",
    "contentSnippet": "Jet2 is set for a major expansion in 2026, launching a wide range of new routes and strengthening its presence at airports across the UK. A key development is the opening of a brand-new base at London Gatwick Airport, where six aircraft — including five new Airbus A321neos — will  [read more]\nThe post Jet2’s big push in 2026: expansion of new routes across the UK appeared first on UK Aviation News.",
    "pubDate": "Fri, 28 Nov 2025 10:00:00 +0000",
    "link": "https://ukaviation.news/jet2s-big-push-in-2026-expansion-of-new-routes-across-the-uk/",
    "source": "UK Aviation News"
  },
  {
    "title": "Holidaymakers Warned to Stay Vigilant as Fraud Losses Hit £11m Ahead of ‘Travel Tuesday’",
    "contentSnippet": "With Black Friday and the increasingly popular ‘Travel Tuesday’ approaching, the UK Civil Aviation Authority (CAA) has issued an urgent warning to holidaymakers. The regulator is urging caution after new figures revealed that travellers lost a staggering £11 million to holiday fraud in 2024 alone. As bargain hunters scour the  [read more]\nThe post Holidaymakers Warned to Stay Vigilant as Fraud Losses Hit £11m Ahead of ‘Travel Tuesday’ appeared first on UK Aviation News.",
    "pubDate": "Fri, 28 Nov 2025 06:00:00 +0000",
    "link": "https://ukaviation.news/holidaymakers-warned-to-stay-vigilant-as-fraud-losses-hit-11m-ahead-of-travel-tuesday/",
    "source": "UK Aviation News"
  },
  {
    "title": "Australia’s AH-64E Apaches take flight for the first time",
    "contentSnippet": "This first flight represents the safe operation of the Boeing attack helicopters being used by Australia’s military, marking a significant milestone in the growing capabilities of the Australian Defence Force.",
    "pubDate": "Fri, 28 Nov 2025 03:18:57 +0000",
    "link": "https://australianaviation.com.au/2025/11/australias-ah-64e-apaches-take-flight-for-the-first-time/",
    "source": "Australian Aviation"
  },
  {
    "title": "Jetstar takes off from Perth to Manila",
    "contentSnippet": "Flight JQ81 took off from Perth Airport at around 10pm on Thursday night aboard the A321neo LR VH-OFU, landing in Manila at 4:30am. The low-cost carrier is now competing with Philippine Airlines on the route, with three services per week adding more than 72,000 seats a year.",
    "pubDate": "Fri, 28 Nov 2025 03:06:48 +0000",
    "link": "https://australianaviation.com.au/2025/11/jetstar-takes-off-from-perth-to-manila/",
    "source": "Australian Aviation"
  },
  {
    "title": "Virgin Australia partners with OpenAI for ChatGPT integration",
    "contentSnippet": "The move is the latest step by the airline in its exploration of AI functionality, including a beta test of an AI trip planner and using AI-driven insights to “help forecast demand and deliver market-driven dynamic airfare pricing”.",
    "pubDate": "Fri, 28 Nov 2025 02:15:23 +0000",
    "link": "https://australianaviation.com.au/2025/11/virgin-australia-partners-with-openai-for-chatgpt-integration/",
    "source": "Australian Aviation"
  },
  {
    "title": "Australian Space Summit & Exhibition announces 2026 return",
    "contentSnippet": "Delivered by Space Connect with support of principal partner Space Centre Australia, the agenda is designed to interrogate the major policy decisions, capability challenges and commercial opportunities emerging across the sector.",
    "pubDate": "Fri, 28 Nov 2025 00:33:00 +0000",
    "link": "https://australianaviation.com.au/2025/11/australian-space-summit-exhibition-announces-2026-return/",
    "source": "Australian Aviation"
  },
  {
    "title": "US issues security NOTAM for Venezuelan airspace",
    "pubDate": "Fri, 21 Nov 2025 22:28:22 +0000",
    "contentSnippet": "On Friday, 21 November 2025, the US FAA issued a security NOTAM cautioning civil aircraft operators about potential dangers in Venezuelan airspace. The FAA says the NOTAM is the result of increased GNSS interference in Venezuelan airspace and military drills beginning in September. US operators must now provide 72 hours prior notice to the FAA […]\nThe post US issues security NOTAM for Venezuelan airspace appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/aviation-news/us-issues-security-notam-for-venezuelan-airspace/",
    "source": "FlightRadar24"
  },
  {
    "title": "AvTalk Episode 346: The A340-600 episode",
    "pubDate": "Fri, 21 Nov 2025 12:28:16 +0000",
    "contentSnippet": "On this episode of AvTalk, the Dubai Airshow wraps up with a long list of major orders and other announcements. The FAA cancels its cancellation order and air traffic in the US returns to pre-government shutdown levels. Plus, anti-GPS jamming technology is coming from Fokker Services in early 2026. We’re also joined by The Up […]\nThe post AvTalk Episode 346: The A340-600 episode appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/avtalk-podcast/avtalk-346/",
    "source": "FlightRadar24"
  },
  {
    "title": "GeminiJets Airplane Models – September 25 New Release + Discounts",
    "contentSnippet": "I have been collecting GeminiJets since they launched 20 years ago! During difficult times, I have found that model collecting can help alleviate some of the stress. Video Special Offer This is a sponsored post to showcase the latest GeminiJets airplane model releases. Hope you find something you like. To purchase GeminiJets, go to DiecastJets.com and use code SAMCHUI at checkout for up to 25% off and free shipping in the US. September 2025 1:400 New Release September 2025 1:200 New Release Video This is a sponsored post […]\nThe post GeminiJets Airplane Models – September 25 New Release + Discounts appeared first on SamChui.com.",
    "pubDate": "Fri, 17 Oct 2025 08:36:45 +0000",
    "link": "https://samchui.com/2025/10/17/geminijets-airplane-models-september-25-new-release-discounts/",
    "source": "Sam Chui"
  },
  {
    "title": "GeminiJets Airplane Models – October 25 New Release + Discounts",
    "contentSnippet": "I have been collecting GeminiJets since they launched 20 years ago! During difficult times, I have found that model collecting can help alleviate some of the stress. Video Special Offer This is a sponsored post to showcase the latest GeminiJets airplane model releases. Hope you find something you like. To purchase GeminiJets, go to DiecastJets.com and use code SAMCHUI at checkout for up to 25% off and free shipping in the US. October 2025 1:400 New Release October 2025 1:200 New Release Video This is a sponsored post […]\nThe post GeminiJets Airplane Models – October 25 New Release + Discounts appeared first on SamChui.com.",
    "pubDate": "Fri, 14 Nov 2025 07:48:06 +0000",
    "link": "https://samchui.com/2025/11/14/geminijets-airplane-models-october-25-new-release-discounts/",
    "source": "Sam Chui"
  },
  {
    "title": "Air Astana, Somon Air, and Uzbekistan Airways Order New Boeing Jets",
    "contentSnippet": "Boeing has announced new aircraft orders from three Central Asian airlines, Air Astana, Somon Air, and Uzbekistan Airways.  All three announcements were made during the C5+1 Summit, commemorating the 10th anniversary of the diplomatic platform linking the United States with the five Central Asian nations. Uzbekistan Airways Expands 787 Dreamliner Fleet Uzbekistan Airways has firmed an order for eight Boeing 787 Dreamliners, increasing its total order book for the type to 22 aircraft. The signing ceremony took place at the […]\nThe post Air Astana, Somon Air, and Uzbekistan Airways Order New Boeing Jets appeared first on SamChui.com.",
    "pubDate": "Fri, 07 Nov 2025 04:16:39 +0000",
    "link": "https://samchui.com/2025/11/07/air-astana-somon-air-and-uzbekistan-airways-order-new-boeing-jets/",
    "source": "Sam Chui"
  }
]