[
  {
    "title": "flydubai signs MoU for 75 Boeing 737 MAX Airplanes",
    "contentSnippet": "",
    "pubDate": "Wed, 19 Nov 2025 05:01:00 -0500",
    "link": "https://boeing.mediaroom.com/2025-11-19-flydubai-signs-MoU-for-75-Boeing-737-MAX-Airplanes",
    "source": "Boeing"
  },
  {
    "title": "Playful Allegiant SpongeBob A320 Lifts Spirits With Bikini Bottom Charm",
    "contentSnippet": "Just in time for the holiday season, Allegiant is adding a little more color to America’s secondary airports.  The Las Vegas-based carrier has teamed up with Paramount Pictures to promote The SpongeBob Movie: Search for SquarePants, and the result is an Allegiant SpongeBob jet that is easily one of the most vibrant liveries the airline […]\nThe post Playful Allegiant SpongeBob A320 Lifts Spirits With Bikini Bottom Charm appeared first on Avgeekery.",
    "pubDate": "Wed, 19 Nov 2025 03:25:16 +0000",
    "link": "https://avgeekery.com/allegiant-spongebob-a320/",
    "source": "avgeekery"
  },
  {
    "title": "Former Alaska Pilot Who Tried to Cut Engines Mid-Flight Spared Extra Jail Time",
    "contentSnippet": "A federal judge has ruled that the off-duty Alaska Airlines pilot who tried to shut down a plane’s engines mid-flight in October 2023 will serve no further prison time.\nThe post Former Alaska Pilot Who Tried to Cut Engines Mid-Flight Spared Extra Jail Time appeared first on AviationSource News.",
    "pubDate": "Wed, 19 Nov 2025 00:06:54 +0000",
    "link": "https://aviationsourcenews.com/former-alaska-pilot-who-tried-to-cut-engines-mid-flight-spared-extra-jail-time/",
    "source": "Aviation Source News"
  },
  {
    "title": "RyanAir Refuses Refund for Man Who Missed Flight After Knife Attack",
    "contentSnippet": "Ryanair is refusing to refund a UK man who missed his flight after fighting-off a knife attack with his bare hands and saving lives on a train. Stephen Crean, 61, was heading home to London on Nov 1 when the knife-wielding attacker appeared in his train. People fled past Crean, but he confronted the attacker, […]\nThe post RyanAir Refuses Refund for Man Who Missed Flight After Knife Attack appeared first on Avgeekery.",
    "pubDate": "Wed, 12 Nov 2025 19:29:46 +0000",
    "link": "https://avgeekery.com/ryanair-refuses-refund-for-man-who-missed-flight-after-knife-attack/",
    "source": "avgeekery"
  },
  {
    "title": "Honor Flight Network: The Mission Bringing Veterans to D.C.—and the Surprise They’ll Never Forget",
    "contentSnippet": "On Veterans Day 2025, a heartfelt visit from a former president made an unforgettable journey even more meaningful. It was already a day to remember. ​On 8 November 2025, seventy-nine veterans from World War II, the Korean War, and the Vietnam War arrived at Ronald Reagan Washington National Airport (DCA) from Madison, Wisconsin (MSN), as […]\nThe post Honor Flight Network: The Mission Bringing Veterans to D.C.—and the Surprise They’ll Never Forget appeared first on Avgeekery.",
    "pubDate": "Wed, 12 Nov 2025 16:32:12 +0000",
    "link": "https://avgeekery.com/honor-flight-network-obama/",
    "source": "avgeekery"
  },
  {
    "title": "UPS MD-11 Crashes Near Louisville Airport",
    "contentSnippet": "On November 4, 2025, a UPS McDonnell Douglas MD-11 cargo aircraft crashed shortly after takeoff from Muhammad Ali International Airport in Louisville, Kentucky.  The MD-11 with registered N259UP, was operating UPS Flight 2976 to Honolulu, Hawaii, when the accident occurred. Three crew members were on board at the time of the crash.  Local authorities confirmed that emergency services responded to the scene, with reports of injuries and significant structural damage in the surrounding area. Update: November 5, 23:30 UTC Investigators […]\nThe post UPS MD-11 Crashes Near Louisville Airport appeared first on SamChui.com.",
    "pubDate": "Wed, 05 Nov 2025 00:22:58 +0000",
    "link": "https://samchui.com/2025/11/05/ups-md-11-crashes-near-louisville-airport/",
    "source": "Sam Chui"
  },
  {
    "title": "Ethiopian Airlines Leases Two ATR 72-600s for Air Congo",
    "contentSnippet": "Ethiopian Airlines has signed a lease agreement for two brand-new ATR 72-600 aircraft, which will operate under the colours of DRC national carrier Air Congo.\nThe post Ethiopian Airlines Leases Two ATR 72-600s for Air Congo appeared first on AviationSource News.",
    "pubDate": "Tue, 18 Nov 2025 23:48:09 +0000",
    "link": "https://aviationsourcenews.com/ethiopian-airlines-leases-two-atr-72-600s-for-air-congo/",
    "source": "Aviation Source News"
  },
  {
    "title": "flydubai Signs a Landmark Agreement for 150 A321neo Aircraft",
    "contentSnippet": "flydubai has become a new Airbus customer with the signing of a landmark bulk order for 150 narrowbody A321neo aircraft.\nThe post flydubai Signs a Landmark Agreement for 150 A321neo Aircraft appeared first on AviationSource News.",
    "pubDate": "Tue, 18 Nov 2025 22:58:23 +0000",
    "link": "https://aviationsourcenews.com/flydubai-signs-a-landmark-agreement-for-150-a321neo-aircraft/",
    "source": "Aviation Source News"
  },
  {
    "title": "Bahrain’s Gulf Air Finalizes Boeing 787 Dreamliner Order",
    "contentSnippet": "Bahrain-based carrier Gulf Air has finalized a firm order for 15 Boeing 787 Dreamliners with options for three more; eyeing expansion of its international network.\nThe post Bahrain’s Gulf Air Finalizes Boeing 787 Dreamliner Order appeared first on AviationSource News.",
    "pubDate": "Tue, 18 Nov 2025 22:38:28 +0000",
    "link": "https://aviationsourcenews.com/bahrains-gulf-air-finalizes-boeing-787-dreamliner-order/",
    "source": "Aviation Source News"
  },
  {
    "title": "F-15E Strike Eagles Complete Kadena Rotation and First Fighter Deployment to Diego Garcia",
    "contentSnippet": "Of the twelve F-15E Strike Eagles that the 336th FS deployed to Kadena Air Base, six were sent to NSF Diego Garcia for three months in response to tensions in the Middle East. The U.S. Air Force’s 336th Expeditionary Fighter Squadron concluded a six-month deployment with 12 F-15E Strike Eagles at Kadena Air Base, Japan, […]",
    "pubDate": "Tue, 18 Nov 2025 22:35:24 +0000",
    "link": "https://theaviationist.com/2025/11/18/f-15e-first-fighter-deployment-diego-garcia/",
    "source": "The Aviationist"
  },
  {
    "title": "Etihad Airways Secures 32 More Airbus Widebodies in Further Fleet Expansion",
    "contentSnippet": "In a further expansion of its widebody fleet, Etihad Airways has ordered 32 more aircraft, comprising A350-1000s, A350F freighters, and A330neos.\nThe post Etihad Airways Secures 32 More Airbus Widebodies in Further Fleet Expansion appeared first on AviationSource News.",
    "pubDate": "Tue, 18 Nov 2025 22:14:48 +0000",
    "link": "https://aviationsourcenews.com/etihad-airways-secures-32-more-airbus-widebodies-in-further-fleet-expansion/",
    "source": "Aviation Source News"
  },
  {
    "title": "Morocco Orders 10 Airbus H225M Helicopters",
    "contentSnippet": "Announced at the Dubai Air Show, 10 H225M helicopters will join the Royal Moroccan Air Force and begin to replace its ageing Puma fleet in the combat search and rescue role. Joining over 360 H225 and H225M helicopters in service worldwide, Morocco’s ten examples of the aircraft will be fitted with Safran Euroflir 410 electro-optical/infrared […]",
    "pubDate": "Tue, 18 Nov 2025 22:03:11 +0000",
    "link": "https://theaviationist.com/2025/11/18/morocco-orders-airbus-h225m/",
    "source": "The Aviationist"
  },
  {
    "title": "Ethiopian Airlines Orders Six Additional Airbus A350-900 Aircraft",
    "contentSnippet": "Ethiopian Airlines, Africa's largest operator of the widebody A350, has signed a firm order for six additional Airbus A350-900 aircraft.\nThe post Ethiopian Airlines Orders Six Additional Airbus A350-900 Aircraft appeared first on AviationSource News.",
    "pubDate": "Tue, 18 Nov 2025 21:56:53 +0000",
    "link": "https://aviationsourcenews.com/ethiopian-airlines-orders-six-additional-airbus-a350-900-aircraft/",
    "source": "Aviation Source News"
  },
  {
    "title": "Air Europa Signs MoU for Up to 40 Airbus A350-900 Aircraft",
    "contentSnippet": "Spanish airline Air Europa has signed a Memorandum of Understanding (MoU) with Airbus for up to 40 A350-900 aircraft, as part of its fleet replacement program.\nThe post Air Europa Signs MoU for Up to 40 Airbus A350-900 Aircraft appeared first on AviationSource News.",
    "pubDate": "Tue, 18 Nov 2025 21:38:53 +0000",
    "link": "https://aviationsourcenews.com/air-europa-signs-mou-for-up-to-40-airbus-a350-900-aircraft/",
    "source": "Aviation Source News"
  },
  {
    "title": "Gulf Air Finalises Order for 15 Boeing 787 Dreamliners at Dubai Airshow",
    "contentSnippet": "Gulf Air has confirmed a major fleet expansion after finalising a firm order for 15 Boeing 787 Dreamliners, with options for a further three aircraft. The deal, announced at the Dubai Airshow, reinforces the Bahrain-based carrier’s long-term strategy to grow its international network and enhance its long-haul operations. The order  [read more]\nThe post Gulf Air Finalises Order for 15 Boeing 787 Dreamliners at Dubai Airshow appeared first on UK Aviation News.",
    "pubDate": "Tue, 18 Nov 2025 21:36:21 +0000",
    "link": "https://ukaviation.news/gulf-air-finalises-order-for-15-boeing-787-dreamliners-at-dubai-airshow/",
    "source": "UK Aviation News"
  },
  {
    "title": "Lockheed Martin Test Flies Gen III TacIRST Sensor",
    "contentSnippet": "The Gen III TacIRST distributed infrared threat‑warning system will equip the F-22 Raptor, with an evaluation planned in 2026. Lockheed Martin has announced the first flight of the latest iteration of its TacIRST sensor, or Gen III TacIRST. The flight was conducted in October by a Rockwell Sabreliner 65 testbed equipped with a pod carrying […]",
    "pubDate": "Tue, 18 Nov 2025 21:26:09 +0000",
    "link": "https://theaviationist.com/2025/11/18/lockheed-martin-test-flies-gen-iii-tacirst-sensor/",
    "source": "The Aviationist"
  },
  {
    "title": "IndiaOne Air Signs LOI for Up to Ten De Havilland Twin Otter 300-G Aircraft at Dubai Airshow",
    "contentSnippet": "IndiaOne Air has taken a major step in its fleet expansion plans after signing a Letter of Intent to acquire up to ten De Havilland Canada Twin Otter Series 300-G aircraft. The announcement was made at the 2025 Dubai Airshow, signalling fresh momentum for the regional airline and strengthening De  [read more]\nThe post IndiaOne Air Signs LOI for Up to Ten De Havilland Twin Otter 300-G Aircraft at Dubai Airshow appeared first on UK Aviation News.",
    "pubDate": "Tue, 18 Nov 2025 18:31:30 +0000",
    "link": "https://ukaviation.news/indiaone-air-signs-loi-for-up-to-ten-de-havilland-twin-otter-300-g-aircraft-at-dubai-airshow/",
    "source": "UK Aviation News"
  },
  {
    "title": "Dubai Airshow: Day 2 is Airbus day with landmark flydubai order",
    "contentSnippet": "Airbus secured a landmark order from flydubai on Day 2 of the Dubai Airshow, when the Dubai World Central-based carrier signed a Memorandum of Understanding (MoU) to purchase 150 A321neos, making it Airbus’ newest customer. HH Sheikh Ahmed bin Saeed Al Maktoum, Chairman of flydubai, signed the MoU agreement with  [read more]\nThe post Dubai Airshow: Day 2 is Airbus day with landmark flydubai order appeared first on UK Aviation News.",
    "pubDate": "Tue, 18 Nov 2025 18:24:02 +0000",
    "link": "https://ukaviation.news/dubai-airshow-day-2-is-airbus-day-with-landmark-flydubai-order/",
    "source": "UK Aviation News"
  },
  {
    "title": "First S-70 Firehawks in Europe Ordered by the Czech Republic",
    "contentSnippet": "Two S-70 Firehawk helicopters will enter service with the Czech Police and become the first examples of the type in European skies, with an option remaining open for a third airframe. After securing an order last month for two new Firehawks for the L.A. County Fire Department, Lockheed Martin, through Polish subsidiary PZL Mielec, has […]",
    "pubDate": "Tue, 18 Nov 2025 18:22:30 +0000",
    "link": "https://theaviationist.com/2025/11/18/s-70-firehawks-ordered-czech-republic/",
    "source": "The Aviationist"
  },
  {
    "title": "Report: 747’s engine advanced to full throttle in fatal Hong Kong runway excursion",
    "pubDate": "Tue, 18 Nov 2025 18:07:01 +0000",
    "contentSnippet": "The Hong Kong Air Accident Investigation Authority (AAIA) has released its preliminary report on the airACT 747 freighter that veered off the runway on 20 October, striking a security vehicle and pushing it into the sea, killing both occupants. The 747 also went through the airport perimeter fence into the sea. The aircraft’s crew of […]\nThe post Report: 747’s engine advanced to full throttle in fatal Hong Kong runway excursion appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/aviation-news/aviation-safety/hong-kong-airact-747-preliminary-report/",
    "source": "FlightRadar24"
  },
  {
    "title": "Saab, Boeing, and BAE Systems Pitch T-7 Red Hawk for UK Fast Jet Trainer",
    "contentSnippet": "Ahead of an expected competition to replace the RAF’s Hawk T2s, Saab, Boeing, and BAE Systems have signed a letter of intent to collaborate on a pilot training system centered on the T-7 Red Hawk. In a press release published on Nov. 18, 2025, the Vice President of Boeing Defense, Space & Security’s Business Development […]",
    "pubDate": "Tue, 18 Nov 2025 16:38:16 +0000",
    "link": "https://theaviationist.com/2025/11/18/saab-boeing-bae-pitch-t7-uk/",
    "source": "The Aviationist"
  },
  {
    "title": "Glasgow and Cardiff gain transatlantic flights as WestJet confirms new routes to Toronto",
    "contentSnippet": "Canadian carrier WestJet has confirmed it is launching flights from Toronto to Cardiff Airport (CWL/EGFF) and Glasgow Airport (GLA/EGPF) for summer 2026. As previously reported, the route will be flown by a Boeing 737 Max 8, operating four times per week to Cardiff on Mondays, Wednesdays, Fridays, and Sundays, departing  [read more]\nThe post Glasgow and Cardiff gain transatlantic flights as WestJet confirms new routes to Toronto appeared first on UK Aviation News.",
    "pubDate": "Tue, 18 Nov 2025 15:00:23 +0000",
    "link": "https://ukaviation.news/glasgow-and-cardiff-gain-transatlantic-flights-as-westjet-confirms-new-routes/",
    "source": "UK Aviation News"
  },
  {
    "title": "How the Joseph Emerson Alaska Airlines Incident Sparked a Movement for Pilot Mental Health Reform",
    "contentSnippet": "Former Alaska Airlines pilot Joseph Emerson was sentenced on 17 November 2025 for his actions that almost led to tragedy aboard a flight in October 2023. The incident has sparked an intense debate on the subject of pilot mental health concerns and the pervasive belief within the industry that silence is better than action. A […]\nThe post How the Joseph Emerson Alaska Airlines Incident Sparked a Movement for Pilot Mental Health Reform appeared first on Avgeekery.",
    "pubDate": "Tue, 18 Nov 2025 14:59:16 +0000",
    "link": "https://avgeekery.com/joseph-emerson-alaska-airlines-pilot-mental-health/",
    "source": "avgeekery"
  },
  {
    "title": "Dubai Airshow 2025 Day 2: Big Orders for Airbus",
    "contentSnippet": "After a quiet Day 1, Airbus opened Day 2 with major orders from Etihad Airways, flydubai, Air Europa and Ethiopian Airlines. Moreover, Boeing also received order from Gulf Air, following a successful Day 1. Etihad Airways Orders Airbus A330neo, A350-1000 and A350F Etihad Airways has placed a firm order for six A330-900s, becoming the newest customer for the A330neo. It is also expanding its A350 fleet with seven additional A350-1000s (now totaling 27) and three more A350F freighters, bringing its A350F commitment to 10. […]\nThe post Dubai Airshow 2025 Day 2: Big Orders for Airbus appeared first on SamChui.com.",
    "pubDate": "Tue, 18 Nov 2025 12:08:53 +0000",
    "link": "https://samchui.com/2025/11/18/dubai-airshow-2025-day-2-big-orders-for-airbus/",
    "source": "Sam Chui"
  },
  {
    "title": "Boeing: Middle East Airlines Enter New Era of Growth as Region's Fleet Will More Than Double by 2044",
    "contentSnippet": "",
    "pubDate": "Tue, 18 Nov 2025 03:13:00 -0500",
    "link": "https://boeing.mediaroom.com/2025-11-18-Boeing-Middle-East-Airlines-Enter-New-Era-of-Growth-as-Regions-Fleet-Will-More-Than-Double-by-2044",
    "source": "Boeing"
  },
  {
    "title": "Perth Airport breaks records for second time in 4 months",
    "contentSnippet": "The airport saw 1.66 million passengers in October, more than the previous record of 1.61 million set in July this year. This includes new all-time records for total domestic passengers at 1.17 million, and interstate passengers at 584,126.",
    "pubDate": "Tue, 18 Nov 2025 02:44:12 +0000",
    "link": "https://australianaviation.com.au/2025/11/perth-airport-breaks-records-for-second-time-in-4-months/",
    "source": "Australian Aviation"
  },
  {
    "title": "PFAS working group established for RAAF Williamtown area",
    "contentSnippet": "Under the per- and poly-fluoroalkyl substances (PFAS) National Coordinating Body, the Williamtown Working Group (WWG) aims to collectivise community and government representatives to support measures that will mitigate the environmental and economic effects of PFAS contamination.",
    "pubDate": "Tue, 18 Nov 2025 01:42:43 +0000",
    "link": "https://australianaviation.com.au/2025/11/pfas-working-group-established-for-raaf-williamtown-area/",
    "source": "Australian Aviation"
  },
  {
    "title": "Sunshine Coast Airport approved for new mixed-use precinct",
    "contentSnippet": "Economic Development Queensland (EDQ) has signed off on the master plan, with permission granted for childcare, medical, shopping and other services in a bid to turn Sunshine Coast into a “modern world-class airport” that will add more to the local economy.",
    "pubDate": "Tue, 18 Nov 2025 00:43:34 +0000",
    "link": "https://australianaviation.com.au/2025/11/sunshine-coast-airport-approved-for-new-mixed-use-precinct/",
    "source": "Australian Aviation"
  },
  {
    "title": "Turkish Air Force C-130 Crashes in Georgia",
    "pubDate": "Tue, 11 Nov 2025 13:08:56 +0000",
    "contentSnippet": "Playback of flight TUAF543. Click image for link to playback. What we know about Turkish Air Force flight TUAF543 A Turkish Air Force Lockheed C-130E Hercules, a military transport class aircraft, has crashed in Georgia, close to the border of neighboring Azerbaijan. The crash has been confirmed by both Turkish and Georgian authorities. The transport […]\nThe post Turkish Air Force C-130 Crashes in Georgia appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/flight-tracking-news/major-incident/turkish-military-aircraft-tuaf543-crashes-in-georgia-november-11th-2025/",
    "source": "FlightRadar24"
  },
  {
    "title": "Boeing and Somon Air Announce Commitment for Up to 14 Airplanes",
    "contentSnippet": "",
    "pubDate": "Thu, 06 Nov 2025 16:41:00 -0500",
    "link": "https://boeing.mediaroom.com/2025-11-06-Boeing-and-Somon-Air-Announce-Commitment-for-Up-to-14-Airplanes",
    "source": "Boeing"
  },
  {
    "title": "Tracking the busiest routes in Europe",
    "pubDate": "Thu, 06 Nov 2025 16:00:28 +0000",
    "contentSnippet": "We have been talking on the blog about the busiest routes in America, starting with South America and then moving on to North America. In South America, it’s São Paulo Congonhas – Rio de Janeiro Santos Dumont, while in North America, the top 1 spot was a close contest between two services, Los Angeles – […]\nThe post Tracking the busiest routes in Europe appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/aviation-news/airline-news/airline-routes/tracking-the-busiest-routes-in-europe/",
    "source": "FlightRadar24"
  },
  {
    "title": "Virgin hails growth and transformation at first AGM after relisting",
    "contentSnippet": "Speaking at the meeting on Friday, CEO Dave Emerson said the airline had seen a successful 2025 financial year, with 20.7 million customers flown and a statutory net profit after tax of $479 million, and that trading for 2026 to date is in line with its expectations.",
    "pubDate": "Sun, 16 Nov 2025 23:40:04 +0000",
    "link": "https://australianaviation.com.au/2025/11/virgin-hails-growth-and-transformation-at-first-agm-after-relisting/",
    "source": "Australian Aviation"
  },
  {
    "title": "Fly the Friendly Skies: When United Air Lines Entered the Jet Age",
    "contentSnippet": "United Air Lines officially entered the jet age on 18 September 1959, when Flight 800—a Douglas DC-8—departed San Francisco for New York at 0830 local time. It would have been the first scheduled DC-8 flight in the world had Delta Air Lines not inaugurated its own DC-8 service from New York to Atlanta that same […]\nThe post Fly the Friendly Skies: When United Air Lines Entered the Jet Age appeared first on Avgeekery.",
    "pubDate": "Sun, 16 Nov 2025 23:00:00 +0000",
    "link": "https://avgeekery.com/when-united-air-lines-entered-the-jet-age/",
    "source": "avgeekery"
  },
  {
    "title": "Loganair steps in to run Jersey services after Blue Islands collapse",
    "contentSnippet": "Leading regional airline Loganair (LM/LOG) has confirmed it plans to step in and replace all Blue Islands routes that previosuly operated from Jersey. Glasgow-based Loganair, along with Aurigny Air Services, has already stepped in to provide contigency flights ro rescue passengers displaced by the sudden collapse of Blue Islands but  [read more]\nThe post Loganair steps in to run Jersey services after Blue Islands collapse appeared first on UK Aviation News.",
    "pubDate": "Sun, 16 Nov 2025 17:21:00 +0000",
    "link": "https://ukaviation.news/loganair-steps-in-to-run-jersey-services-after-blue-islands-collapse/",
    "source": "UK Aviation News"
  },
  {
    "title": "Airbus Signs Orders Saab’s Arexis EW Suite for Eurofighter EK",
    "contentSnippet": "The Arexis Electronic Warfare suite will replace the Eurofighter Typhoon’s wingtip pods, part of the fighter’s Defensive Aid Sub-System (DASS). Germany’s Eurofighter EK program moved forward on Nov. 14, 2025, with a new order for one of its main modifications. In fact, Swedish defense major Saab announced a second order from Airbus regarding its Arexis […]",
    "pubDate": "Sun, 16 Nov 2025 14:59:28 +0000",
    "link": "https://theaviationist.com/2025/11/16/airbus-orders-saabs-arexis-eurofighter-ek/",
    "source": "The Aviationist"
  },
  {
    "title": "Colombia Signs Gripen E/F Contract",
    "contentSnippet": "Colombia will get 15 Gripen E single-seater and two Gripen F twin-seater fighters, to be delivered between 2026 and 2032. Saab announced it has signed the contract with Colombia for the acquisition of the Gripen E/F, after the selection in April 2025. The contract, signed on Nov. 15, 2025, includes 15 Gripen E single-seater and […]",
    "pubDate": "Sun, 16 Nov 2025 14:08:55 +0000",
    "link": "https://theaviationist.com/2025/11/16/colombia-signs-gripen-e-f-contract/",
    "source": "The Aviationist"
  },
  {
    "title": "Jack Harter Helicopters Became A Legendary Name in Hawaii Tourism",
    "contentSnippet": "Helicopters are often known for short-distance cargo hauls and first responder relief. However, some companies like Jack Harter Helicopters have managed to strike gold by offering tours via helicopter across exotic locations. One such company was Jack Harter Helicopters that served Kauai long before man walked on the moon. Jack Harter realized he could make […]\nThe post Jack Harter Helicopters Became A Legendary Name in Hawaii Tourism appeared first on Avgeekery.",
    "pubDate": "Sun, 16 Nov 2025 13:44:46 +0000",
    "link": "https://avgeekery.com/jack-harter-helicopters-hawaii-tourism/",
    "source": "avgeekery"
  },
  {
    "title": "Gripen E Cleared for Refueling by KC-390 Millenium",
    "contentSnippet": "The certification, carried out with two Brazilian Air Force Gripen Es, will greatly expand the capabilities of the jet and give an added capability to air forces that operate both aircraft types. Embraer, the Brazilian Air Force (Força Aérea Brasileira – FAB) and Saab announced on Nov. 14, 2025 that they certified the F-39 Gripen […]",
    "pubDate": "Sat, 15 Nov 2025 18:46:11 +0000",
    "link": "https://theaviationist.com/2025/11/15/gripen-e-cleared-for-refueling-by-kc-390-millenium/",
    "source": "The Aviationist"
  },
  {
    "title": "Exercise Falcon Strike 2025 Concludes in Italy",
    "contentSnippet": "For two weeks, Italy hosted 4th and 5th gen assets, joint capabilities, and naval components in a training scenario that reflects today’s operational challenges. The Italian Air Force announced the completion of Exercise Falcon Strike 2025 at Amendola Air Base, home of the 32° Stormo and one of Europe’s main hubs for 5th generation fighter […]",
    "pubDate": "Sat, 15 Nov 2025 15:23:49 +0000",
    "link": "https://theaviationist.com/2025/11/15/exercise-falcon-strike-2025/",
    "source": "The Aviationist"
  },
  {
    "title": "Blue Islands: Second UK regional airline collapses this month",
    "contentSnippet": "Channel Islands-based regional carrier Blue Islands (SI/BGI) has collapsed into administration making it the second UK regional airline to fail this month following the collapse of Eastern Airways. Blue Islands operated scheduled and charter flights form the Channel Islands to mainland Britain, often for other operators using a fleet of  [read more]\nThe post Blue Islands: Second UK regional airline collapses this month appeared first on UK Aviation News.",
    "pubDate": "Sat, 15 Nov 2025 10:10:01 +0000",
    "link": "https://ukaviation.news/blue-islands-second-uk-regional-airline-collapses-this-month/",
    "source": "UK Aviation News"
  },
  {
    "title": "FAA expands emergency airworthiness directive to DC-10s",
    "pubDate": "Sat, 15 Nov 2025 04:23:08 +0000",
    "contentSnippet": "The FAA has expanded its emergency airworthiness directive regarding MD-11 engine pylons to include predecessor DC-10 aircraft. The FAA finds these aircraft are subject to the the same unsafe condition as exists on the MD-11 and MD-11(F). The engine-pylon structure of the Model MD-11 and MD-11F airplanes is similar in design to that of the […]\nThe post FAA expands emergency airworthiness directive to DC-10s appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/aviation-news/aviation-safety/faa-expands-emergency-airworthiness-directive-to-dc-10s/",
    "source": "FlightRadar24"
  },
  {
    "title": "Boeing recommends MD-11 operators suspend flights",
    "pubDate": "Sat, 08 Nov 2025 15:51:45 +0000",
    "contentSnippet": "Boeing has recommended operators of the MD-11 “suspend flight operations while additional engineering analysis is performed.” This follows findings during the initial investigation of the crash of UPS flight 2976 on Tuesday, 4 November. Boeing says it is making its recommendation “in an abundance of caution.” Boeing assumed responsibility for the MD-11 program after its […]\nThe post Boeing recommends MD-11 operators suspend flights appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/aviation-news/aviation-safety/boeing-recommends-md-11-operators-suspend-flights/",
    "source": "FlightRadar24"
  },
  {
    "title": "GeminiJets Airplane Models – August 25 New Release + Discounts",
    "contentSnippet": "I have been collecting GeminiJets since they launched 20 years ago! During difficult times, I have found that model collecting can help alleviate some of the stress. Video Special Offer This is a sponsored post to showcase the latest GeminiJets airplane model releases. Hope you find something you like. To purchase GeminiJets, go to DiecastJets.com and use code SAMCHUI at checkout for up to 25% off and free shipping in the US. August 2025 1:400 New Release August 2025 1:200 New Release Video This is a sponsored post […]\nThe post GeminiJets Airplane Models – August 25 New Release + Discounts appeared first on SamChui.com.",
    "pubDate": "Mon, 22 Sep 2025 13:45:40 +0000",
    "link": "https://samchui.com/2025/09/22/geminijets-airplane-models-august-25-new-release-discounts/",
    "source": "Sam Chui"
  },
  {
    "title": "ACT Boeing 747 Freighter Crashes on Landing in Hong Kong",
    "contentSnippet": "On October 20, 2025, a Boeing 747-400 freighter operated by ACT Airlines on behalf of Emirates crashed into the sea after veering off the runway during landing at Hong Kong International Airport (HKG). The Boeing 747-400F, registered TC-ACF, was operating flight EK9788 from Dubai Al Maktoum International Airport (DWC) to Hong Kong, with four crew members onboard. The aircraft departed Dubai on the evening of October 19 and was due to arrive in Hong Kong early the next morning. At […]\nThe post ACT Boeing 747 Freighter Crashes on Landing in Hong Kong appeared first on SamChui.com.",
    "pubDate": "Mon, 20 Oct 2025 08:26:58 +0000",
    "link": "https://samchui.com/2025/10/20/act-cargo-boeing-747-freighter-crashes-on-landing-in-hong-kong/",
    "source": "Sam Chui"
  },
  {
    "title": "Air Côte d’Ivoire Orders Four New Embraer E175 Aircraft for Regional Fleet",
    "contentSnippet": "National carrier Air Côte d’Ivoire will add an order of four new Embraer E175 jets to its regional fleet, as it steadily replaces its older turboprop aircraft.\nThe post Air Côte d’Ivoire Orders Four New Embraer E175 Aircraft for Regional Fleet appeared first on AviationSource News.",
    "pubDate": "Mon, 17 Nov 2025 22:56:15 +0000",
    "link": "https://aviationsourcenews.com/air-cote-divoire-orders-four-new-embraer-e175-aircraft-for-regional-fleet/",
    "source": "Aviation Source News"
  },
  {
    "title": "Helvetic Airways Boosts Embraer Fleet With up to Eight New E195-E2 Jets",
    "contentSnippet": "Swiss regional carrier Helvetic Airways will boost its present Embraer fleet, placing a firm order for 3 E195-E2 jets with options for 5 additional aircraft.\nThe post Helvetic Airways Boosts Embraer Fleet With up to Eight New E195-E2 Jets appeared first on AviationSource News.",
    "pubDate": "Mon, 17 Nov 2025 22:37:57 +0000",
    "link": "https://aviationsourcenews.com/helvetic-airways-boosts-embraer-fleet-with-up-to-eight-new-e195-e2-jets/",
    "source": "Aviation Source News"
  },
  {
    "title": "Air Senegal Orders Nine Boeing 737 MAX 8 Aircraft for Major Fleet Expansion",
    "contentSnippet": "West African carrier Air Senegal has placed a firm order for nine Boeing 737 MAX 8 aircraft as part of its regional and international expansion.\nThe post Air Senegal Orders Nine Boeing 737 MAX 8 Aircraft for Major Fleet Expansion appeared first on AviationSource News.",
    "pubDate": "Mon, 17 Nov 2025 22:20:02 +0000",
    "link": "https://aviationsourcenews.com/air-senegal-orders-nine-boeing-737-max-8-aircraft-for-major-fleet-expansion/",
    "source": "Aviation Source News"
  },
  {
    "title": "Lockheed Martin Unveils Sniper Networked Targeting Pod",
    "contentSnippet": "The Sniper NTP integrates a multi-datalink, multi-processor Hybrid Base Station (HBS) with the existing Sniper ATP, turning it into an airborne communications and edge-computing node. Lockheed Martin has unveiled the latest evolution of its proven Sniper targeting pod, called the Sniper Networked Targeting Pod (NTP), whose development was announced last year. By integrating a multi-datalink, […]",
    "pubDate": "Mon, 17 Nov 2025 22:19:46 +0000",
    "link": "https://theaviationist.com/2025/11/17/lockheed-martin-unveils-sniper-networked-targeting-pod/",
    "source": "The Aviationist"
  },
  {
    "title": "Ukrainian Mirage 2000 Sports Kill Markings of Russian Cruise Missiles",
    "contentSnippet": "A Ukrainian Mirage 2000-5F was shown with six Kh-101 ALCM kill markings in a rare close-up look at the French-supplied jet delivered earlier this year. A Ukrainian Air Force (UKrAF) French-made Mirage 2000-5F has been spotted with kill marks of what resemble Russian Kh-101 (X-101) long-range ALCM (Air-Launched Cruise Missile) in a Nov. 17, 2025, […]",
    "pubDate": "Mon, 17 Nov 2025 21:14:32 +0000",
    "link": "https://theaviationist.com/2025/11/17/ukrainian-mirage-2000-kill-markings/",
    "source": "The Aviationist"
  },
  {
    "title": "The Last DC-8: Samaritan’s Purse Retires America’s Final Flying DC-8 as New 767 Joins Fleet",
    "contentSnippet": "The retirement of the last DC-8 marks the end of US DC-8 operations and the beginning of a new chapter for Samaritan’s Purse as it expands its capabilities with a modern, long-range freighter. Samaritan’s Purse marked the end of an aviation era on Friday, 14 November 2025, during a combined retirement and dedication ceremony at […]\nThe post The Last DC-8: Samaritan’s Purse Retires America’s Final Flying DC-8 as New 767 Joins Fleet appeared first on Avgeekery.",
    "pubDate": "Mon, 17 Nov 2025 17:05:53 +0000",
    "link": "https://avgeekery.com/the-last-dc-8-samaritans-purse/",
    "source": "avgeekery"
  },
  {
    "title": "F-22 Raptor Takes Control of MQ-20 Avenger During Test",
    "contentSnippet": "GA-ASI and L3Harris joined forces to demonstrate Crewed-Uncrewed Teaming of an F-22 and MQ-20 using the new BANSHEE datalinks and Pantera radios. General Atomics Aeronautical Systems has announced that, in collaboration with Lockheed Martin and L3Harris Technologies, it has conducted a successful Crewed-Uncrewed Teaming demonstration using an F-22 Raptor and an MQ-20 Avenger drone. Although […]",
    "pubDate": "Mon, 17 Nov 2025 16:35:48 +0000",
    "link": "https://theaviationist.com/2025/11/17/f-22-raptor-controls-mq-20-avenger/",
    "source": "The Aviationist"
  },
  {
    "title": "Boeing gets 20 737 Max commitments from African airlines including a first time Max customer",
    "contentSnippet": "On the first day of the Dubai Airshow, Seattle-based OEM Boeing has secured commitments for 20 Boeing 737 Max airlines from two african airlines. Ethiopian Airlines was first to secure a deal with an order for 11 Boeing 737 Max 8 aircraft which be used to expand its African and  [read more]\nThe post Boeing gets 20 737 Max commitments from African airlines including a first time Max customer appeared first on UK Aviation News.",
    "pubDate": "Mon, 17 Nov 2025 16:05:22 +0000",
    "link": "https://ukaviation.news/boeing-gets-20-737-max-commitments-from-african-airlines-including-a-first-time-max-customer/",
    "source": "UK Aviation News"
  },
  {
    "title": "Emirates orders 65 more Boeing 777X",
    "contentSnippet": "Dubai-based Emirates has ordered 65 additional Boeing 777X aircraft from Seattle-based OEM, Boeing at the Dubai Airshow. The order is for the 777-9, which is currently the only passenger variant, and brings the total number of commitments for the type by the launch customer to 270. Emirates is already the  [read more]\nThe post Emirates orders 65 more Boeing 777X appeared first on UK Aviation News.",
    "pubDate": "Mon, 17 Nov 2025 15:56:28 +0000",
    "link": "https://ukaviation.news/emirates-orders-65-more-boeing-777x/",
    "source": "UK Aviation News"
  },
  {
    "title": "GA-ASI and Saab Will Test MQ-9B AEW&C Variant in the Summer of 2026",
    "contentSnippet": "The demo will be conducted at GA-ASI’s Desert Horizon facility in California using a company-owned MQ-9B equipped with AEW&C systems supplied by Saab. General Atomics Aeronautical Systems (GA-ASI) has announced that it will test the new podded Airborne Early Warning and Control (AEW&C) capability for the MQ-9B Remotely Piloted Aircraft (RPA) in collaboration with Saab […]",
    "pubDate": "Mon, 17 Nov 2025 15:31:35 +0000",
    "link": "https://theaviationist.com/2025/11/17/mq-9b-aewc-test-summer-2026/",
    "source": "The Aviationist"
  },
  {
    "title": "WestJet set to announce new routes from Toronto including Cardiff and Glasgow",
    "contentSnippet": "UPDATE: Glasgow and Cardiff gain transatlantic flights as WestJet confirms new routes to Toronto Canadian airline WestJet is set to announce a raft of new destinations from Toronto, Canada, including two new UK routes to Cardiff Airport (CWL/EGFF) and Glasgow (GLA/EGPF) for Summer 2026. Details of the new routes and  [read more]\nThe post WestJet set to announce new routes from Toronto including Cardiff and Glasgow appeared first on UK Aviation News.",
    "pubDate": "Mon, 17 Nov 2025 14:31:47 +0000",
    "link": "https://ukaviation.news/westjet-set-to-announce-new-routes-from-toronto-including-cardiff-and-glasgow/",
    "source": "UK Aviation News"
  },
  {
    "title": "Ukraine and France Sign Deal for Potential Supply of 100 Rafale Fighters",
    "contentSnippet": "Volodymyr Zelenskyy and Emmanuel Macron together signed a letter of intent that sets out the groundwork for a Ukrainian buy of up to 100 Dassault Rafale jets, more SAMP/T batteries, guided weapons, and UAVs. Standing together at Vélizy-Villacoublay Air Base, near Paris, the respective Presidents of Ukraine and France embraced with a hug after signing […]",
    "pubDate": "Mon, 17 Nov 2025 13:49:37 +0000",
    "link": "https://theaviationist.com/2025/11/17/ukraine-and-france-sign-loi-rafale/",
    "source": "The Aviationist"
  },
  {
    "title": "Dubai Airshow 2025 Day 1: Big Orders for Boeing",
    "contentSnippet": "Boeing has opened the Dubai Airshow 2025 on a strong note with Emirates placing an order for 65 Boeing 777X aircraft. This was followed by commitments from Ethiopian Airlines and Air Senegal for additional MAX jets. Embraer has also received orders from Helvetic Airways and Air Côte d’Ivoire on the first day of the bi-annual Airshow. Here is a recap of orders and announcements from the first day of the Dubai Airshow. Emirates Orders 65 Boeing 777X Boeing has kicked off the […]\nThe post Dubai Airshow 2025 Day 1: Big Orders for Boeing appeared first on SamChui.com.",
    "pubDate": "Mon, 17 Nov 2025 13:40:06 +0000",
    "link": "https://samchui.com/2025/11/17/dubai-airshow-2025-day-1-big-order-for-boeing-from-emirates/",
    "source": "Sam Chui"
  },
  {
    "title": "Air Senegal Commits to First Boeing 737 MAX Order",
    "contentSnippet": "",
    "pubDate": "Mon, 17 Nov 2025 08:02:00 -0500",
    "link": "https://boeing.mediaroom.com/2025-11-17-Air-Senegal-Commits-to-First-Boeing-737-MAX-Order",
    "source": "Boeing"
  },
  {
    "title": "Ethiopian Airlines Commits to Order 11 Boeing 737 MAX Airplanes",
    "contentSnippet": "",
    "pubDate": "Mon, 17 Nov 2025 06:00:00 -0500",
    "link": "https://boeing.mediaroom.com/2025-11-17-Ethiopian-Airlines-Commits-to-Order-11-Boeing-737-MAX-Airplanes",
    "source": "Boeing"
  },
  {
    "title": "Exclusive: Malaysia Airlines to go all-A330neo into Australia",
    "contentSnippet": "Speaking exclusively to Australian Aviation, Malaysia Airlines’ chief commercial officer, Dersenish Aresandiran, said the carrier wants to improve the cabin experience for Australian passengers travelling to and from Kuala Lumpur.",
    "pubDate": "Mon, 17 Nov 2025 05:52:08 +0000",
    "link": "https://australianaviation.com.au/2025/11/exclusive-malaysia-airlines-to-go-all-a330neo-into-australia/",
    "source": "Australian Aviation"
  },
  {
    "title": "Singapore Air Force F-16C jets exercise in WA",
    "contentSnippet": "From September 25 to October 10, the Extended Fighter Detachment gave RSAF personnel the opportunity to conduct a range of training activities, using the vast and open airspace available in the state.",
    "pubDate": "Mon, 17 Nov 2025 05:28:06 +0000",
    "link": "https://australianaviation.com.au/2025/11/singapore-air-force-f-16c-jets-exercise-in-wa/",
    "source": "Australian Aviation"
  },
  {
    "title": "Qantas A321XLRs come to Brisbane",
    "contentSnippet": "The Flying Kangaroo’s new domestic aircraft, which will replace its older 737-800s, are commencing Brisbane services as of Monday 17 November. Initially operating one return service per day, Qantas expects the A321XLR to expand its presence in Brisbane as more of the aircraft arrive.",
    "pubDate": "Mon, 17 Nov 2025 04:22:18 +0000",
    "link": "https://australianaviation.com.au/2025/11/qantas-a321xlrs-come-to-brisbane/",
    "source": "Australian Aviation"
  },
  {
    "title": "Melbourne tests new international bag handling system",
    "contentSnippet": "The new $500 million baggage system, slated to be up and running in early 2026, will use totes, electronic sorting, and an early bag store capable of holding around 1,400 pieces of luggage at a time to increase capacity and enable real-time bag tracking from the moment of check-in.",
    "pubDate": "Mon, 17 Nov 2025 03:30:50 +0000",
    "link": "https://australianaviation.com.au/2025/11/melbourne-tests-new-international-bag-handling-system/",
    "source": "Australian Aviation"
  },
  {
    "title": "Air New Zealand to battle Qantas, Jetstar on Brisbane-Queenstown",
    "contentSnippet": "Operating over the winter and spring months from 22 June to 23 October 2026, the service will fly three times per week on A320neo aircraft, offering a total of 17,560 additional seats between Queensland and the South Island.",
    "pubDate": "Mon, 17 Nov 2025 02:19:19 +0000",
    "link": "https://australianaviation.com.au/2025/11/air-new-zealand-to-battle-jetstar-with-brisbane-queenstown-flights/",
    "source": "Australian Aviation"
  },
  {
    "title": "American Airlines 100th Anniversary Retro Jet Takes Flight",
    "contentSnippet": "Flagship DFW American Airlines 777 retro jet. Photo: Dylan Phelps - Centerline Images\nThe post American Airlines 100th Anniversary Retro Jet Takes Flight appeared first on Avgeekery.",
    "pubDate": "Mon, 17 Nov 2025 00:04:52 +0000",
    "link": "https://avgeekery.com/american-airlines-100th-anniversary-retro-jet-takes-flight/",
    "source": "avgeekery"
  },
  {
    "title": "Svalbard Longyearbyen: The Gateway to the Arctic",
    "pubDate": "Mon, 10 Nov 2025 07:59:41 +0000",
    "contentSnippet": "At nearly 78° north, Svalbard Airport, Longyearbyen (LYR), stands as one of aviation’s true extremes. Situated just a few hundred kilometers from the North Pole, it’s the world’s northernmost airport with scheduled commercial flights. Tourists come for breathtaking polar landscapes, scientists conduct research in the barren environment. And the polar bears? Well, they mostly wander […]\nThe post Svalbard Longyearbyen: The Gateway to the Arctic appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/aviation-news/airport-news/svalbard-longyearbyen-airport/",
    "source": "FlightRadar24"
  },
  {
    "title": "Low and Loud: Epic Air Force One Flyover Wows 65,000 NFL Fans in Washington",
    "contentSnippet": "A spectacular Air Force One flyover above Northwest Stadium in Landover, Maryland, thrilled 65,000 fans as the presidential jet soared over the Washington Commanders game on 9 November 2025. Shortly after the game began, the iconic blue-and-white Boeing 747 roared low overhead, rattling the bleachers and stopping play as everyone craned their necks toward the […]\nThe post Low and Loud: Epic Air Force One Flyover Wows 65,000 NFL Fans in Washington appeared first on Avgeekery.",
    "pubDate": "Mon, 10 Nov 2025 02:18:22 +0000",
    "link": "https://avgeekery.com/air-force-one-flyover-nfl-commanders-lions/",
    "source": "avgeekery"
  },
  {
    "title": "WestJet Boeing 737 Suffers Landing Gear Collapse in Sint Maarten",
    "contentSnippet": "On September 7, 2025, a WestJet Boeing 737 suffered a landing gear collapse while landing at Sint Maarten’s Princess Juliana International Airport (SXM), prompting an emergency evacuation of the aircraft. The Boeing 737-800 with registration C-GWSR was operating flight WS2276 from Toronto Pearson (YYZ) to Sint Maarten. After 4 hours and 46 minutes of flight, it touched down on runway 10 at 13:28 local time (17:28 UTC) when the right main landing gear collapsed. According to reports, the crew managed […]\nThe post WestJet Boeing 737 Suffers Landing Gear Collapse in Sint Maarten appeared first on SamChui.com.",
    "pubDate": "Mon, 08 Sep 2025 00:41:48 +0000",
    "link": "https://samchui.com/2025/09/08/westjet-boeing-737-suffers-landing-gear-collapse/",
    "source": "Sam Chui"
  },
  {
    "title": "GeminiJets Airplane Models – September 25 New Release + Discounts",
    "contentSnippet": "I have been collecting GeminiJets since they launched 20 years ago! During difficult times, I have found that model collecting can help alleviate some of the stress. Video Special Offer This is a sponsored post to showcase the latest GeminiJets airplane model releases. Hope you find something you like. To purchase GeminiJets, go to DiecastJets.com and use code SAMCHUI at checkout for up to 25% off and free shipping in the US. September 2025 1:400 New Release September 2025 1:200 New Release Video This is a sponsored post […]\nThe post GeminiJets Airplane Models – September 25 New Release + Discounts appeared first on SamChui.com.",
    "pubDate": "Fri, 17 Oct 2025 08:36:45 +0000",
    "link": "https://samchui.com/2025/10/17/geminijets-airplane-models-september-25-new-release-discounts/",
    "source": "Sam Chui"
  },
  {
    "title": "ANA shelves Air Japan",
    "pubDate": "Fri, 14 Nov 2025 19:30:30 +0000",
    "contentSnippet": "Air Japan (NQ/AJX), a low-cost airline founded by the All Nippon Airways Group in 2022, will cease services in 2026. The carrier is based in the Japanese capital, more precisely at Narita International Airport, and currently operates Boeing 787-8 Dreamliner aircraft. Launch On March 8th, 2022, ANA Holdings published a press release on its website […]\nThe post ANA shelves Air Japan appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/aviation-news/airline-news/ana-shelves-air-japan/",
    "source": "FlightRadar24"
  },
  {
    "title": "USAF B-1B Lancer Trains with IAF Su-30 and Mirages in Bilateral Exercise",
    "contentSnippet": "A B-1B took part in a four-day exercise with the Indian Air Force, marking the first return to the country since the participation to the Cope India 2023 exercise. A single U.S. Air Force B-1B Lancer bomber participated in a four-day exercise with the Indian Air Force, which the service said ran from Nov. 10 […]",
    "pubDate": "Fri, 14 Nov 2025 14:58:22 +0000",
    "link": "https://theaviationist.com/2025/11/14/usaf-b-1b-lancer-india-exercise/",
    "source": "The Aviationist"
  },
  {
    "title": "AIr China Cargo becomes the newest customer of the Airbus A350F",
    "contentSnippet": "Air China Cargo, has become the latest customer for the much-anticipated Airbus A350 freighter, the A350F. The cargo specialist, which is a subsidiuary of Chinese flag carrier, Air China, has signed a purchase agreeement for six A350F’s taking the total known commitments for the ‘yet to be certified’ freighter to  [read more]\nThe post AIr China Cargo becomes the newest customer of the Airbus A350F appeared first on UK Aviation News.",
    "pubDate": "Fri, 14 Nov 2025 14:46:59 +0000",
    "link": "https://ukaviation.news/air-china-cargo-becomes-the-newest-customer-of-the-airbus-a350f/",
    "source": "UK Aviation News"
  },
  {
    "title": "AvTalk Episode 345: Reasonable people",
    "pubDate": "Fri, 14 Nov 2025 12:38:42 +0000",
    "contentSnippet": "On this week’s episode of AvTalk, US airspace held together—barely—with hastily announced cuts to flights at major airports going into effect and air traffic controller staffing triggers peaking on Sunday. We also discuss comments from President Trump (09:23-15:28) on controller staffing during the shutdown and what effect that sentiment might have on controllers in the […]\nThe post AvTalk Episode 345: Reasonable people appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/avtalk-podcast/avtalk-345/",
    "source": "FlightRadar24"
  },
  {
    "title": "GeminiJets Airplane Models – October 25 New Release + Discounts",
    "contentSnippet": "I have been collecting GeminiJets since they launched 20 years ago! During difficult times, I have found that model collecting can help alleviate some of the stress. Video Special Offer This is a sponsored post to showcase the latest GeminiJets airplane model releases. Hope you find something you like. To purchase GeminiJets, go to DiecastJets.com and use code SAMCHUI at checkout for up to 25% off and free shipping in the US. October 2025 1:400 New Release October 2025 1:200 New Release Video This is a sponsored post […]\nThe post GeminiJets Airplane Models – October 25 New Release + Discounts appeared first on SamChui.com.",
    "pubDate": "Fri, 14 Nov 2025 07:48:06 +0000",
    "link": "https://samchui.com/2025/11/14/geminijets-airplane-models-october-25-new-release-discounts/",
    "source": "Sam Chui"
  },
  {
    "title": "Airservices staffing levels on the right track, says CEO",
    "contentSnippet": "Speaking at The Australian Financial Review’s Infrastructure Summit in Sydney, Rob Sharp said Australia’s air traffic management provider, which has been actively recruiting over the past few years, is in better shape in terms of workforce than Europe and the US.",
    "pubDate": "Fri, 14 Nov 2025 04:56:24 +0000",
    "link": "https://australianaviation.com.au/2025/11/airservices-staffing-levels-on-the-right-track-says-ceo/",
    "source": "Australian Aviation"
  },
  {
    "title": "AvTalk Episode 344: UPS flight 2976",
    "pubDate": "Fri, 07 Nov 2025 12:32:11 +0000",
    "contentSnippet": "On this week’s episode of AvTalk, we discuss what we know so far about the crash of UPS Airlines flight 2976 in Louisville. To manage some of the burden on air traffic controllers during the government shutdown, the US is telling airlines to cancel up to 10% of their flights in major markets. Embraer says […]\nThe post AvTalk Episode 344: UPS flight 2976 appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/avtalk-podcast/avtalk-344/",
    "source": "FlightRadar24"
  },
  {
    "title": "US orders airlines to cancel 10% of flights at 40 “High Impact” airports",
    "pubDate": "Fri, 07 Nov 2025 04:43:43 +0000",
    "contentSnippet": "Update 16 November — FAA rescinds all restrictions effective 17 November 06:00 ET Citing a continued decrease in staffing triggers across the National Airspace System, the FAA is rescinding its order mandating cancellations at 40 major airports around the US. Also lifted are restrictions on business and private aviation at certain airports.  Update 14 November — FAA […]\nThe post US orders airlines to cancel 10% of flights at 40 “High Impact” airports appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/aviation-news/airport-news/us-orders-airlines-to-cancel-10-of-flights-at-40-high-impact-airports/",
    "source": "FlightRadar24"
  },
  {
    "title": "Air Astana, Somon Air, and Uzbekistan Airways Order New Boeing Jets",
    "contentSnippet": "Boeing has announced new aircraft orders from three Central Asian airlines, Air Astana, Somon Air, and Uzbekistan Airways.  All three announcements were made during the C5+1 Summit, commemorating the 10th anniversary of the diplomatic platform linking the United States with the five Central Asian nations. Uzbekistan Airways Expands 787 Dreamliner Fleet Uzbekistan Airways has firmed an order for eight Boeing 787 Dreamliners, increasing its total order book for the type to 22 aircraft. The signing ceremony took place at the […]\nThe post Air Astana, Somon Air, and Uzbekistan Airways Order New Boeing Jets appeared first on SamChui.com.",
    "pubDate": "Fri, 07 Nov 2025 04:16:39 +0000",
    "link": "https://samchui.com/2025/11/07/air-astana-somon-air-and-uzbekistan-airways-order-new-boeing-jets/",
    "source": "Sam Chui"
  }
]