[
  {
    "title": "Emirates A380 Returns to London with Landing Gear Problem",
    "contentSnippet": "Emirates flight EK2, an A380-800 departing for Dubai, made a return to London (LHR) after experiencing a landing gear problem after takeoff on 31 December.\nThe post Emirates A380 Returns to London with Landing Gear Problem appeared first on AviationSource News.",
    "pubDate": "Wed, 31 Dec 2025 22:04:10 +0000",
    "link": "https://aviationsourcenews.com/emirates-a380-returns-to-london-with-landing-gear-problem/",
    "source": "Aviation Source News"
  },
  {
    "title": "Australian Aviation’s top 5 reads for 2025",
    "contentSnippet": "As 2026 dawns, Australian Aviation takes a look back at 2025 and counts down our top five most-read stories.",
    "pubDate": "Wed, 31 Dec 2025 22:00:37 +0000",
    "link": "https://australianaviation.com.au/2026/01/australian-aviations-top-5-reads-for-2025/",
    "source": "Australian Aviation"
  },
  {
    "title": "Saab Receives French Contract for two GlobalEye AEW&C Aircraft",
    "contentSnippet": "The French government is acquiring two Saab GlobalEye platforms, with an option for two more, to maintain a credible and deterrent airborne radar capability. Saab announced on Dec. 30, 2025, that it has been formally contracted by the French Direction Générale de l’Armement (Directorate General of Armaments – DGA) for the procurement of two GlobalEye […]",
    "pubDate": "Wed, 31 Dec 2025 16:24:31 +0000",
    "link": "https://theaviationist.com/2025/12/31/france-globaeye-contract/",
    "source": "The Aviationist"
  },
  {
    "title": "China Conducts “Justice Mission 2025” Exercise Around Taiwan",
    "contentSnippet": "China’s PLA launched “Justice Mission 2025” snap drills around Taiwan, combining blockade simulations, live-fire drills, and strategic messaging aimed at Taipei and Washington. China has launched a large-scale, snap military exercise around Taiwan, dubbed “Justice Mission 2025,” on Dec. 29, 2025. The People’s Liberation Army (PLA) deployed air, naval, rocket, and coast guard forces in […]",
    "pubDate": "Wed, 31 Dec 2025 16:08:31 +0000",
    "link": "https://theaviationist.com/2025/12/31/china-justice-mission-exercise-around-taiwan/",
    "source": "The Aviationist"
  },
  {
    "title": "December routes roundup: Finnair adds Australia to its route map",
    "pubDate": "Wed, 31 Dec 2025 15:45:24 +0000",
    "contentSnippet": "Finnair has announced the launch of its first regular route to Australia, marking its first-ever entry into Oceania, a market currently served by only two European airlines. Flights will begin on October 26th, 2026, and will operate daily with Airbus A350-900 aircraft configured for 278 passengers, flying the Helsinki-Bangkok-Melbourne route and vice versa. In addition […]\nThe post December routes roundup: Finnair adds Australia to its route map appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/aviation-news/airline-news/airline-routes/december-routes-roundup-finnair-adds-australia-to-its-route-map/",
    "source": "FlightRadar24"
  },
  {
    "title": "ALSIM Supports the Expansion of Aviation in Australia",
    "contentSnippet": "The strongest indicator of confidence in the largest expansion of Australian aviation in 25 years is the ongoing upgrade of the national airport infrastructure, led by the planned opening of Western Sydney International Airport in late 2026. New runways in Perth and Melbourne will be complemented by additional terminals at those airfields, as well as",
    "pubDate": "Wed, 31 Dec 2025 13:00:20 +0000",
    "link": "https://australianaviation.com.au/2026/01/alsim-supports-the-expansion-of-aviation-in-australia/",
    "source": "Australian Aviation"
  },
  {
    "title": "A Year in Review: 12 Months That Shaped UK Aviation and Aerospace",
    "contentSnippet": "The past 12 months have marked a decisive period for the UK’s aviation and aerospace sectors. What began as cautious optimism has evolved into renewed confidence, record demand and long-term strategic investment. Airlines have rebuilt networks, manufacturers have increased output, and sustainability has moved from aspiration to action. Below is  [read more]\nThe post A Year in Review: 12 Months That Shaped UK Aviation and Aerospace appeared first on UK Aviation News.",
    "pubDate": "Wed, 31 Dec 2025 09:00:00 +0000",
    "link": "https://ukaviation.news/a-year-in-review-12-months-that-shaped-uk-aviation-and-aerospace/",
    "source": "UK Aviation News"
  },
  {
    "title": "How Commercial Airlines Navigated Turbulence and Charted a Path Forward in 2025",
    "contentSnippet": "As 2025 draws to a close, we examine the highpoints and the persistent headwinds faced by the commercial airline sector through the year.\nThe post How Commercial Airlines Navigated Turbulence and Charted a Path Forward in 2025 appeared first on AviationSource News.",
    "pubDate": "Wed, 31 Dec 2025 00:06:30 +0000",
    "link": "https://aviationsourcenews.com/how-commercial-airlines-navigated-turbulence-and-charted-a-path-forward-in-2025/",
    "source": "Aviation Source News"
  },
  {
    "title": "Boeing Awarded $2 Billion Contract to Continue Work on B-52’s New Engines",
    "contentSnippet": "The new contract covers the Post-Critical Design Review phase of the B-52 Commercial Engine Replacement Program, which will replace the TF33 engines with the new F130s. The U.S. Department of War awarded on Dec. 23, 2025 a $2.04 billion task order to Boeing Defense Systems to continue the work on the B-52 Commercial Engine Replacement […]",
    "pubDate": "Wed, 24 Dec 2025 18:53:34 +0000",
    "link": "https://theaviationist.com/2025/12/24/boeing-contract-continue-work-b-52-cerp/",
    "source": "The Aviationist"
  },
  {
    "title": "USS Nimitz Decommissioning in Sight as HII Awarded Contract Modification",
    "contentSnippet": "The 50 year old nuclear-powered aircraft carrier returned to Bremerton, Washington on Dec. 16, 2025 after its final scheduled deployment. USS Nimitz (CVN-68), the oldest commissioned aircraft carrier in the world, is scheduled to be officially decommissioned in May 2026 – 51 years after entering service. After post-deployment maintenance at Naval Base Kitsap, Bremerton, the […]",
    "pubDate": "Wed, 24 Dec 2025 18:01:22 +0000",
    "link": "https://theaviationist.com/2025/12/24/uss-nimitz-decommissioning-in-sight/",
    "source": "The Aviationist"
  },
  {
    "title": "Ukrainian Drone Strike Reportedly Destroys Rare Russian Il-38N ASW Aircraft",
    "contentSnippet": "Rare Il-38N ASW aircraft reportedly destroyed as Kyiv targets high-value enablers behind the front line. Ukraine’s Security Service (SBU) has released footage showing a drone strike against a Russian Navy Ilyushin Il-38N anti-submarine warfare aircraft at Yeysk Air Base, in southern Russia. According to Ukrainian officials, the attack was carried out earlier this month and […]",
    "pubDate": "Wed, 24 Dec 2025 16:30:29 +0000",
    "link": "https://theaviationist.com/2025/12/24/drone-strike-on-il-38n/",
    "source": "The Aviationist"
  },
  {
    "title": "John Wayne Airport “Fly Friendly” Program Proves Airports Can Be Good Neighbors",
    "contentSnippet": "The John Wayne Airport Fly Friendly Program helps reduce general aviation jet noise at John Wayne Airport (SNA) through voluntary actions, smart flying, and annual awards. Flying in and out of SNA has always come with extra responsibility. The airport sits right in the middle of densely populated neighborhoods in Orange County, California, which means […]\nThe post John Wayne Airport “Fly Friendly” Program Proves Airports Can Be Good Neighbors appeared first on Avgeekery.",
    "pubDate": "Wed, 24 Dec 2025 16:00:26 +0000",
    "link": "https://avgeekery.com/john-wayne-airport-fly-friendly-program/",
    "source": "avgeekery"
  },
  {
    "title": "First Royal Navy F-35Bs are Undergoing Corrosion Repair at the U.S. Navy’s FRCSE",
    "contentSnippet": "The three Royal Navy F-35Bs will be put through an extensive inspection of airframe and substructure for any corrosive damage, following which those parts will be removed, repaired and reinstalled. For the first time, the U.S. Navy’s Fleet Readiness Center Southeast (FRCSE) at Jacksonville, Florida, hosted three Royal Navy F-35B Lightning IIs which will undergo […]",
    "pubDate": "Wed, 24 Dec 2025 12:40:55 +0000",
    "link": "https://theaviationist.com/2025/12/24/royal-navy-f-35bs-corrosion-repair-us-navy-frcse/",
    "source": "The Aviationist"
  },
  {
    "title": "Santa Got a Checkride Again This Year",
    "contentSnippet": "“You better watch out.  You better not cry.” His experimental craft and isolated North Pole location didn’t prevent Santa from getting a no-notice check. Santa had a big job to do last night.  He has to do what is seemingly impossible. That is to deliver Christmas gifts to millions of toys to good little boys […]\nThe post Santa Got a Checkride Again This Year appeared first on Avgeekery.",
    "pubDate": "Wed, 24 Dec 2025 09:12:00 +0000",
    "link": "https://avgeekery.com/santas-getting-checkride-year/",
    "source": "avgeekery"
  },
  {
    "title": "Dubai Airshow Day 3: Orders for Airbus & Boeing",
    "contentSnippet": "Emirates has ordered eight Airbus A350s on the third day of the Dubai Airshow, while flydubai has signed a memorandum of understanding (MoU) for up to 150 Boeing 737 MAX jets. Moreover, Airbus also received orders from Buraq Air and Silk Way West Airlines for A320neo and A350F freighters, respectively. flydubai Signs MoU for up to 150 Boeing 737 MAX Jets Just 24 hours after announcing an MoU with Airbus for 150 A321neos, flydubai has now signed another MoU with Boeing for up to […]\nThe post Dubai Airshow Day 3: Orders for Airbus & Boeing appeared first on SamChui.com.",
    "pubDate": "Wed, 19 Nov 2025 12:29:48 +0000",
    "link": "https://samchui.com/2025/11/19/dubai-airshow-day-3-orders-for-airbus-boeing/",
    "source": "Sam Chui"
  },
  {
    "title": "flydubai signs MoU for 75 Boeing 737 MAX Airplanes",
    "contentSnippet": "",
    "pubDate": "Wed, 19 Nov 2025 05:01:00 -0500",
    "link": "https://boeing.mediaroom.com/2025-11-19-flydubai-signs-MoU-for-75-Boeing-737-MAX-Airplanes",
    "source": "Boeing"
  },
  {
    "title": "Glasgow Prestwick sees continued profit and cargo growth",
    "contentSnippet": "Glasgow Prestwick Airport (PIK/EGPK) is celebrating its sixth consecutive year of profit as it continues to turn its fortunes around posting a £3.5 million operating profit for 2024/2025, up £300,000 from the previous year. This comes in part thanks to the “transformational” growth in its cargo market which has seen  [read more]\nThe post Glasgow Prestwick sees continued profit and cargo growth appeared first on UK Aviation News.",
    "pubDate": "Wed, 17 Dec 2025 19:07:00 +0000",
    "link": "https://ukaviation.news/glasgow-prestwick-sees-continued-profit-and-cargo-growth/",
    "source": "UK Aviation News"
  },
  {
    "title": "UPS MD-11 Crashes Near Louisville Airport",
    "contentSnippet": "On November 4, 2025, a UPS McDonnell Douglas MD-11 cargo aircraft crashed shortly after takeoff from Muhammad Ali International Airport in Louisville, Kentucky.  The MD-11 with registered N259UP, was operating UPS Flight 2976 to Honolulu, Hawaii, when the accident occurred. Three crew members were on board at the time of the crash.  Local authorities confirmed that emergency services responded to the scene, with reports of injuries and significant structural damage in the surrounding area. Update: November 5, 23:30 UTC Investigators […]\nThe post UPS MD-11 Crashes Near Louisville Airport appeared first on SamChui.com.",
    "pubDate": "Wed, 05 Nov 2025 00:22:58 +0000",
    "link": "https://samchui.com/2025/11/05/ups-md-11-crashes-near-louisville-airport/",
    "source": "Sam Chui"
  },
  {
    "title": "Air India Strengthens European Network with New airBaltic Codeshare",
    "contentSnippet": "Air India has unveiled a new unilateral codeshare agreement with airBaltic, boosting connectivity to the Baltic region for Indian travellers.\nThe post Air India Strengthens European Network with New airBaltic Codeshare appeared first on AviationSource News.",
    "pubDate": "Tue, 30 Dec 2025 23:43:04 +0000",
    "link": "https://aviationsourcenews.com/air-india-strengthens-european-network-with-new-airbaltic-codeshare/",
    "source": "Aviation Source News"
  },
  {
    "title": "Airbus Sees Surge in Orders from China as 2025 Closes",
    "contentSnippet": "Airbus has seen a surge in narrowbody orders from China as it continues to chase its revised delivery target of approximately 790 aircraft for 2025.\nThe post Airbus Sees Surge in Orders from China as 2025 Closes appeared first on AviationSource News.",
    "pubDate": "Tue, 30 Dec 2025 22:50:48 +0000",
    "link": "https://aviationsourcenews.com/airbus-sees-surge-in-orders-from-china-as-2025-closes/",
    "source": "Aviation Source News"
  },
  {
    "title": "Spain Signs Contract for 30 Hürjets",
    "contentSnippet": "Spain signed a €2.4 billion contract to acquire Turkish Aerospace Industries’ Hürjets, with Airbus leading the work on the new Integrated Training System. The Spanish government has signed the contract for acquiring Türkiye’s Hürjet advanced jet trainer, made by the Turkish Aerospace Industries (TAI), for the Ejército del Aire y del Espacio (Spanish Air and […]",
    "pubDate": "Tue, 30 Dec 2025 21:29:45 +0000",
    "link": "https://theaviationist.com/2025/12/30/spain-signs-contract-for-30-hurjets/",
    "source": "The Aviationist"
  },
  {
    "title": "Flightradar24 Tracking Santa: The Numbers Are In!",
    "pubDate": "Tue, 30 Dec 2025 14:53:41 +0000",
    "contentSnippet": "Every Christmas, millions of aviation enthusiasts and excited children around the world turn their attention to Flightradar24 to track one very special flight. This year was no exception. Secretive as always, Santa shared his flightplan with us via Telex (used once yearly at the office) at the last minute, announcing his immediate departure at 08:00 […]\nThe post Flightradar24 Tracking Santa: The Numbers Are In! appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/flight-tracking-news/just-for-fun/flightradar24-tracking-santa/",
    "source": "FlightRadar24"
  },
  {
    "title": "Podcast: Making your manuals automatic",
    "contentSnippet": "On this week’s Australian Aviation Podcast, Jake Nelson speaks to Web Manuals CEO Martin Lidgard on the company’s Australian expansion and the importance of streamlining compliance management of operational manuals.",
    "pubDate": "Tue, 30 Dec 2025 13:00:04 +0000",
    "link": "https://australianaviation.com.au/2025/12/podcast-making-your-manuals-automatic/",
    "source": "Australian Aviation"
  },
  {
    "title": "Wartime ‘short snorter’ banknote finds new home at RAAF Townsville",
    "contentSnippet": "The note, signed by Allied nations aviators, is believed to be from approximately 1 to 19 July 1942, and holds up to 30 signatures from RAAF and US Air Force personnel.",
    "pubDate": "Tue, 30 Dec 2025 01:00:50 +0000",
    "link": "https://australianaviation.com.au/2025/12/wartime-short-snorter-banknote-finds-new-home-at-raaf-townsville/",
    "source": "Australian Aviation"
  },
  {
    "title": "The UK Armed Forces’ 2025 in Pictures",
    "contentSnippet": "The UK’s Ministry of Defence has unveiled an image gallery showcasing some of their best photographs from the past year. Let’s take a look at some of our favorites. 2025 saw a number of high profile deployments of UK military forces both close to home and across the globe, including the eight month long voyage […]",
    "pubDate": "Tue, 30 Dec 2025 00:05:49 +0000",
    "link": "https://theaviationist.com/2025/12/30/uk-mod-2025-pictures/",
    "source": "The Aviationist"
  },
  {
    "title": "Business jet crashes near Ankara carrying Libyan military leader",
    "pubDate": "Tue, 23 Dec 2025 21:50:37 +0000",
    "contentSnippet": "A Falcon 50 business jet carrying Libyan military leaders crashed approximately 30 minutes after take off from Ankara on 23 December. According to Turkish authorities, the aircraft was carrying Muhammed Ali Ahmed Al-Haddad, the Libyan army chief, along with at least four others. The Falcon 50 operated by Harmony Jets Malta departed Ankara at 17:17:24 […]\nThe post Business jet crashes near Ankara carrying Libyan military leader appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/flight-tracking-news/major-incident/business-jet-crashes-near-ankara-carrying-libyan-military-leader/",
    "source": "FlightRadar24"
  },
  {
    "title": "Embraer delivers milestone 50th E192-E2 to Porter Airlines",
    "contentSnippet": "Brazilian OEM Embraer has delivered the 50th Embraer E195-E2 aircraft to Canadian carrier Porter Airlines marking a milestone for the carrier. Porter Airlines took delivery of the first of 75 E195-E2s in December 2022 and a steady stream of the type has joined the airliner up this milestone aircraft this  [read more]\nThe post Embraer delivers milestone 50th E192-E2 to Porter Airlines appeared first on UK Aviation News.",
    "pubDate": "Tue, 23 Dec 2025 16:00:29 +0000",
    "link": "https://ukaviation.news/embraer-delivers-milestone-50th-e192-e2-to-porter-airlines/",
    "source": "UK Aviation News"
  },
  {
    "title": "The Great Grinch Sky Art Showdown",
    "pubDate": "Tue, 23 Dec 2025 11:37:04 +0000",
    "contentSnippet": "Every December, as huge chunks of the world deck the halls and trim the trees, a special breed of pilot decides that standard flight patterns are beneath (pun intended) them. Because why fly a straight line when you can create Grinch sky art across the winter sky? This holiday season, we’ve spotted not one but […]\nThe post The Great Grinch Sky Art Showdown appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/flight-tracking-news/just-for-fun/the-great-grinch-sky-art-showdown/",
    "source": "FlightRadar24"
  },
  {
    "title": "Dubai Airshow 2025 Day 2: Big Orders for Airbus",
    "contentSnippet": "After a quiet Day 1, Airbus opened Day 2 with major orders from Etihad Airways, flydubai, Air Europa and Ethiopian Airlines. Moreover, Boeing also received order from Gulf Air, following a successful Day 1. Etihad Airways Orders Airbus A330neo, A350-1000 and A350F Etihad Airways has placed a firm order for six A330-900s, becoming the newest customer for the A330neo. It is also expanding its A350 fleet with seven additional A350-1000s (now totaling 27) and three more A350F freighters, bringing its A350F commitment to 10. […]\nThe post Dubai Airshow 2025 Day 2: Big Orders for Airbus appeared first on SamChui.com.",
    "pubDate": "Tue, 18 Nov 2025 12:08:53 +0000",
    "link": "https://samchui.com/2025/11/18/dubai-airshow-2025-day-2-big-orders-for-airbus/",
    "source": "Sam Chui"
  },
  {
    "title": "Boeing: Middle East Airlines Enter New Era of Growth as Region's Fleet Will More Than Double by 2044",
    "contentSnippet": "",
    "pubDate": "Tue, 18 Nov 2025 03:13:00 -0500",
    "link": "https://boeing.mediaroom.com/2025-11-18-Boeing-Middle-East-Airlines-Enter-New-Era-of-Growth-as-Regions-Fleet-Will-More-Than-Double-by-2044",
    "source": "Boeing"
  },
  {
    "title": "No MELs, No Delays: How Santa’s Sleigh Keeps Flying Year After Magical Year",
    "contentSnippet": "Is Santa’s Sleigh the Most Reliable Airframe Ever Built? Spoiler: Yes. Yes, it is. And it’s not even close.  Every 24th of December, without fail, Santa launches the most ambitious overnight operation in aviation history. No test flights. No press conferences. No NOTAMs lighting up ForeFlight. Just wheels up, world covered, mission complete. And perhaps […]\nThe post No MELs, No Delays: How Santa’s Sleigh Keeps Flying Year After Magical Year appeared first on Avgeekery.",
    "pubDate": "Thu, 25 Dec 2025 01:43:27 +0000",
    "link": "https://avgeekery.com/how-santas-sleigh-keeps-flying/",
    "source": "avgeekery"
  },
  {
    "title": "Coulson Aviation 767 Set to Join Fleet as Wildfire Airtanker Fleets Face a Reckoning",
    "contentSnippet": "Coulson Aviation 767 is set to reshape Very Large Airtanker (VLAT) operations as legacy firefighting aircraft near retirement. If you have followed aerial firefighting over the past few years, you already know the uncomfortable truth. The fleet of very large airtankers that agencies have relied on for decades is aging out fast. With the recent […]\nThe post Coulson Aviation 767 Set to Join Fleet as Wildfire Airtanker Fleets Face a Reckoning appeared first on Avgeekery.",
    "pubDate": "Thu, 25 Dec 2025 00:38:00 +0000",
    "link": "https://avgeekery.com/coulson-aviation-767-set-to-join-fleet/",
    "source": "avgeekery"
  },
  {
    "title": "Costa Rica travel guide: How to make the most of your adventure",
    "contentSnippet": "Costa Rica captivates British travellers with its extraordinary biodiversity, beaches and commitment to environmental conservation. This Central American gem offers adventures ranging from cloud forest hikes to volcanic hot springs, all within a country smaller than Scotland. Planning strategically guarantees that you experience the best of Costa Rica’s natural wonders whilst going  [read more]\nThe post Costa Rica travel guide: How to make the most of your adventure appeared first on UK Aviation News.",
    "pubDate": "Thu, 18 Dec 2025 19:28:21 +0000",
    "link": "https://ukaviation.news/costa-rica-travel-guide-how-to-make-the-most-of-your-adventure/",
    "source": "UK Aviation News"
  },
  {
    "title": "Boeing and Somon Air Announce Commitment for Up to 14 Airplanes",
    "contentSnippet": "",
    "pubDate": "Thu, 06 Nov 2025 16:41:00 -0500",
    "link": "https://boeing.mediaroom.com/2025-11-06-Boeing-and-Somon-Air-Announce-Commitment-for-Up-to-14-Airplanes",
    "source": "Boeing"
  },
  {
    "title": "Air India Pilot Removed from Duty in Vancouver Following Failed Breathalyzer Test",
    "contentSnippet": "Air India removed a captain from duty after he failed a pre-flight breathalyzer test at Vancouver Airport,  delaying flight AI186 to Delhi via Vienna on 23 December 2025.\nThe post Air India Pilot Removed from Duty in Vancouver Following Failed Breathalyzer Test appeared first on AviationSource News.",
    "pubDate": "Thu, 01 Jan 2026 22:53:38 +0000",
    "link": "https://aviationsourcenews.com/air-india-pilot-removed-from-duty-in-vancouver-following-failed-breathalyzer-test/",
    "source": "Aviation Source News"
  },
  {
    "title": "The Rise of AI in Travel Planning: Convenience, Cautions, and the Road Ahead",
    "contentSnippet": "The rising use of AI to assist with travel planning brings with it both convenience and risk, according to a Virginia Tech study. We examine the pitfalls and the necessary precautions.\nThe post The Rise of AI in Travel Planning: Convenience, Cautions, and the Road Ahead appeared first on AviationSource News.",
    "pubDate": "Thu, 01 Jan 2026 22:21:28 +0000",
    "link": "https://aviationsourcenews.com/the-rise-of-ai-in-travel-planning-convenience-cautions-and-the-road-ahead/",
    "source": "Aviation Source News"
  },
  {
    "title": "Sky-High Dreams: Why Electric Air Taxis Aren’t Soaring Over Cities Just Yet",
    "contentSnippet": "Before electric air taxis become a reality, Georgia Tech researchers say there’s serious work to do - in the air, on the ground, and in policy.\nThe post Sky-High Dreams: Why Electric Air Taxis Aren’t Soaring Over Cities Just Yet appeared first on AviationSource News.",
    "pubDate": "Thu, 01 Jan 2026 21:49:30 +0000",
    "link": "https://aviationsourcenews.com/sky-high-dreams-why-electric-air-taxis-arent-soaring-over-cities-just-yet/",
    "source": "Aviation Source News"
  },
  {
    "title": "New Study Highlights Wide Variations in Airline Drinking Water Quality",
    "contentSnippet": "A recently published report, the 2026 Airline Water Study from the Center for Food as Medicine & Longevity, shows that onboard drinking water quality differs greatly among U.S. airlines.\nThe post New Study Highlights Wide Variations in Airline Drinking Water Quality appeared first on AviationSource News.",
    "pubDate": "Thu, 01 Jan 2026 21:17:47 +0000",
    "link": "https://aviationsourcenews.com/new-study-highlights-wide-variations-in-airline-drinking-water-quality/",
    "source": "Aviation Source News"
  },
  {
    "title": "Israel Signs Contract for 25 F-15IA Aircraft",
    "contentSnippet": "The Israeli Air Force will get 25 new F-15IA fighter jets as part of a deal worth up to $8.5 billion, with 25 more jets on option. The Israeli Air Force will get new F-15s based on the Advanced Eagle variant, called F-15IA (Israel Advanced). The contract, worth up to $8.5 billion, was signed on […]",
    "pubDate": "Thu, 01 Jan 2026 18:52:36 +0000",
    "link": "https://theaviationist.com/2026/01/01/israel-25-f-15ia-deal/",
    "source": "The Aviationist"
  },
  {
    "title": "RAAF personnel support men’s and women’s health in 2025",
    "contentSnippet": "At RAAF Base Williamtown, No. 2 Squadron designed a limited, special edition pink patch for Breast Cancer Awareness Month in October, while in November, many Aircraftmen participated in Movember, a campaign dedicated to raising awareness for some of the struggles Australian men face the most.",
    "pubDate": "Thu, 01 Jan 2026 04:00:48 +0000",
    "link": "https://australianaviation.com.au/2026/01/raaf-personnel-support-mens-and-womens-health-in-2025/",
    "source": "Australian Aviation"
  },
  {
    "title": "Foo flight-ers tipped to drive Launceston Airport’s busiest ever day",
    "contentSnippet": "An exclusive Foo Fighters concert, to be held at University of Tasmania Stadium on 24 January, will see around 6,700 passengers travel through Launceston the day before, with Qantas, Virgin and Jetstar all putting on extra flights to meet the anticipated demand.",
    "pubDate": "Thu, 01 Jan 2026 01:00:06 +0000",
    "link": "https://australianaviation.com.au/2026/01/foo-flight-ers-tipped-to-drive-launceston-airports-busiest-ever-day/",
    "source": "Australian Aviation"
  },
  {
    "title": "Drone pilots face-off in ADF competition",
    "contentSnippet": "Working off the Battle Lab MakerSpace training model, teams were assessed on practical skills like building first-person view drones, operating uncrewed ground vehicles, troubleshooting faults and executing tasks under time pressure.",
    "pubDate": "Sun, 28 Dec 2025 22:00:18 +0000",
    "link": "https://australianaviation.com.au/2025/12/drone-pilots-face-off-in-adf-competition/",
    "source": "Australian Aviation"
  },
  {
    "title": "The Crash of Eastern Air Lines Flight 212",
    "contentSnippet": "Pilot error, complacency, and distraction, coupled with obscuring fog at the most critical point of flight, resulted in the crash of Eastern Air Lines Flight 212, a DC-9-31, on 11 September 1974, and were instrumental in the adoption of new cockpit rules. The Setup: Crew, Aircraft, and a Short Hop North THE AIRCRAFT Both manufactured […]\nThe post The Crash of Eastern Air Lines Flight 212 appeared first on Avgeekery.",
    "pubDate": "Sun, 28 Dec 2025 21:28:43 +0000",
    "link": "https://avgeekery.com/the-crash-of-eastern-air-lines-flight-212/",
    "source": "avgeekery"
  },
  {
    "title": "Poland Plans €2 Billion Counter-Drone Network for Eastern Border",
    "contentSnippet": "The first capabilities will be activated in the next six months, with the full system in place within two years, defence minister Cezary Tomczyk told the UK’s Guardian newspaper. Fortifications along Poland’s borders with Belarus and the Russian exclave of Kaliningrad will be upgraded over the next two years with new air defence systems designed […]",
    "pubDate": "Sun, 28 Dec 2025 00:55:38 +0000",
    "link": "https://theaviationist.com/2025/12/28/poland-counter-drone-network-eastern-border/",
    "source": "The Aviationist"
  },
  {
    "title": "First A321XLR delivered to Qanot Sharq airlines",
    "contentSnippet": "Airbus has delivered the first of four A321XLR single-aisle airliners to Uzbekistan’s Qanot Sharq, one of the countries leading privately owned passenger airlines. The aircraft has been financed by Air Lease who have placed the A321XLR on a long-term lease. Powered by two CFM LEAP-1A engines, the A321XLR is capable  [read more]\nThe post First A321XLR delivered to Qanot Sharq airlines appeared first on UK Aviation News.",
    "pubDate": "Sun, 21 Dec 2025 19:28:41 +0000",
    "link": "https://ukaviation.news/first-a321xlr-delivered-to-qanot-sharq-airlines/",
    "source": "UK Aviation News"
  },
  {
    "title": "South Korea Starts KF-21 Pit Drop Trials with Air-to-Ground Weapons",
    "contentSnippet": "South Korea is working on the introduction of an air-to-ground capability for the KF-21 Boramae, as well as a new air-to-air missile and a new domestically-developed engine. South Korea’s Defense Acquisition Program Administration (DAPA) released on Dec. 23, 2025, a video of air-to-ground weapons’ drop trials with the indigenous KF-21 Boramae. The videos shows multiple […]",
    "pubDate": "Sat, 27 Dec 2025 20:19:02 +0000",
    "link": "https://theaviationist.com/2025/12/27/kf-21-air-to-ground-trials/",
    "source": "The Aviationist"
  },
  {
    "title": "China’s J-10C Allegedly Seen Carrying YJ-21E Anti-Ship Ballistic Missile for the First Time",
    "contentSnippet": "The YJ-21E spotted on the J-10C is a smaller variant of the larger YJ-21/KD-21 predominantly spotted on the H-6K bomber, specifically designed for fighter jets and drones. China’s J-10C fighter has emerged in a recent photograph with what observers have identified as the ‘E’ variant of the YJ-21 Anti-Ship Ballistic Missile (AShBM), the YJ-21E. Describing […]",
    "pubDate": "Sat, 27 Dec 2025 13:32:40 +0000",
    "link": "https://theaviationist.com/2025/12/27/china-j-10c-yj-21e/",
    "source": "The Aviationist"
  },
  {
    "title": "How Trump’s Space Executive Order Could Reshape America’s Spaceflight Roadmap",
    "contentSnippet": "President Donald Trump’s space executive order puts the Moon back at the center of America’s spaceflight plans, pairing familiar goals with firm timelines. The directive touches everything from lunar landings and nuclear power in space to commercial launch infrastructure, setting the stage for some of the most consequential space decisions in years. The executive order, […]\nThe post How Trump’s Space Executive Order Could Reshape America’s Spaceflight Roadmap appeared first on Avgeekery.",
    "pubDate": "Sat, 20 Dec 2025 18:18:38 +0000",
    "link": "https://avgeekery.com/trumps-space-executive-order-spaceflight-roadmap/",
    "source": "avgeekery"
  },
  {
    "title": "Cadets taught drone capabilities in latest program",
    "contentSnippet": "The Futures Program and 400 ACU Drone Racing Unit is providing young cadets with access to contemporary technology while simultaneously increasing skills in science, technology, engineering and mathematics and in digital to respond to the changing nature of defence.",
    "pubDate": "Mon, 29 Dec 2025 22:00:27 +0000",
    "link": "https://australianaviation.com.au/2025/12/cadets-taught-drone-capabilities-in-latest-program/",
    "source": "Australian Aviation"
  },
  {
    "title": "USAF MQ-9A Reapers are Carrying Up to Ten AGM-114 Hellfire Missiles in the Caribbean",
    "contentSnippet": "At least nine MQ-9s are deployed to Puerto Rico’s Rafael Hernández Airport, each carrying between six and ten AGM-114 Hellfire missiles. U.S. Air Force MQ-9A Reapers deployed to Puerto Rico’s Rafael Hernández Airport in support of counter-narcotics operations in the Caribbean are now routinely flying with up to ten AGM-114 Hellfire air-to-ground missiles each. Photos […]",
    "pubDate": "Mon, 29 Dec 2025 20:48:12 +0000",
    "link": "https://theaviationist.com/2025/12/29/usaf-mq-9a-ten-agm-114-hellfire/",
    "source": "The Aviationist"
  },
  {
    "title": "Flightradar24 Picks Year-End Aviation Movies",
    "pubDate": "Mon, 29 Dec 2025 11:57:41 +0000",
    "contentSnippet": "Airports at the end of the year are a special place. Everyone is tired, slightly overpacked, and emotionally invested in being somewhere else. It’s no wonder filmmakers keep returning to aviation as the perfect setting for drama and heartfelt reunions. The Flightradar24 Cinephile Division brings you a smorgasbord of airport adjacent movies to binge watch […]\nThe post Flightradar24 Picks Year-End Aviation Movies appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/flight-tracking-news/just-for-fun/flightradar24-picks-year-end-aviation-movies/",
    "source": "FlightRadar24"
  },
  {
    "title": "Loganair launches Tartan sale offering discounts across its network",
    "contentSnippet": "Scottish regional airline Loganair (LM/LOG) has launched its Tartan sale today offering discounts of 17% on flights across its network making 2026 the perfect year for a staycation in the UK. The sale runs from today, 29th of December 2025 through to the 8th January 2026 and gives passengers the  [read more]\nThe post Loganair launches Tartan sale offering discounts across its network appeared first on UK Aviation News.",
    "pubDate": "Mon, 29 Dec 2025 09:45:35 +0000",
    "link": "https://ukaviation.news/loganair-launches-tartan-sale-offering-discounts-across-its-network/",
    "source": "UK Aviation News"
  },
  {
    "title": "RAAF firefighters congratulated for saving Katherine hay barn",
    "contentSnippet": "RAAF Base Tindal’s No. 17 Squadron Fire Section dispatched two Airfield Panther fire trucks and two rural fire trucks to the scene within 15 minutes of receiving the distress call on 7 November, with crews assigned to protect two gas bullets and attack flames in mill and feed storage sheds.",
    "pubDate": "Mon, 29 Dec 2025 04:00:52 +0000",
    "link": "https://australianaviation.com.au/2025/12/raaf-firefighters-congratulated-for-saving-katherine-hay-barn/",
    "source": "Australian Aviation"
  },
  {
    "title": "Leidos wins extension to search-and-rescue contract",
    "contentSnippet": "The company will now continue its Australian search-and-rescue operations until the end of 2030 across both land and maritime domains using its specialised fleet of Bombardier Challenger aircraft.",
    "pubDate": "Mon, 29 Dec 2025 01:00:44 +0000",
    "link": "https://australianaviation.com.au/2025/12/leidos-wins-extension-to-search-and-rescue-contract/",
    "source": "Australian Aviation"
  },
  {
    "title": "GeminiJets Airplane Models – August 25 New Release + Discounts",
    "contentSnippet": "I have been collecting GeminiJets since they launched 20 years ago! During difficult times, I have found that model collecting can help alleviate some of the stress. Video Special Offer This is a sponsored post to showcase the latest GeminiJets airplane model releases. Hope you find something you like. To purchase GeminiJets, go to DiecastJets.com and use code SAMCHUI at checkout for up to 25% off and free shipping in the US. August 2025 1:400 New Release August 2025 1:200 New Release Video This is a sponsored post […]\nThe post GeminiJets Airplane Models – August 25 New Release + Discounts appeared first on SamChui.com.",
    "pubDate": "Mon, 22 Sep 2025 13:45:40 +0000",
    "link": "https://samchui.com/2025/09/22/geminijets-airplane-models-august-25-new-release-discounts/",
    "source": "Sam Chui"
  },
  {
    "title": "UK Airports Prepare for Busy Christmas Period",
    "contentSnippet": "UK airports are preparing for one of their busiest festive seasons on record, with millions of passengers expected to take to the skies over the Christmas and New Year period as demand for air travel continues to grow. According to data from Cirium, the aviation analytics firm, between 19 December and 4  [read more]\nThe post UK Airports Prepare for Busy Christmas Period appeared first on UK Aviation News.",
    "pubDate": "Mon, 22 Dec 2025 18:21:31 +0000",
    "link": "https://ukaviation.news/uk-airports-prepare-for-busy-christmas-period/",
    "source": "UK Aviation News"
  },
  {
    "title": "Garmin Emergency Autoland deployed for the first time",
    "pubDate": "Mon, 22 Dec 2025 15:44:53 +0000",
    "contentSnippet": "This post has been significantly revised with new information from Buffalo River Aviation On Saturday, 20 December 2025, the Garmin’s Emergency Autoland was used for the first time in a real world emergency situation. The Emergency Autoland system is designed to take control of an aircraft in the event of pilot incapacitation and safely land […]\nThe post Garmin Emergency Autoland deployed for the first time appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/aviation-news/aviation-safety/garmin-emergency-autoland-deployed-first-time/",
    "source": "FlightRadar24"
  },
  {
    "title": "Flightradar24 to Supply Flight Data Services to Boeing",
    "pubDate": "Mon, 22 Dec 2025 09:56:01 +0000",
    "contentSnippet": "Stockholm, Sweden – December 22, 2025 – Flightradar24, the world’s leading flight tracking service, today announced it has entered into an agreement to supply flight data services to Boeing. Under the agreement, Boeing will gain access to Flightradar24’s comprehensive live and historic flight data, based on the latter’s global network of more than 55,000 ADS-B […]\nThe post Flightradar24 to Supply Flight Data Services to Boeing appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/b2b/flightradar24-to-supply-flight-data-services-to-boeing/",
    "source": "FlightRadar24"
  },
  {
    "title": "Why These Four Airports Suddenly Explode With Traffic After Christmas",
    "pubDate": "Mon, 22 Dec 2025 08:24:35 +0000",
    "contentSnippet": "With the holiday period being just around the corner, why not write a festive piece to show exactly how much air traffic expands during the days leading up to Christmas? Armed with a rich dataset provided by the digit gurus down in the Flightradar24 data vault, I set out for what I expected to be […]\nThe post Why These Four Airports Suddenly Explode With Traffic After Christmas appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/b2b/post-christmas-airport-traffic-spike/",
    "source": "FlightRadar24"
  },
  {
    "title": "ACT Boeing 747 Freighter Crashes on Landing in Hong Kong",
    "contentSnippet": "On October 20, 2025, a Boeing 747-400 freighter operated by ACT Airlines on behalf of Emirates crashed into the sea after veering off the runway during landing at Hong Kong International Airport (HKG). The Boeing 747-400F, registered TC-ACF, was operating flight EK9788 from Dubai Al Maktoum International Airport (DWC) to Hong Kong, with four crew members onboard. The aircraft departed Dubai on the evening of October 19 and was due to arrive in Hong Kong early the next morning. At […]\nThe post ACT Boeing 747 Freighter Crashes on Landing in Hong Kong appeared first on SamChui.com.",
    "pubDate": "Mon, 20 Oct 2025 08:26:58 +0000",
    "link": "https://samchui.com/2025/10/20/act-cargo-boeing-747-freighter-crashes-on-landing-in-hong-kong/",
    "source": "Sam Chui"
  },
  {
    "title": "Dubai Airshow 2025 Day 1: Big Orders for Boeing",
    "contentSnippet": "Boeing has opened the Dubai Airshow 2025 on a strong note with Emirates placing an order for 65 Boeing 777X aircraft. This was followed by commitments from Ethiopian Airlines and Air Senegal for additional MAX jets. Embraer has also received orders from Helvetic Airways and Air Côte d’Ivoire on the first day of the bi-annual Airshow. Here is a recap of orders and announcements from the first day of the Dubai Airshow. Emirates Orders 65 Boeing 777X Boeing has kicked off the […]\nThe post Dubai Airshow 2025 Day 1: Big Orders for Boeing appeared first on SamChui.com.",
    "pubDate": "Mon, 17 Nov 2025 13:40:06 +0000",
    "link": "https://samchui.com/2025/11/17/dubai-airshow-2025-day-1-big-order-for-boeing-from-emirates/",
    "source": "Sam Chui"
  },
  {
    "title": "Air Senegal Commits to First Boeing 737 MAX Order",
    "contentSnippet": "",
    "pubDate": "Mon, 17 Nov 2025 08:02:00 -0500",
    "link": "https://boeing.mediaroom.com/2025-11-17-Air-Senegal-Commits-to-First-Boeing-737-MAX-Order",
    "source": "Boeing"
  },
  {
    "title": "Ethiopian Airlines Commits to Order 11 Boeing 737 MAX Airplanes",
    "contentSnippet": "",
    "pubDate": "Mon, 17 Nov 2025 06:00:00 -0500",
    "link": "https://boeing.mediaroom.com/2025-11-17-Ethiopian-Airlines-Commits-to-Order-11-Boeing-737-MAX-Airplanes",
    "source": "Boeing"
  },
  {
    "title": "Spaceport Cornwall partners with National Drone Hub to expand uncrewed systems testing",
    "contentSnippet": "Spaceport Cornwall, the UK’s first licensed spaceport, has begun work on a major new collaboration with the National Drone Hub aimed at creating a unique testing environment for uncrewed aerial systems (UAS), further strengthening Cornwall’s role in the UK’s future air and space ecosystem. The National Drone Hub, operated by  [read more]\nThe post Spaceport Cornwall partners with National Drone Hub to expand uncrewed systems testing appeared first on UK Aviation News.",
    "pubDate": "Mon, 15 Dec 2025 16:53:09 +0000",
    "link": "https://ukaviation.news/spaceport-cornwall-partners-with-national-drone-hub-to-expand-uncrewed-systems-testing/",
    "source": "UK Aviation News"
  },
  {
    "title": "Flying Tiger Shot Down in 1943 Finally Returns Home",
    "contentSnippet": "After more than 80 years, a P-40 fighter pilot shot down in China in 1943 has finally returned home to South Carolina. It wasn’t the first time 1st Lt. Morton Sher was shot down. At 22 years old he was escorting bombers for breakfast, and flying other hazardous combat missions for dinner in the China-Burma […]\nThe post Flying Tiger Shot Down in 1943 Finally Returns Home appeared first on Avgeekery.",
    "pubDate": "Fri, 26 Dec 2025 20:19:31 +0000",
    "link": "https://avgeekery.com/flying-tiger-shot-down-in-1943-finally-returns-home/",
    "source": "avgeekery"
  },
  {
    "title": "U.S. Navy Awards Leonardo UK Contract to Equip F-35 with BriteCloud Active Expendable Decoys",
    "contentSnippet": "The U.S. Navy is acquiring and undisclosed number of BriteCloud Active Expendable Decoys specifically for the F-35 Lightning II. The Naval Air Systems Command (NAVAIR) has awarded Leonardo UK a contract to supply the U.S. Navy with an undisclosed number of BriteCloud decoys, designated by the military as AN/ALQ-260(V) Anti-Missile Countermeasure. The development follows report […]",
    "pubDate": "Fri, 26 Dec 2025 12:00:54 +0000",
    "link": "https://theaviationist.com/2025/12/26/us-navy-contract-f-35-britecloud-active-expendable-decoys/",
    "source": "The Aviationist"
  },
  {
    "title": "Supposed Third Prototype of China’s J-36 Next-Generation Jet has Flown",
    "contentSnippet": "The supposed third J-36 prototype emerged exactly a year after the first one was spotted in December 2024. Chinese military aviation observers observed what they believe to be a third prototype of the J-36 next-generation aircraft, after photos and videos of it flying overhead emerged on the afternoon of Dec. 25, 2025. They have also […]",
    "pubDate": "Fri, 26 Dec 2025 10:41:17 +0000",
    "link": "https://theaviationist.com/2025/12/26/third-prototype-j-36-has-flown/",
    "source": "The Aviationist"
  },
  {
    "title": "New York Air Had 1980s Attitude, Grew Quickly, Then Folded",
    "contentSnippet": "If an airline could wear a city like a jacket, New York Air did it. The little airline had attitude, but it never really gained enough altitude to survive the turbulent era of the late ’80s. New York Air began operations in 1980 and was based at Hangar 5 at New York’s LaGuardia International Airport […]\nThe post New York Air Had 1980s Attitude, Grew Quickly, Then Folded appeared first on Avgeekery.",
    "pubDate": "Fri, 19 Dec 2025 17:10:52 +0000",
    "link": "https://avgeekery.com/new-york-air-attitude-grew-quickly-folded/",
    "source": "avgeekery"
  },
  {
    "title": "Iconic St Maarten: our newest automated live stream",
    "pubDate": "Fri, 19 Dec 2025 15:45:44 +0000",
    "contentSnippet": "When you think planespotting paradise, St Maarten (SXM) immediately comes to mind. Our new 24/7 automated camera puts you as close to the action as you can get without actually standing on the beach. This camera is fully automated, using Flightradar24 ADS-B data to precisely track aircraft with a PTZ camera from CamStreamer hosted by […]\nThe post Iconic St Maarten: our newest automated live stream appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/inside-flightradar24/st-maarten-sxm-live-stream/",
    "source": "FlightRadar24"
  },
  {
    "title": "China Airlines orders five additional Airbus A350s",
    "contentSnippet": "China Airlines has placed a firm order for five additional Airbus A350-1000 airliners bringing their order total for the type to 15. The new aircraft will join the airline alongside the 15 Airbus A350-900s already in service with the Taiwan based carrier. “Expanding our A350-1000 fleet marks another important step  [read more]\nThe post China Airlines orders five additional Airbus A350s appeared first on UK Aviation News.",
    "pubDate": "Fri, 19 Dec 2025 15:07:42 +0000",
    "link": "https://ukaviation.news/china-airlines-orders-five-additional-airbus-a350s/",
    "source": "UK Aviation News"
  },
  {
    "title": "AvTalk Episode 350: “Outrageous:” close calls near Venezuela",
    "pubDate": "Fri, 19 Dec 2025 12:46:14 +0000",
    "contentSnippet": "On this week’s episode of AvTalk, a pair of incidents involving civilian aircraft and military aircraft without active transponders operating in Curaçao’s airspace sounds a bit too familiar. We discuss the events from the last week and the state of airspace in the southern Caribbean. NTSB chair Jennifer Homendy had choice words for Congress after […]\nThe post AvTalk Episode 350: “Outrageous:” close calls near Venezuela appeared first on Flightradar24 Blog.",
    "link": "https://www.flightradar24.com/blog/avtalk-podcast/avtalk-350/",
    "source": "FlightRadar24"
  },
  {
    "title": "Spirit Airlines Christmas Plane Brings a Welcome Dose of Cheer to the Skies",
    "contentSnippet": "A special Spirit Airlines Christmas plane debuted this week, featuring the carrier’s first-ever holiday livery during one of the busiest and most meaningful travel seasons of the year. The Spirit Airlines Christmas plane is a welcome change of tone after months of heavy headlines surrounding the carrier. We have been covering Spirit Airlines a lot […]\nThe post Spirit Airlines Christmas Plane Brings a Welcome Dose of Cheer to the Skies appeared first on Avgeekery.",
    "pubDate": "Fri, 19 Dec 2025 03:42:27 +0000",
    "link": "https://avgeekery.com/spirit-airlines-christmas-plane-2025/",
    "source": "avgeekery"
  },
  {
    "title": "GeminiJets Airplane Models – September 25 New Release + Discounts",
    "contentSnippet": "I have been collecting GeminiJets since they launched 20 years ago! During difficult times, I have found that model collecting can help alleviate some of the stress. Video Special Offer This is a sponsored post to showcase the latest GeminiJets airplane model releases. Hope you find something you like. To purchase GeminiJets, go to DiecastJets.com and use code SAMCHUI at checkout for up to 25% off and free shipping in the US. September 2025 1:400 New Release September 2025 1:200 New Release Video This is a sponsored post […]\nThe post GeminiJets Airplane Models – September 25 New Release + Discounts appeared first on SamChui.com.",
    "pubDate": "Fri, 17 Oct 2025 08:36:45 +0000",
    "link": "https://samchui.com/2025/10/17/geminijets-airplane-models-september-25-new-release-discounts/",
    "source": "Sam Chui"
  },
  {
    "title": "GeminiJets Airplane Models – October 25 New Release + Discounts",
    "contentSnippet": "I have been collecting GeminiJets since they launched 20 years ago! During difficult times, I have found that model collecting can help alleviate some of the stress. Video Special Offer This is a sponsored post to showcase the latest GeminiJets airplane model releases. Hope you find something you like. To purchase GeminiJets, go to DiecastJets.com and use code SAMCHUI at checkout for up to 25% off and free shipping in the US. October 2025 1:400 New Release October 2025 1:200 New Release Video This is a sponsored post […]\nThe post GeminiJets Airplane Models – October 25 New Release + Discounts appeared first on SamChui.com.",
    "pubDate": "Fri, 14 Nov 2025 07:48:06 +0000",
    "link": "https://samchui.com/2025/11/14/geminijets-airplane-models-october-25-new-release-discounts/",
    "source": "Sam Chui"
  },
  {
    "title": "£750,000 Government funding boost to inspire next generation of UK aviation professionals",
    "contentSnippet": "Projects designed to encourage young people into careers in aviation are set to benefit from a £750,000 funding boost, as the Government announces the latest awards from the Reach for the Sky Challenge Fund. The funding will support initiatives across the UK that aim to showcase the wide range of  [read more]\nThe post £750,000 Government funding boost to inspire next generation of UK aviation professionals appeared first on UK Aviation News.",
    "pubDate": "Fri, 12 Dec 2025 15:07:09 +0000",
    "link": "https://ukaviation.news/750000-government-funding-boost-to-inspire-next-generation-of-uk-aviation-professionals/",
    "source": "UK Aviation News"
  },
  {
    "title": "Air Astana, Somon Air, and Uzbekistan Airways Order New Boeing Jets",
    "contentSnippet": "Boeing has announced new aircraft orders from three Central Asian airlines, Air Astana, Somon Air, and Uzbekistan Airways.  All three announcements were made during the C5+1 Summit, commemorating the 10th anniversary of the diplomatic platform linking the United States with the five Central Asian nations. Uzbekistan Airways Expands 787 Dreamliner Fleet Uzbekistan Airways has firmed an order for eight Boeing 787 Dreamliners, increasing its total order book for the type to 22 aircraft. The signing ceremony took place at the […]\nThe post Air Astana, Somon Air, and Uzbekistan Airways Order New Boeing Jets appeared first on SamChui.com.",
    "pubDate": "Fri, 07 Nov 2025 04:16:39 +0000",
    "link": "https://samchui.com/2025/11/07/air-astana-somon-air-and-uzbekistan-airways-order-new-boeing-jets/",
    "source": "Sam Chui"
  },
  {
    "title": "Is Commercial Air Travel Less Safe Following 2025’s Fatal Crashes?",
    "contentSnippet": "As we enter 2026, many travelers are asking: Has commercial air travel become riskier? A close examination of the data, trends, and expert analyses suggests otherwise.\nThe post Is Commercial Air Travel Less Safe Following 2025’s Fatal Crashes? appeared first on AviationSource News.",
    "pubDate": "Fri, 02 Jan 2026 01:28:01 +0000",
    "link": "https://aviationsourcenews.com/is-commercial-air-travel-less-safe-following-2025s-fatal-crashes/",
    "source": "Aviation Source News"
  },
  {
    "title": "NTSB Preliminary Report: United Airlines Boeing 737 MAX Runway Excursion in Houston",
    "contentSnippet": "The NTSB has released its preliminary report into a landing incident which saw a United Airlines 737 MAX 8 sustain a runway excursion and gear collapse at Houston (IAH) on 8 March 2024.\nThe post NTSB Preliminary Report: United Airlines Boeing 737 MAX Runway Excursion in Houston appeared first on AviationSource News.",
    "pubDate": "Fri, 02 Jan 2026 00:23:28 +0000",
    "link": "https://aviationsourcenews.com/ntsb-preliminary-report-united-airlines-boeing-737-max-runway-excursion-in-houston/",
    "source": "Aviation Source News"
  }
]